{"meta":{"title":"棕榈云店","subtitle":"生活就像一盒巧克力,你永远不知道会得到什么。","description":"","author":"Kisma","url":"http://kisma77.github.io","root":"/"},"pages":[{"title":"404","text":"","path":"404/index.html","date":"02-19","excerpt":""},{"title":"传达室","text":"言简意赅的","path":"Message/index.html","date":"02-18","excerpt":""},{"title":"在线工具","text":"在线思维导图 https://tools.fun/xmind.html 数学画板 https://www.imathtool.com/draw/ 画板 https://vipstone.github.io/drawingboard/drawingboard/index.html 视频、音频、图片、文档等综合工具 https://www.67tool.com 论文查询、下载 https://www.sci-hub.st/ 微软官方免费在线转换服务 https://www.onlineconverter.com/ 易书（免费PDF书籍） https://search.yibook.org 慕课： https://www.icourses.cn 澳大利亚莫纳什大学《预测： 方法与实践》： https://otexts.com ; 中文版：https://otexts.com/fppcn/","path":"HHS/index.html","date":"02-20","excerpt":""},{"title":"留声室","text":"这个博客是我写东西的地方。 如想交流，请留言。","path":"about/index.html","date":"03-30","excerpt":""},{"title":"Categories","text":"","path":"categories/index.html","date":"03-30","excerpt":""},{"title":"Tags","text":"","path":"tags/index.html","date":"03-30","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"03-30","excerpt":""}],"posts":[{"title":"4.04小盈利","text":"盈利了点，嘿嘿 `曾经刻意的读过很多遍斯坦利·克罗的期货交易策略和克罗谈交易，以及能搜罗到的任何有关他的东西，因为他自称是杰西·利物默的隔世弟子，而他所崇拜的那个人正好是我一直以来的精神偶像。但我一直没有真正的理解他，尤其是他引以为豪的“坐守长线”----我就坐在那里，一直坐得纹风不动。 我一直觉得那是不可理喻的交易方式，在我没有学会计算爆仓需要多少仓位和反向幅度之前，我是不可理喻是这么没激情的交易方式是怎么让他赚钱的，在我学会计算只要33%的胜率和超过3倍的赔率就能赚到大钱的赌场法则之后，我的不可理喻是一个正常回档就可能把重仓打爆轻仓打残何况还有大量的几乎接近1：1幅度的回档他凭什么就知道自己一定能挺得过去。 研究了他的操作，我没有得到什么收获，除了一些技术上的东西，但是那不是我需要的。又研究了巴菲特的持股，仍然没有明白何以能“一直坐在那里”，虽然好像有些模糊的部分理解了巴菲特何以能“坐守长线”，但克罗不是巴菲特。 我仍是继续自己的赌博式交易：50%胜率*2倍赔率，任何一个超过标准值就是赚，同时超过就是大赚。三重滤网法则下的切入点与紧贴止损的保护,从T+0到T+1/1+的倒来倒去，倒也其乐融融，尝到不少甜头，忘了探究克罗的长线。只是心里始终有些不安，我知道自己还缺了重要的一课，这门课的老师叫斯坦利·克罗。 我一直没有想过从资金/仓位管理的角度来考虑长线问题。因为我始终都没有资金/仓位管理的观念，我都是一律重仓，至少半仓。因为我的操作周期很紧，而我的止损更紧。短线波动的微薄利润积累，低于半仓那就是扯淡的操作。我认真研究了杰西·利物默的数次爆仓，也认真研究了自己的数次爆仓，我仍然没有资金/仓位管理的概念，但是我用“502”（胜率赔率）的赌场法则解决了利物默如何可以不爆仓，也为自己的不控制仓位找到了理由，但是这让我更迷惑于克罗的“坐守长线”----我几乎是坚信，克罗一定会被打爆。 道理很简单，胜率是有限的，而长线更是靠大赔率来制胜。长线的仓位，即使在70%胜率的超级高手，只要错一次，就可能爆了，因为既然是长线，就必然止损设的很大。而连续做错2–3次，是很正常的事情，无论他是什么样的高手高高手。期货、外汇的长线作手，被打爆的尤其多，大多就是连错两/三次，最后方向做对但是重仓死在回档里。 只有一手，就持一张单。轻仓长持。 说不清在哪里看到这句话的，看的时候也没有在意，但是偶尔在脑子里回想克罗的交易记录，不知道是为什么，突然一下就想通了。原来就是仓位的问题。 巴菲特有句著名的话：“长期来说，股市是称重机”。这句话适用于任何市场。基本分析是很难，很复杂，但是常识就一点也不复杂了。就说连豆，那一年的东北豆农把现货豆卖到了比成本还低一毛多钱，这个价格让豆农喝西北风去啊，结果大家都自己在自个院里建仓库储藏起来不卖了。到了这个份上，常识就说这里是大底了。谷贱伤农，如果这个产业或者产品还能继续延续，如果豆农们今后还会继续种大豆，那么这个价格就是历史性的低价，否则就意味着这个产业或者产品的消亡。就在豆农都不愿意再种大豆的第二年，美国大豆占据了中国大豆市场的半壁江山，并且把连豆变成了芝加哥的影子市场，而连豆当年见到历史大底，从此开始了至今数年（甚至也许是未来十数年、数十年）的长牛走势。其他的也是同样的道理，包括股市、汇市，都是如此，依据常识而不是精确的数据分析，就可以得到重要的结论。只要不是以江恩艾略特之流作为人生目标的死心眼儿，做到这一点不是很难的事情。所以找到“坐守长线”的起点，这不是很难的事情。 难在如何坚持，如何面对反复的回撤，如何面对可能出现的接近1：1的回撤。 这里有两个问题：第一是心态，如何让自己不会对这个长线仓位太在意，不会做“每天把昨天种下去的秧苗拔出来看看”这样的蠢事。第二是安全，如何让自己不会被正常的或者不正常的回档，把自己的仓位打爆。 所以就是轻仓长持。 在既有持仓已经获得自我保护能力，能自己照顾自己之后，再逐渐金字塔加码，而且仍是轻仓加码，直到新加码的仓位再次获得自我保护，才接着进行下一次金字塔的加码。这才是长线。 只有足够低的仓位，才能做到这一点。这就是斯坦利·克罗为什么能“一直坐在那里”，并且坐出千万身家的原因所在。感谢被打爆的长线作手们，是他们从反面证实了这是长线操作的不二法则。`","path":"posts/20230404150001-decc9030.html","date":"04-04","excerpt":"","tags":[{"name":"交易","slug":"交易","permalink":"http://kisma77.github.io/tags/%E4%BA%A4%E6%98%93/"}]},{"title":"大局观","text":"（本文为投机岛论坛@专一投机 发帖的整理版，全文约7万字，一并放上来） 看着那么多的人连连亏损，真是于心不忍。。。 我要说的是，一个聪明人，应该用智慧去做事，你们首先要给自己准确的定位！ 我要说的是，你们99%的人把自己定以为天才与超级天才了，你们仅仅是普通人。 普通人应该做自己力所能及的事！先了解下什么是期货吧，期货是远期交割的货物，说到底就是个贸易。 为什么期货这么残酷呢？ 因为你们没看清诱惑的代价。首先要明白，期货是个好东西，但是期货的杠杆交易却是个极度缺德的东西！全球各大交易所的那帮渣子希望杠杆越高越好，杠杆越高，期民的血汗钱就源源不断的流进了交易所腰包，hoho…这真是无本生意，万世基业啊。 一旦你用了杠杆，那么你就要深刻明白，你做了超出你能力范围的事了，期货的本质仅仅是贸易，现货贸易年均下来，一般人也就10%-15%的利润，而且程序繁杂，辛劳无比。。 如果大家都不使用杠杆 ，交易所的那帮渣子的收入就立即爆跌百分之几百，他们也不会那么得瑟了。期货会产生10%左右整体的赢利或亏损，这是经济发展正常的新陈代谢可以接受的！ 做期货，就是把自己定义为一个做贸易事业的人！！！当你使用杠杆时，你就是个投机分子或者说赌徒了。 投机分子，总想以最少的代价获得最高的收益，一方面绝大多数是受害者，另一方面助长交易所那帮渣子的嚣长气焰。。助长整个市场的残酷。 当你们把自己定义为投机分子时，你们就要有精准的判断行情的能力，这是多么难的一件事啊； 当你们把自己定义为投机分子时，你们就要有超越凡人的承受心理，那需要多么大条的神经啊； 这一切，只是你们过度的放大了你们的贪婪，过度的贪婪，往往是毁灭之源。 期货多么美好的词，可以远期交割的货物啊，多么前卫风骚的美好事物啊； 期货这个美好的词，被一帮利欲熏心及贪婪的家伙毁了。 当你以做现货贸易的心态来做期货时，那我首先要恭喜你，你成功了！只要你究其一生去做，你一定会富甲天，名动全球！ 如果你以现货去做期货，随便顺根日K的20日均线就行了，你需要不断的止损吗？？？ 日内交易，98%的止损在未来两周都可以解套赚钱！你们的大亏，一次次的爆仓，就是不停的止损止没了。你只需要不停的去止赢，震荡不过是给你送钱！ 把握单边一个大原则，20日均线就够了，极限的顶底还可以来个价值投资！ 10万块做一手锌，看错2000点才亏10%，看错4000点，才亏20%。你顺了日K的20日均线，这种错误，一百年也难发生一次，比真正的现货还安全N倍。 而你使用了杆杠，你就要强迫自己在50点，100点，200点，300点等微小的区间内试图判断对行情！这种本事，只有0.1%的人不到可以有。这是多么巨大压力与挑战啊。10万块做一手锌，以最好的心态，最轻松的心情去做，一年照样30%-50%，你们不信吗？哈哈。期货比股票好N倍，T+0，多空都可以做，前提是，你不使用杆杠！ 只是以锌举个例子。一句话，绝对不使用保证金。比如白糖，你也只能7万块做一手！ 一旦你使用杆杠，就将自己置入了危险的边缘！ 还有一点，平时放2等份的资金在帐户里，其它就到股市里逢低买债券吧，那2份资金波动，8份资金一年稳健的再搞回4%的年收益！需要了，随时可以出来。 新人，你们是张白纸，你们有美好伟大的前程，不要跟投机岛95%的赌徒学，你们完全可以开启一份无比美好的稳健的事业。 永远不要去羡慕别人一年几倍几十倍的神话，那些只属于0.1%的人都不到！走最稳健的路，时间与复利一样帮你成就传奇！ 你们要明白，最佳的成功之路，一定是智慧之人所选的，一定是生活质量最高，最容易走的路，一定是最有前途的事业！ 全球那些每年百分之几百的天才们，有几个上得了台面啊？年化收益率26%的巴菲特成为了世界首富！ 脚踏实地的走自己的路吧，不要羡慕所谓的天才！20年后，看下那些天才在哪里吧。 只要你以做现货的心态与资金做期货，时时天天月月年年好心情，吃嘛嘛香，狗窝都能睡出龙床的味道来！开电脑99%是为了止赢刷钱！ 如果你走了错的路，就算你是那0.1%的天才，那么累的赚了那点钱，也不过是节省了3-5年的时间成本，牺牲生活质量与健康换来那3-5年，值吗？ 不要以为你们能领先很久，大资金以后，大家都是一年30%-50%！但是俺天天好心情，基本天天是玩，说不定比那些天天紧张盯盘的多活个10-20年呢？ 多活10-20年都是大概率，信吗？巴老头多么轻松写意，快90了！你整天盯盘操作的吗？ 策略与技术都是末流，智慧永远是第一流！！！ 反驳我的人肯定很多，我知道的。因为你们中的99%已亏得无法回头了，你们是这个功利时代与制度的牺牲品，悲剧啊。。。 如果时光再倒回去10年该多好，如果让你们早点看到我的贴该多好。。。你们是风险教育缺失的的牺牲品！当然，交易所与期货公司永远不会给你们做这种教育，全球皆是！ 全球的金融市场都是个无泪之城的悲剧的循环！ A股，平时，绝对不要超过30%仓，而且不连跌大跌不抄底，一样以指数的20日均线去做，只做中小盘!绝对一生都不止损，做股！跌到估值底部，如上证14倍整体市赢率附近或以下，可以满仓等一波50%-200%。15-17倍PE，最多40%仓。17倍以上PE，顺20日均线，低抄，不要超过30%仓！仓位与估值底（位置）+抄底是A股一年轻松30%以上的法宝。 商品与股指，不用保证金，可以年化50%！因为T+0与多空都可以做。在无比深厚的内功下（现货），一切盘中小区间洗盘震荡，都是给做现货的朋友送钱！一根20日均线，足以看清你需要的大势，100%在你神经接受范围内。现货做期货，你会有无比的好耐心，无比坚定的决心，真正做到多空皆杀，而不是多也错空也错！财富靠耐心的日积月累。 我给新人一个选择喜剧的权利，但愿你们走上正确的路，过上美好的生活，衷心祝愿你们！！！ 给你们看下年化复利效果： 本金10W，50%年化，10年后是576万，20年后是3.3亿，50年后是63亿。这仅仅是一个10W元的小户的复利。 本金50W，50%年化，10年后是2883万，20年后是16.66亿，50年后是318亿！70年后是100W亿！ 赚钱靠的是超级稳定的复利与资金滚雪球！ 十年一梦，10年的时间过得太快了，当你选择正确的路后，那怕是一个低微的起点，也会有巨大的成就！ 那些妄图走捷径的，99.9%灰飞烟灭了，99.9%痛苦不堪！选择我说的这条路，即使水平差点，也足以让你们过上美好殷实的生活！ 最后说一次，选择即命运！各位君子，三思。 据我所了解的某期货公司，一个最老实的客户，10年如一日，30W开的户，每次都是很轻很轻仓，现在3000多W。 大浪淘沙之下，99%的期货人，十年后，不是伤痕累累痛苦不堪，就是N年前就被市场淘汰了。 天天开盘后不间断盯盘的人，绝对不是成功者，充其量是个成功的苦力！ 所有的0.1%的成功的苦力也在苦苦追求向真正的成功者过渡。 开始就不要错，一开始选择正确的路，就是一直都做真正的成功者！ 选择，就是选择做贵族！ 其实理财都无止境。 比如说100W做一手股指，留30W就够了。正常以20日K为操作，很少看错300点。另外70W可以分30%买企业债与国债，这里4%-5%是绝对靠谱且安全的，随时可平仓，40%买年化12%-15%的信托产品，但是要以年结算，30%存银行定期，基本一个组合下来，会多7%的年化总资金收益。 做商品，100W可以留出80W来做最稳健的投资。 欲速则不达的哲理，需要究极的智慧才能领略其博大浩翰的深刻！ 上帝欲使其灭亡，必先使其疯狂的道理在保证金交易领域得到最完美的诠释！ 有人说这市场95%以上的其实都是低于10W的散户，其实资金大小不重要，重要的是这笔钱对你重不重要！ 重要的是你选择做贵族还是做灭亡者！ 重要的是命运对于99.9%的人说，没有成功的捷径！ 你要以99.9%概率被灭亡的代价选择0.1%的成功率也可以。 问题是，只需要有足够的智慧与耐心，选择正确的路，多花点时间，可以100%的达到那0.1%的人的效果与成就。 还有人说一年百分之五十真的没有意义，只能频繁操作了。问题是资金小的，99.9%的重仓满仓是死路！资金只会更少或者没了。 君不见，满仓过夜，2个月55倍的王向阳，现在在哪里？哥告诉你们，2010年他爆得很惨！ 满仓包夜，4W几个月干到2000W的豆油猛女，怎么又被打回老家的？ 重仓满仓长期干的，只有死路一条，99.9%的人的命运，0.1%的天才是例外！ 100%的成功率与0.1%的成功率从你们的选择就注定了！ 技术有个大概的模糊就行了。周K都可以的 不用保证金交易的微妙与奇妙与美妙，说了你们很多人也不会理解的。 我就是100W做一手股指，30-35W做一手铜的人。。 把自己放在合适的位置上。 事实上，95%的期货人，把自己定位完全错误。他们做不成功远远超出自己资金实力的事来。 好好的统计下吧，自己的亏损单，有多少可以是赢利单的，因为你们仓重，盘中就是惊弓之鸟，资金越割越瘦。 95%的人把行情的正常波动震荡，化为了止损，而不是止赢。在小势中，震荡行情占70%，单边30%。震荡叠加的利润一定大于单边。 做日内的，总喜欢让自己界定百分之零点几的精准行情。做日内，没有错，但是这种精准的界定与严格的止损，只有极少人才能做好。 多一倍仓位，就多了一倍的贪婪，就多了一倍的恐惧，就多了一倍的风险，就增加了一倍的操作难度！ 多N倍仓位，就多了N倍的贪婪，就多了N倍的恐惧，就多了N倍的风险，就多了N倍的操作难度！ 一个平凡的人，能想清楚认识到这个道理的不会太多。 我们是平凡的人，追求平凡幸福的生活，没必要为了做个期货，而搞得下场凄惨。 交易的最高境界，不是暴利，而是稳定与安全！资金需要时间的复利来成长。 如果你追求高仓位的暴利，成功了，你可能身体也垮了。 而且99%概率是失败，失去财富，失去健康，失去做人的尊严以及一切可能宝贵的东西。 期市的残酷，皆源于过度贪婪，很少有人能清醒理性的去面对这种极大概率的残酷现实。 我发此贴，我已说了，主要是为了让期市新人及介入不深的交易者看到，能够树立正确的道路。 身陷其中的老鸟，没有当机立断的悲壮，估计绝大多数的人的人生的悲剧会延续。。。你们太累了。 本人理解你们，又无能为力。你们是风险教育不到位及保证金交易的受害者。 所有的技术与策略，对于99%的交易者来说，是放在正常人的承受力的前提下来讨论的。 离开了这一点前提，再好的技术与策略，都是空谈，都是杀人凶器。 在期户开户时，经纪人与期货公司人员开户时，经常的诱导就是保证金制度能让你们10万块做几十万乃至上百万的买卖，熟不知这是毁灭你的根源！ 开了户后，所有的媒体又强调止损的重要性，哎，这其实又是亏损的根源！真正的高手是轻仓顺大势，极少止损的！ 看下巴菲特的股票仓位吧，经常5%，5%，10%，10%的小心翼翼的买入！他追求的是近乎100%的胜率！ 成功不是靠盲目的仓位，盲目的止损，迷茫的小势。 成功靠极轻仓加不停的止赢，靠把不确定的小区间的震荡小势，变成你源源不断的利润，靠把大势利润不停的搞波段。多空通杀，长短通杀。错了，不违反大的原则，就随它去吧，扛下了。98%的止损，在未来两周都是赚钱的单。日内短线的成功率是微乎其微，每个论坛都会有那么几个高手。 但是这些个高手，也许并不是你们学习的榜样，你们没有这0.1%的人的天赋，毅力，执行力与刻苦。 平凡人把对自己的要求放低点吧，轻仓当现货做，顺着日K的均线系统去做，不需要太高的能力，只需要耐心与智慧。 假以时日，平凡人只要坚持走正确的路，也能成为一方巨擘。 如果不及时反省操作行为，恐怕最终难以面对残酷的现实。所有的目前你们看来已经成功的日内交易者，要想成大器，最终还是要转到轻仓日K大势的无上究极金融之路上。 对于95%的交易者，第一步的踏出，已注定了你们的命运。 日K及日K均线系统，简约而不简单，可谓大道至简。 那些凌乱复杂的分K，倒来倒去，止来止去，有几人能稳定获利？ 浩浩荡荡，简约磅礴的日K几人能理解，能信奉为教条？ 轻仓顺日K大势的究极大道，总是被95%的人遗忘，在那0.1%的神话里寻求答案，熟不知那0.1%的人，最终也要转到这条路上来。小势天下有几人能看得懂？ 小区间震荡，又有几人能做到不止损？ 但是我敢肯定，只要有基本的普通的智商，很一般的技术，选择正确的路都会有美好的前程！ 轻仓当现货做，也是那些日内爱倒且不停的亏损的交易者，从根本上扭转操作的劣根性的一个好方法。 曾经一位朋友，100W资金入市，算不小了，几年前开始，抱着暴富的梦想，日内重仓漫无目的倒了好多年，目前还有2万块，失去的东西已无法形容了。。。多年前苦心规劝都不听。一起做日K的几位都接近或超过1000W了，大家的聚会，他也从来无颜来参加了。。人生到处是悲剧。。。股指够稳定吧。 上证跌到2300多点，只要有点常识，就知道不会跌向2000点。100W做一手股指，低多了，要赚那么100-200点还不是手到拿来。 貌似承担了300点风险，其实这6%是白送。 再说句蠢话，大盘跌到2000点，股指会亏15W。但是你要85W再抄股，估计拿几个月就是翻倍。随便举了个价值投资抄底的例子。 市场的波动很大。也只有期货当现货做，才有最好的心态，能完全抗得住波动。 等你实现财务自由了，生活无比轻松写意了。你会明白我的。钱够花了，自己与家人都幸福了，1000W与1000亿都没什么区别。 一旦打开仓位的恶魔之盒，很可能就是你走向毁灭的开始。 要走绝对稳定与安全的究极交易之道，就要有标准的现货商的觉悟。 追求属于自己的高安全与稳定的利润。 你能确保自己是一年N倍的0.1%的高人吗？本人跟做铜，做铝材，做豆油的现货商都打过交道。他们学历并不高，他们生活得都很快乐，踏实，收入比上不足比下有余。 现货的涨跌，他们也受影响。很多时侯他们走一批货，也就赚3%-5%。但是他们对行情的耐心，对生活的知足，对家人的责任，让人敬佩。 我相信投机岛的人，大部份人不比他们笨。当能以一个现货商的心态，持之以恒的去努力时，我相信你们能经营出属于自己的事业。 指望暴利发家，99.9%是毁灭的开始，因为重仓满仓，你们根本承受不了正常波动的压力。 本人历经十多年金融市场的风雨，见过太多悲欢离合。。。 趋势，日K均线系统浩浩荡荡，现货心态做期货，不出1个月，你们就会体会到赚钱的轻松与快乐，而日内乱倒，十年也许都还是菜鸟。 网友说：为什么资金大了后都做长线了 原因很简单 资金大了，一下开仓几十、几百手，价格滑差增大，导致盈亏比大大降低 不要小看价格滑差，有时只要增加一格价格的跳动 就可以让一个年盈利翻倍的日内短线系统变成负期望值的系统 资金规模越大，可以容忍的年利润率就越低 别指望5万以下的散户每年赚50%就满足 专一投机回复：本人商品只做金属，其它都不做，原因不解释。真正的底部，我有背水一战，也要稳胜的决心，你有吗？ 空谈那些东西什么用。铜我都交割了几次了。国标的品质，放多久也是放，底部的仓单，买了货，签个协议，交点费用，直接扔交易所仓库里。价格高了，套保，兑现都行。正是我一次次以做现货的心态与决心做铜，一次次把亏损变成赢利。2004年，2008年都不例外。有什么的。2008年做铜38000抄的底，暴跌下去的，都亏10000点多点。仓单协议拿了几个月，赚10000点离场。没平在高位，也没什么遗憾的。 爆仓亏损这个词，在我字典里不存在，风险，恐惧，失败是投机分子才该有的。 大多数的期市人，都是心智不成熟的，性格有点直，请大家见谅。 如果你们想以艾立信MM为榜样，很好，她的策略理念与思想，可以把你们0.1%的成功率提到5%左右。想进一步成功，则需要向她本人学习请教一些开仓技巧。我相信她不会说出来。她的东西，也不会适合大多数人。操作的难度与忍字诀功力都是要求比较高的。 小艾处于技术与策略的第二阶段，算是比较高级了。 每一个心智不成熟的人，都会有以下征状： 1：静态的复盘，总以为自己找到了多么牛B的指标，可以每月每年梦幻般的收益，其实这只是你们的一厢情愿。 你们忘了，什么是变化，什么是动态。短线的滑点，止损，频繁的信号，都是交易大忌。你们会迷失在不停的否定指标否定自己的过程中。我可以负责任的以哲学的道理告诉你们，万能通杀活跃品种的指标与组合，绝对不存在。在短线混沌的行情里，只有无序的波动是真实的。从迷茫的行情与指标里走出来，老手，需要彻夜难眠的经历，需要夏天感觉像冬天的寒冷，需要痛定思痛，绝大多数失败者要走出失败，需要降低操作难度。走到技术与策略，技术与智慧结合的路上来。新人，只需要一个正确的引导。 2：都在不停的否认自己的执行力不行，不是指标不好的这个误区里。说吧，什么牛B的指标是程序写不出的？欧美日本在程序化上的境界与高度不是你们可以想像的，对于指标程序的组合融合定义，国内最先进的程序都难以望其项背，国内至少要15年后，才能基本达到目前欧美程序化的水准。执行力，可以提高，但是究极完美的执行力（程序），一样改变不了95%的人亏损的事实。朋友们，不要沉浸在纪律的执行力上了，没用的，没有完美的指标。如果指标不跟策略智慧这三种东西结合，再好的指标都是亏损。你们那点可怜的指标与指标组合的定位，国外的专门用云计算机测程序的公司，不知检测过多少遍了。K线周期越短，操作难度越大！交易次数越多，止损越多，亏损与爆仓就越多。盘后，看图，写个指标，让程序去模拟，结果很诱人。实盘则会很残酷。 我发这贴，是希望在交易之路上的选择，引起大家的思考。 认识自己的性格的缺陷，认识行情在短周期上的混沌凌乱，越是失败的人越不容易面对这两条铁律！ 有的人短线做了几年了，毫无建树，都不愿意回头。 沉醉在暴利里，沉醉在别人的虚幻的神话里，梦想自己有朝一日开始巨人般的腾飞。。。这一切都是毒品般的可怕思想。。。 张文军，王向阳，这些期货公司宣传的日内超短线与满仓的典型，害苦了中国千千万万的期民。。 请问他们现在在哪个疙瘩里？？上得了台面吗？当初不是一般人疯狂向他们学习。 日内超短一定是0.1%的成功率，长线来看，0.1%都可能不到，不转型，这0.1%的人都会死掉！ 因为人年纪大了，瞬间判断力，手速都会跟不上，品种行情特点也会变化。 法无定法，我没有把赢利定义为轻仓长线 长线未必，轻仓却是必须的，轻仓日内日K波段两者结合体都是可以的。 轻仓配合简约的技术，尽量多止赢少止损，不要过度交易就好。 操作难度一定要低，低的标准是一个普通的中学生就能完全理解与执行。 期货的短线行情的混沌凌乱。。。。。。 多少才高八斗之士面对它N年都束手无策。。。。。。。 多少英雄豪杰面对它感到苍白无力。。。。。 多少执着之人在否定与肯定中痛苦循环迷茫。。。。。 多少愚蠢的人在自我麻醉。。。。。。 去真实调查下吧，那些号称短线一天交易几十上百次还稳定赢利的天才们，看下他们还有钱吃快餐吗？看下他们被四处追债的狼狈吧 曾2个月55倍的满仓王子王向阳说，他爆仓了，是因为内盘期货不好，他改做外盘去了。听到他的这句话，俺笑噴了。最近10多年，LME与COMEX铜与内铜保持98%多的高度联动，日内一分K都是如此，这难道不是一个品种？而铜又与国内商品指数保持85%的联动。国内国外的活跃品种基本就是一个品种。从下午3点国内盘收盘算起，到早上开盘，外盘铜走的空间，就是内铜跳空的副度，误差0.5%以内。之后铜开盘，就是铜决定文华商品指数的走势。中午开盘价同理。 有思想的高手用技术与策略去应对，大多数的普通人除了用智慧与简约的技术去应对，我想不到更好的办法，这是最容易成功的路。比如你做铜，当你真正的愿意跟铜的现货商去学习下，你就会学到很多书本上学不到的东西。他们的耐心，他们的信心，他们的决心，他们对确定的合理的利润的追求，他们对生活的知足与脚踏实地的一步一个脚印。。。跟他们这些做原材料现货批发的好好学下，你的过度的贪婪与浮躁会一扫而空。 正常人，永远别拿那些0.1%的日内交易暴利之人当榜样。他们就好比生活中，那些会360度空翻的人，你只能欣赏而无法复制。大多数的人复制，注定伤痕累累。 以现货做期货，你就是跟他们同一起点，交易条件好很多，硬件设备少很多。还随时可以平仓。 为什么那些做铜锭锌锭批发的，做国标胶批发的，做豆油批发的现货商们，绝大多数都成功了呢？他们比我们聪明？为什么我们中的大多数人以更好的网上交易的条件却做失败了，深思吧，反省吧。 认识广州一个倒豆油等植物油批发的老总，奔驰600的座驾，家里的健身房与游泳池都有一个蓝球场大，15年前，他仅是一个白手起家的人。只用15年，在微利批发这块，循序渐进做到了现在的成就。 我是轻仓顺日K的较大的图形的势做单为主，严重的价值高估低估了，才会靠基本面判断，轻仓拿个大波，做价值投资。至于技术，投机岛高手众多，我不想班门弄斧。我有基本的自知之明。我技术很简约，目前不想再搞复杂了，我已能用它追求到合理的利润。有好的技术，我愿意虚心向大家请教学习。 有人说5W块能干什么？索性重仓赌一把。 你们错了，5W块成长到500多万，注定要十几年的苦心经营，2个条件缺一不可：苦心经营（努力）+十几年（循序渐进），想走捷径，只有毁灭，我绝不否认0.1%的走捷径的高手的存在，但只有0.1%的概率，最终99.9%的走捷径的人一样要惨败。这条生存法则，没有人可以改变。最好的改变命运的方式，对于绝大多数人来说，一定是循序渐进，脚踏实地。 5W块的人，继续上你的班，买个能看盘下单的手机就行了，又不需要整天盯着盘面。晚上做下简约的日K周K的技术分析，下了单，手机白天看下盘就OK了。 如果没有一个好爸爸好爷爷，你要改变命运，只有从自己做一个好爸爸开始。 每一个要做大事的人，没有十几二十年的忍字诀功力加足够的韧性与克制力，是不可能领略成功的。 我一直认为，重仓满仓的人，不是无知的可怜虫，就是对家庭对自己的未来极其不负责人的人，这个评论对大多数人一定是中肯的。 比如做铜，30W-35W做一手，你跟现货商一样的起点，这个一手期货铜的波动有多大呢？ 铜一天日内波动2000点是常态即1W元，一个月常态波动22W，一年是264万。不要以为一手铜一年赚15W很难。你只要赚到波动的5.68%-6.65%的钱，你就完成你一年50%的目标。 我要说的是，期货铜跟现货铜一样的生态环境与行业背景，差价都在微小的区间。但是期货铜日内的震荡空间，可以利用的机会，却是现货铜的N倍。 微利倒腾铜锭锌锭的批发的，我的调查，行业优秀者可以50%-80%的年利，当然这种人都努力了好多年，有广泛的客户。 为什么做现货的只有做期货铜的N分之一的可交易机会加可震荡利用空间，为什么80%的都可以做成功呢？ 只要不是吊儿郎当的，经营管理不善的，苦心经营的做现货的成功率可接近95%都赚钱。 而做期货铜的95%都亏钱？你们亏钱的根源在哪里？？深思吧。 太多的人都迷失在日内的小势的混沌凌乱里 这个世上再高明的人，也无法给你们一个准确的答案：做小势，又能战胜小势的混沌凌乱的能广范运用的做单技术 某个品种上，某一个高手或许有独特的术法能够日内战胜市场，但不能战胜所有品种的混沌凌乱。或者说这个术法是非常复杂的他（她）的经验组合，复制无法达到他本人的境界。他（她）本人就是道护城河。 本人见过超短N年都稳定获利的神人，但是我要告诉你们的是，他的几个学生，身边呆了几年，看着他下单的都无法复制他的手法。此人在国内期货交易界自然是个传奇。但是师从他学超短的几个学生，都瞭倒得很。 操作越复杂，越频繁，信号越多的短线术法，本身就是高难度的360度空翻。 大多数人抵制不了某一个术法的的成功的暴利故事的影响或者说自我的无知盲目而放弃了金融大道的修练 最终悲剧收场 术法修练成功的难度高于大道1000倍都不止！ 大道是简约，日积月累，循序渐进 任何术法层次的最高境界者，要想更进一步，必须无条件的转到日K周K大势的王道上来！ 什么是金融大道的修炼？ 说句实话，我自己都羡慕能看到我这篇文章的新人的福气与运气。 我用两副图简单的介绍下： 这副图，是铜1201的日K，好好看看吧 我主要是看20日，60日，120日均线操作的。 我深深的知道，行情每一次跌破或站上60与120这样的中期均线，都是开启宏大的波段行情的大概率起点。 这个时候依托顺从均线，可以获取最高最安全的赢利！ 1000-2000点的区间，就足以赌一个大波段，这对于轻仓来说，仅仅是总资金波动1.5%-3%，无伤大雅。 我做日K，目前平均2周止损一次。 比如10月28号的中阴K线一出，它代表的是依托20日均线的反弹，严重的受阻于60日中期均线，依托60日均线逢高放空，也只有1000多点的风险。但是你要想在短线的混沌凌乱里战胜市场，你可能就在在10个交易日里面临100-500点的小区间的止损N次。。 正常的容忍判断区间，你们想人为的压缩，那不过是自寻烦恼 好好看下，每一次60日等中期日K均线的活跃品种的压制与支撑开启后，是不是最安全的，是不是可以大副赢利，你只需要耐心点就好。 以60日均线为例，每一波其对铜的日K的支撑与压制，平均区间8000-10000点，高区间15000-20000.平均时间一个月！全天下有几人能一个月在混沌凌乱的短线行情里铜赚1W点以上？？ 如果有，也只有两种人：0.1%的会360度空翻的人。第二种骗子。 日K一定是最稳定最安全的操作方式 从我的图上，慢慢体会日KK线形态与均线系统的浩浩荡荡又无比简约的大势吧 过重的仓位，你自然无法抵御日K趋势正常的波动 这是白糖的图。虽然我不做糖，我也分析下这个代表性的品种。上图，白糖从6月至今，也就2个大势，60日均线的支撑与60日均线的压制。你唯一需要做的是配合K线型态与小均线在60日均线以上逢低做多，空头K线就卖出，等低位再多。 行情偏离60日均线过远，就将止损上移到20日均线。 9月5号开启的60日均线的空头，每一个止跌的阳K出了，可以配合小均线平了休息下，等位置与形态继续高空。 只要止损合理，大势稳固，好位置都可以开仓。当你们迷失在短线行情与凌乱里，最好的方法是跳出来，看下日K与日K均线浩荡的大势。 轻仓代表的是你的容量，你的气度，你的雅量，你的格局，你的容错能力，你的抗打能力。。。很多人想在日内短线行情的混沌凌乱里，占尽所有的市场的便宜，想以最小的止损获取大的止赢？我告诉你们这本身就是逆天的事情。比如上图的白糖逢高以60日均线放空，60-100点风险，你可以N次获利几十到几百点，但你想6-10点，10-20点的止损去谋取赢利，等待绝大多数人的是N次的止损！重仓的本质绝定了你们的容错气度很小，你们的容错气度决定了你们人生与事业的格局！短线行情的混沌凌乱，永远不是你们想像的那么简单。艾立信的策略也仅仅是回避混沌凌乱行情谋取日内波段的一个策略，仅仅是一个策略，而且这个策略的开仓点，对于大多数人而言本身就是道护城河。 有人说“做期货的，日k线其实 不是很准确的，因为很多时候，一波大的上涨行情，居然连续6根 高开的阴线！”本人主要用均线 K线辅助判断。 伟大的市场不是任何指标可以确定的。任何指标的作用都是参照物。参照物的对错只是个概率。 有人问：“那么对于日K，均线的拉平你又怎么处理呢？”回复是：合理的容错区间。均线可以拉平，但一定有相对稳固的势可以参考。轻仓不怕这个。你所说的震荡这种蛋痛行情是重仓交易者最怕的，轻仓交易者最不怕的。 专一投机回复（2011.11.11 15:19）： 正如我发的第二副图，最近一个月，其它均线多次纠缠，但并不纺碍60日均线的持续压制。 再说下日K线的重要性，有人轻视日K线，迷醉于日内的分K周期，我不知道这是不是金融交易者的最大悲哀。。 本人从K线之祖，本间宗久的故事说起吧。 纵观全球金融行业最近300年，能够超越本间宗久对K线的理解，对流通领域差价的理解，并且知行合一，创下巨大成就的，全球300年，不会超过10个人。 本间宗久，家乡日本酒田。因他奠定了近代K线学，他发明的蜡烛图技术又被称为酒田战法。酒田战法简约但绝不简单，认真学习，个人认为也需要半年才能理解好，要实战好，可能需要2-3年或更久。恭请那些了解了一点K线学皮毛的就别随便否定日K线。从你否定日K的重要地位那一刻起，你的成功的概率已下降了90%。18世的日本，资本主义的生产方式已经兴起。但是18世纪初商业与商人在日本还处于日本社会最末端的地位。本间宗久1724年出生，1750年出道，接管家里生意，时年26岁。1803年去世。1750年的日本，农业高度发达。农业的高度发达，带来了大米经纪业务的高度发达。大米期货交易盛行到何种程度呢?为了帮助大家形成一个清晰的印象，请看下面这一组数字;1749年，大阪总共有110，000包(当时大米是用“包”做计量单位的)的空米库券在市面上交易，然而，当年全日本的实物大米只不过3，000包。这种经纪业务的发达，放到目前的最活跃的大宗商品来说，虚拟的规模都要超出其3倍多。 当时日本有两大交易所，大阪的堂岛大米交易所与江户减前减前交易所（江户就是现在的东京）。 这是我们的主人公，后来的市场之神本间宗久当时所面临的基本社会背景。本间宗久苦心经营30年后，积累了富可敌国的财富。他的影响力在当时的日本不亚于李嘉城在香港的影响力。 于是当时的日本传开了这么一句谚语:“这辈子能挣上领主的宝座，却休想象本间宗久一样有钱”。 由于他巨大的影响力与财力，日本天皇亲自册奉他为武士。在日本那个等级制度森严的时代，他开创了一个传说。由最低贱的商人，转变为最高贵的武士身份。晚年，担任幕府当局的财务资政（财政部长），最后遁迹佛门，享寿70岁。本间宗久苦心经营的30-40年，就是他实战酒田战法（K线学）不断摸索成熟完善的过程。 最终他用日K与日K组合的神奇魔力，累积财富，最终达到了可以掌控日本两个大米交易所米价的地步。 这种成就足以证明日K线的伟大与神奇，置入其境的想下吧，这是个让人震憾的成就。 日K与日K组合的魔力与神秘，显然不是很多人认为的那么简单。他的市场研究著作(《酒田战法》和《风、林、火、山》据说成书于18世纪。他在大米市场上所采用的交易策略，后来逐步演化成了现代日本投资者所应用的蜡烛图方法。(注:“风、林、火、山”四字，典出《孙子兵法》“军争篇”。原文为“……其疾如风，其徐如林，侵掠如火，不动如山……”意思大致为“行动迅速，如风之疾，行列整肃，其严整舒缓如林;攻击时如烈火燎原，防守时如山岳巍然。”) 要真正在K线学上有一定成就，需要了解K线学的鼻祖，市场之神—本间宗久先生所走过的心路历程！ 了解他的在大米交易上的非凡的智慧。了解他，需要从拜读他的相关书籍开始。 本间宗久开创了一个时代，他成了差价交易的一个难以超越的传说。 交易本来就是要从过多的诱惑，过多的完美，过多的混沌凌乱中走出来，去繁从简的过程。 简约的美的内涵，不是一般人能够领略的。 无论是多少分K的K线周期，请问不能在日K的上下影线上反应出来吗？ 如果有较大的分量，上下影线会体现，无足轻重的30分K的行情，需要搭理？ 日K为主，辅助看下周K，已经是很奢侈的享受了。 对于我而言，我是个凡的不能再凡的人，我没有追求完美的权利与资格，日K辅助周K加均线，是我最完美的残缺。 外盘期货能更好的反应K线的连续性。内盘只有4个小时交易，只能说是一种遗憾。 内盘的K线跳空的确讨厌，我只做金属。联动够紧密。其次豆类联动紧密。 没有办法，只有每天开盘前做功课了。计算内铜下午3点后COMEX铜到早上9点走的副度了。这个副度可以以百分比大概定位的。误差0.5%以内。 忘了提醒你们，不要看LME的涨跌，更不要看软件上显示的外盘前一个交易日的涨跌副。 高盛等国际投行对铜市场的研究是基于COMEX美精铜。正所谓“外行看伦铜，内行看美精铜”。 原因，LME铜2点就闭市了，LME市场先于美国股市3个小时闭市，因此其收盘价蕴含的信息没有融入美国股市、债市等市场。 LME没有反应对应的北京时间6点-9点的美国金融市场的行情。 金属，农产品的定价权一直在美国。 K线跳空，产生的K线的差异，可以通过计算联动价差比率心中有数，也可以看美国盘的连续的K线走势来衡量。 均线的排列上，基本一致的，内盘通过跳空弥补交易空白时间的价差。 应岛上多位朋友的邀请，我再对本贴的一些延伸的内容做下说明。本人只是个普通人，我说的东西，仅供参考。 很多朋友技术与实盘都比我好，你们都值得我学习。我无心也无力与任何人争辩。 我对日内并无成见，但是忠告，日内波段成功率远远高于炒单。 我对仓位并没有成见，但是忠告，做波段，轻仓为妙。(1/3仓以内为妙） 我对任何人无成见，对事不对人。股票领域，股票作手利费莫尔，一直是我的偶像。利菲摩虽然失败了，但其前大半生的辉煌与人生后期的惨败，给我最深的启发与风险警示。 斯坦利.克罗是利费莫尔的粉丝。克罗站在他的肩膀上，只运用了他的核心操作理念，而且扬弃了杰西•利文摩尔一些失败的原因（敬畏市场）！ 克罗坚定的以图形来操作规避系统风险。 斯坦利.克罗，则是我最好的老师。他是忠于自己的交易技术与交易策略与思想的大成王者，值得反复的学习。克罗的交易境界，是我一生的奋斗目标。 床头，摆着他们的书，每看一次，我都会多一次坚定与信心。 在我说延伸的东西前，先让大家真正了解下利费莫尔所处的时代背景。利费摩尔的悲剧源于特殊的时代背景 利费莫尔是一个传奇的股市人物,他为股市而生,15岁开始炒股,经历五次破产,四次东山再起,纵横股市40多年。在那个时代，最高峰富可敌国。1923年股票作手回忆录出版。1929年利费莫尔天才般的在最高价附近做空，赚了近一亿美元。1929年的1亿美元是笔庞大到无法想像的财富。当时美国全年的税收也只不过42亿美元。1930年他达到人生事业顶点，并开始走下坡路。1931年他输掉了他一半的财富，1933年他输光了他的财富。他所有的钱都亏于1930-1933年股市极限杀跌后的抄底。1940年饮弹自杀。利费莫尔在那个时代的成就，只能让人仰望。他的最终3年内的投机事业的败亡，其实不是源于他的风控不行，不是源于他智慧不够。而是源于整个股市的崩盘，源于150年来最严重的一次系统性风险，颠覆一切既有经验与知识的经济危机。1929-1933年的经济危机是资本主义世界爆发的空前的大危机。之后，就是残酷的第二次世界大战。以价值投资闻名的巴菲特，如果他赶上1929-1933年危机，等待他的也一定是灭亡。只是巴老1930年才出生，赶上了好时代。 利费莫尔不是不够强，是运气太差。我们有幸能在今天看到 利费莫尔这位一代宗师的成功的经验与失败的原因，并加以借鉴，是我们的幸运。他自杀了，也许是一种人生的解脱。二次大战，上一亿人死亡，全球数十亿人动荡不安，活着也许是最大的幸运，有谁还去指望财富呢？ 让我们看下利费莫尔的那个时代，众多投资者人生悲剧的背景吧。 从1930年5月到1932年11月，股市连续出现了6次大暴跌，道·琼斯指数跌至41点。想想它的极度变态与恐怖吧！！在这场股灾中，近4000人因破产跳楼自杀。欧文·费雪这位大经济学家几天之中损失了几百万美元，顷刻间倾家荡产，从此负债累累，直到1947年在穷困潦倒中去世。利费莫尔选择自杀，也是受了感染的。其经济危机又引发了遍及整个资本主义世界的大萧条：5000万人失业，无数人流离失所，上千亿美元财富付诸东流，生产停滞，百业凋零。 此后，美国和全球进入了长达10年的经济大萧条时期。股市近乎于崩溃，我们的天才主人公靠什么赚钱？能在今天，赶上好的时代，学到一代宗师的终生心血的精华，我感到奢侈的幸福。 1929年-1933年以及此后长达10年的股市低迷，可以这么说，所有参与股市的，几乎没有幸存者。这是颠覆一切常识所有人皆输的一次空前的危机。此后，经过罗斯福新政和二次大战后对经济的刺激，美国股市逐渐恢复元气，一直到25年后的1954年终于回到了股灾前的指数水平。 利费莫尔的悲，撇开当时股市的时代背景来看，是不科学的。他的投资失败自杀，丝毫不影响他一代宗师身上的光环。他的悲，说明超大的系统性风险是存在的。 顺应技术图形的大势比基本面价值投资更靠谱。以人为镜，可以知得失，各位君子，三思。 从利费莫尔的人生大悲上吸取教训：我们要树立筑起技术的护城河的意识，以图为师，严格控制风险。 先学习利费莫尔的第一句金言： 耐心等待市场真正完美的趋势，不要做预测性介入； “时机就是一切”，在恰当的时候买进，在恰当的时候卖出。 耐心、把握时机是杰西Ÿ利弗摩尔获得成功的诀窍。 “交易不是每天要做的事情，那种认为随时都要交易的人，忽略了一个条件，就是，交易是需要理由的，而且是客观的，适当的理由。除了设法决定如何赚钱之外，交易者必须也设法避免亏钱。知道什么应该做，跟知道什么不应该做几乎一样重要。 事实上，如果我在开始交易前，肯定自己正确无误，我总是会赚钱。打败我的，是没有足够的头脑，坚持我擅长的游戏——也就是说，只有在前兆对我的操作有利，让我满意时才进场。做所有的事情都要讲时机，但是我不知道这一点。在华尔街，有这么多人根本不能算是大傻瓜，却遭到失败，原因正是这一点。傻瓜当中，有一种十足的傻瓜，他们在任何地方、任何时候，都会做错事，但是有一种是股市傻瓜，这种人认为他们随时都要交易。没有人能够一直拥有适当的理由，每天都买卖股票——也没有人拥有足够的知识，能够每次都高明地操作。” 看看那些爱显摆的频繁操作的短线客吧，有几人能成得了气侯，上得了台面？我从不否认有极少数的高手的存在，但是频繁操作的短线客中的99%注定是炮灰。交易，就是做最好的势，最确定的势，最有把握的机会。我宁愿拿出300点的止损去赌一个大概率的相对稳固的势，也不愿意拿50点去赌一个小势。赌小势永远是得不偿失，你想拿50点赌一个小势，最后付出的代价可能是满盘皆输。没有你有把握的势，你最好的操作就是不操作。没有合理的止损范围内的大势观，你最好的操作一样是不操作！ 我用一句股市俗语来解释：会买的是徒弟，会卖的是师父，会空仓的是祖师爷。祖师爷在寻找在等待他看得懂的最完美的机会，最安全的势或者位置。 不相信吗？天天买卖股票的，99%是失败者。一天倒N次期货的，99%一样是失败者。 金融市场不是怕没有机会，而是太多的机会。就怕你的钱，莫名的亏光了。日内茫无目的的跟着小势开仓，不过是被多空来回的杀，赚了，以那点小势的时空，也不过是点毛毛雨。 每一次交易要深思熟虑，有严格止损的前提下，去赌大势。把那些你真正看对的大势基本都搞对了，无论是日内大势还是日K周K大势都是可以的。 倒了几年还不知所谓，瞎折腾的人，我不知道怎么形容你们。没有成为日内高手的本事，就该急流勇退，反省自己，转换交易方式。日内短线是性格最完美，行动力最敏捷，且技术最好的一类人才可以成功。我是世界上最差的一类短线交易者。N年的沧桑后，。。我可以面对最优秀的短线交易者，那怕是一个月赚1000W，哪怕是一年20倍，我也丝豪不为所动，哪怕是我身边的朋友。本人永远直到永远直到永永远直到永永远远一丝一毫也不会羡慕崇拜任何一位会360度空翻的短线高手！静心等待属于自己的机会，给出合理的止损，去赌出属于自己的波段行情。一波一波的推进，一波一波脚踏实地的前进。把利费莫尔的另一条金言也写在身边：“钱是坐着赚来的，而不是靠操作赚来的。” 请问下，那些一天交易十几次，几十次的人？一天真有那么多的趋势？那不过是人性的一种紧张，慌乱，恐惧的淋漓尽至的表现。。 “在华尔街混了多年，输赢了几百万美元之后，我要告诉你：“我之所以赚了大钱，从来跟我的思想无关，有关的是我稳如泰山的功夫，明白吗?我稳坐不动。看对走势没什么了不起的。在多头市场你总能找到许多很早就看涨的人，在空头市场也总能找到许多很早就看跌的人，然而他们却没有从中赚到多少钱。能看对市场而稳如泰山的人才能赚大钱。” 请告诉我操作是什么？想通过对日内小势的不停高抛低吸，不停的倒差价，积累财富吗？我可以告诉你们，那不过是你们美好的梦。能持久？你们所看到的日内高手，90%也是以日内波段的理念做日内做成功的，绝对不是小势的反复倒差价。一家之言，仅供参考。以日K的大势指导短线，一天也不会有几次交易。谋取日内与日K波段收益，一天2次交易已是多的了。日内的高昂成本，不是想得那么简单与单纯。本人曾倒短线时，N次开在日K极其经典位置的单，莫明其妙倒没了，有的本日K持仓巨赚的，乱倒短线成变成亏损。 赢利特别是波段赢利一定需要时间发展。赢利需要在你的开仓点位，不打止损的前提下，去坚定持仓。让赢利有时间去发展。 对于最后的总结，也许会很简单，我不想把自己对日K周K的大势的理解来定义大势。我能给的只能是建议，仅供谨慎参考。 一句俗语，长痛不如短痛！平凡的像我一样的普通人，最好是按日K周K或你能确定周期的大势去做单，哪怕一次止损的代价大一些。太小的止损止赢一定会搞坏你做单的格局与心态。但是，也不要太大的止损。正常的1/3仓，老手操作，赌一个小周期波段行情，一根K线就够了。就是你入场的那根标志性K线，那根相对完美的大数概率的势所标志的K线。作个设想，一波宏大的20日，特别60日，120这样的日K均线长压以后，那么对称的反转开启日K呢？ 假设60日均线长压1-N个月以后，你能理解重新站上60日均线这一天，所开启的浩浩荡荡的日K大势吗？ 假设120日均线长压1-N个月以后，你能理解重新站上120日均线这一天，所开启的浩浩荡荡的日K大势吗？ 反之同理。 日内同理 比如五分K的MA60，120前一个较大的波运行后，多空转换了，在行情反转点，不可以以大博小吗？ 亏了，砍仓走人，止损相对少，目标明确。没有这样的较好的大势，除了默默等待，还能有什么办法？很多的人都是很有才华的，过度的盲目的交易，盲目的崇拜毁了自己的前程。。。 也许只有一段灰暗的人生后，一段刻骨铭心的记忆后，一些人才会做回真正的自己。 脚踏实地，一步步走自己的路，做自己看得懂的行情，该多好？为什么，要那么可怜的盲从360度空翻的人？为什么要盲目的交易？过度的交易？ 太多的人总想从不确定的行情，不靠谱的360度空翻之人身上找到交易的答案，我明确的告诉你们，你们究极一生都不可能找到！ 你们唯一能找到的就是：练好基本的技术，给出合理的止损，做你确定的行情，有把握的行情。把每一次交易当成是你生命的一部分来对待！ 财富的累积就是你一次一次，一步一步做自己有计划有把握的交易开始的。大智若愚，大成若缺的智慧，不是倒了几年短线就能明白的。 能真正理解用合理的止损去赌浩荡的大数概率的大势观的人，绝对不多见。 就算你用超短日内很幸运的赚了1000-5000W，依然是我眼里上不了台面的小角色。因为有些深层次的东西说了很多人也不懂。 2002年-2006年一位前辈反复教育我，我仍然固执己见的瞎倒短线，自以为可以做得完美些，自以为可以暴利。 迎接我的自然是惨败。 当我再次与他相遇请教时，我真的感慨命运。。。。。。感慨脚踏实地与步步为营的战无不胜攻无不克的伟力。感慨一个不起眼的小的起点，在正确的道路上走上十年后，时间与复利竟然造就了那等辉煌的成就，。。。在他30层的办公楼上，我唯一看到的是前方清晰的路与瞎倒短线那冤枉的度过了最美好的几年的青春时光。法无定法，世尊说法也无法可说，有的只是比喻。。。 金融市场的法更是法无定法，一切法都是对的，一切法都可能是错的。。 就像本岛最热贴艾立信的贴一样，很多人都走入了误区，想寻找她开仓的依据，你们觉得这有法可得吗？ 法是她的经验，她的主观经验的一个集合的元素，不存在固定的法。。 想寻找到金融市场不败的具体的量化的法，那注定是个乌托邦。。。 学她，仅需要知道两点：可控的止损+策略平仓，她的策略平仓仅仅是为了获取一种固化的持仓时间（开仓到收盘）所走的自然的利润。就连可控的止损副度都是因人而异，你无法每次做到10点去判断一个大势观，那就15点，20点，30点。。。只要你能够确定的大数概率的大势观就OK。每个人的知识，学厉，经验经历不同，所产生的认知大势的偏差自然也不同。 我举个例吧，以股指为例，我不是可以10点就能判断出方向的人，我是普通人。最近小周期，我唯一能判定的是：逢低依托MA20做多，逢高则依托MA120做空。我看大势的融错区间是35-70点。觉得承受不了就轻点仓， 设好止损，等钱。 金融市场永远是法无定法，日内短线行情更是混沌凌乱，马后炮的静态复盘，N+1种指标都是无比美好的。。。 要认知法无定法，无定法可依，需要实战，需要经验，需要交流，需要学习，更需要智慧。。 金融市场唯一不变的就是变化。。。 所有的时间窗口，所有的指标都是种定性，都是定法，在某些行情中，它们都是错误的。 交易能确定的只有三件事： 1：你的止损 2：你的大势观（每次的大势观因具体的行情，位置与趋势及合理的止损而确定，它是经常变动的） 比如A次开仓你以一波杀跌后底部站上五日均线为大势观，止损，站上五日均线这根K线的最底价击破止损 比如B次开仓你以一波上涨后顶部出现一根明显的空头卖力K线，止损开仓K线最高价越过或固定止损 比如C次开仓是60日均线跌破做空，止损进场K线最高价 比如D次开仓是120日均线跌破做空，止损进场K线最高价 比如E次开仓是一根带一定上影的标志性空头周K做空，止损上影最高价 。。。法无定法，势无定势，寻找K线与均线的大数概率的势，用科学的合理的相对少的止损去赌出行情来，去赌出市场的那种常常发生的大波动 3：市场的本质是波动，市场一定会常常发生较大的波动。 对于非真心交流的抬杆之人，我无心也无力回应。 自己去理解“沉默”这个词的另外的含义。 对于我所理解的东西，仅供有缘人参考。仅仅是参考。 本人对于自己的操作之道的选择，对于追求的目标，至少此生会坚定不移的一心一意的走下去。 任何杂音与干扰，都是徒劳。 无论你们一年赚多少万，无论你们一年赚多少倍，在我眼里都是浮云，不羡慕也不想去了解，更不想复制。 唯一想做的正在做的事，就是脚踏实地，走自己的事，精心准备，做好每一笔交易。 赢要赢的光彩，输也要输得明明白白。本人是深度痛恨随机交易行为的交易者。 现在的我，盘中基本无所事事，坐在2米开外的椅子上，一台电脑看碟，一台电脑看盘等开仓机会，等钱。 准备工作与分析工作，盘前就做好了。 那要看你对随机的含义的个人理解了。随机与大数概率的大势是相对应的。随机的势，显然是很短的势。 很多的失败者，在于随机开仓，轻易止损，频繁的太早的否定自己的开仓。 我指的随机，是一种随性的草率开仓。特别是基于自己的主观或很小的分K周期的稳固性相对低的势的开仓。 法无定法，所有的交易系统都是伪命题。。。但是伪命题在某个品种或某个时段上也可以赢利 所有的交易系统都是扯淡，想以一成不变的系统应对千变万化的行情，应对K线与均线的混沌凌乱，我用一个成语来定义它：刻舟求剑 没有策略，思想，智慧的结合，所有的定法机械的执行，注定是悲剧。。。这是无法挑战的哲学原理，任何人任何系统概莫能外 如果有定法可依可行，全地球的财富都要被掌握此法的人赚光，没有悬念的。 一旦有人说掌握了一个牛B的定法，那不过是一个SB的笑话。。。 没有思想策略智慧的元素结合的定法，永远直到永永远都是笑话与悲剧。。不服者，沉迷沉醉定法者，大可实战五到十年后，再来看我的这篇贴吧 市场是什么？市场是各种人性汇集的场所，是各种大众心理波动的一面镜子。 人性与人心都是变幻莫测的，想以一个指标去洞悉市场，就跟以一个指标去洞悉人性人心一样的艰难。。 我一直都很敬佩那些股票期货的资深分析师，很多人很抵制他们的。熟不知每一个股票的合格的行业分析师，每一个合格的期货金属分析师需要多么的努力与勤奋，N年的资历与高学历及自身能力排开不算，那些自我领域的丰富知识对很多普通人来说，都是很难达到的高度。我跟那些分析师学习时，常常能学到很多东西，常常感到自己知识的浅薄。他们的努力，说句实话，很多交易者都远远的不具备的。好好的看下期货公司的研发吧，办公软件不够纯熟的，一副图都可能做2-3小时。。。很多从业人很努力，很多散户交易者很吊儿朗当。。 我说上面一段话是有深意的，我想告诉你们，分析师的大量存在与常规配置，说明了一个深层次的问题：期货公司的高层领导，证券公司的高层领导，金融监管机构的高层领导都不是SB，他们都是有高度智慧的，早就洞悉了这个市场的规则，他们深刻的知道市场没有定法可依可行！所有的分析师的努力都是为了向客户提供一个参考： 寻找特定时间窗口行情的大数概率的相对稳固的势！ 如果有定法可依，所有的证券与期货公司的研发人员可以下课了，省下一笔巨大的费用。每个公司配置两个程序员就万事大吉了。 我用这种倒推推理的方法，让你们去思考一些东西。 好的术法加上自身特别努力的，可以成为小资金中1%，乃至于0.1%的姣姣者。但这局限于小资金快速成长的那3-5年。 术法玩得再好，也就节省3-5年时间。以后还得一步一步脚踏实地的走。 大资金一年一倍以上的已是神。目前国内管理5亿以上的基金经理，最高的年均收益是88%，这已是神级水准。 这样的收益也就持续力3-5年。没有人能改变规则。资金量大了，一年50%就是很好的成绩了。 纯粹的靠程序三年300倍，没有可信度的，可信度基本为0.全球像天胶这样容量与活跃度的品种，可以找出100个以上来。 以这个定法，只需3-5年，就算做短线，成为中国首富，只需8-10年，成为全球首富。华尔街天文年薪随时恭侯这样的程序天才。 2倍的杆杠，加上自有资金，3/10仓，接近1/3仓，对于老手来说，是一个比较科学的仓位。 做日内交易的，可以这么说，止损的副度其实是最重要的，间接决定仓位的轻重，决定了对行情波动的承受力。 做日内交易失败的，85%败给了太小的止损，15%败给了太大的单笔止损。这是我曾跟朋友对期货公司亏损帐户的统计记录。 止损一定不能设太小，否则是看对趋势，做错单，反复割肉。 科学的止损应该要容忍一定的波动，科学的止损与日内小止损是批发止损与零售止损的关系。 执行零售止损的人，99.9%死无葬身之地的。 比如40点SR的止损，你把它分割成8次，每次砍5点。其实这是种无法形容的极度愚蠢做法。 理由如下： 1：8次，首先多亏8次手续费。这里是100元左右。 2：8次，至少12个点的滑点，这里是120元。 在同样止损的前提下，多亏220元。 如果是40点以内的反向波动，你几百元就白砍了。40点以内的反向波动，40点止损的还要赚钱。 即小止损者，即输比率又输概率。在关键狙击位，设合理的止损，保证自己不被洗掉。 反复的小止损，远比一笔相对较大的合理的止损难过得多。反复的痛，不如痛次大的。小止损的人是最拿不住单的人。99.9%的此类人99.9%概率，做单是即输概率又输比率。 实战中体会吧。有时，为了依靠一个相对更稳固的势来猎取波段，多付点止损是明智的。 不要迷信那些小概率的案例，特别是那些低到1%以内的概率的案例。 散户最需要的是改变自己的格局与勇气。羡慕别人与盲目的复制能改变命运吗？ 散户最大最大最大的缺点之一就是不能容忍单笔较大的止损，他们醉心于学360度空翻的高手，试图以很小的止损去精准定位市场，精准定位行情！ 散户最大最大最大的缺点之二是持仓的时间过短，极难赚大钱！日内做惯了的散户，赚钱的单，很多人几分钟时间就跑了。很多人做了五-六年，赚钱的单从没有拿过2小时，这是我曾从一些失败的记录里的真实复盘记录。 散户最大最大的缺点之三是盲目崇拜盲目自我激励，这是一种极度无知极度愚蠢极度无耻极度贱格的表现！比如某某某短线一年赢利多少多少倍，我一定要向他（她）学习，学习他的方法超越他（她），之后就是一大堆的意淫。。。别人一年几百几千万，与你们有一毛钱关系吗？从来不去了解这种手法成功的概率，成功者打磨了多少年，有怎样的经历与训练，有怎样的努力，有怎样的家庭背景与职业素养。。。借着别人的钱去赌的，要养老养小的，你们伤的起吗？学1%概率的手法，难道不是极度无知极度愚蠢极度无耻极度贱格？ 我学习过的现货商，好几个行业从业背景十几年，但是我无比明确的告诉你们，在其自身所处的行业跌爬滚打十几年，他们也没有精准定位行情2%以内的能力。散户，99%的都是神仙，经常在0.1%-0.4%区间去止损，去定位行情，我只能说，我对你们的敬仰如滔滔江水般连绵不绝。。。。。。你们都是神人。。。 借助K线与均线，能将行情定位于1%-1.5%以内的，都是不错的成就了。 盲目的下单，不停的精准定位，不停的止损，进入一个恶性循环，这是大部分日内交易者失败者的源泉！ 15%的失败者，没有止损概念，是单笔大额止损干掉，盲目的抗单。 成功者最大的共性是努力去做自己最有把握的事，做自己最确定的事！ 绝对不是去做代价最小的事，代价再小，不能成功，有用？ 理解我这段话，好好的理解，一步一步的去做，把每一次交易都看成是你的生命的一部份，精心做计划，按计划交易，几千块都能让你从期货里绝地翻生。几千块，你们以为很小吗？如果你认为小，给你几百万，也是败光。成功与资金大小毫无关系，只与你的思想有关系。思想有多远，事业有多远！ 我以6000块举个例子，6000块足够你RB看错600点，足够你SR看错600点。足够你豆类看错600点，足够2手玉米看错300点。 只要你们不是猪，只要你去认真做了计划，你几乎不可能输的。但你们想拿这可怜的6000块去学定法，去不停的小止损，去无耻无知的学空翻高手，99.9%概率活不了一个月，乃至半个月。60W都不够你们去无知的去挥霍。 做不了体操王子，不代表你们的人生不能成功。但你们要刻意的无知的无耻的学李宁，注定是死路！ 成功需要代价，想付出最小代价成功的人，往往是付出无限大的代价后都不能成功。 交易是严肃认真的事，不是让你去随机开仓，盲目止损的。 以大势观去做单，以相对科学的相对较大的止损去做单，是既赢概率又赢比率！ 以小势去做单，以小的止损去做单，是既输概率又输比率！一定是双输。 比如RB做单，你很高手，先把止损放到40点再说，还无法从日K周K大势里定位稳固的势，就放到100点，再不够就150点，再不够就200点。200点还不能确定一个相对稳固的势，退出市场吧，这是5%左右的止损了。你不适合在差价领域混。任何一笔交易，极限容错5%。 本人日K做单，平均2个星期才止损一次，止赢一天几次的都做过。最高的一个周期，2个月无止损。 本间宗久在交易所倒腾大米，是日K级交易哦，最高连续100笔赢利，对于那时全国就一个品种，交易无比活跃的一个品种，难道价格波动不大？？难道本间宗久是设的很小的止损？读书，要读背后隐含的意义。为什么100次日K交易，连续获利，没有止损呢？难道他以小势去做的单？ 也许我说的这段话，让你们听了肝胆剧烈，一颗小心肝跳啊跳，是不是从没听过啊？ 我在跟你们分享成功者的格局与气度。。 总结，顺着K线方向与某一均线方向，寻找相对稳固的势，以相对较大的止损，去赌出你的时空，赌出你的成功！ 一次一次的累积，一次一次的精心计划，一次一次的去承受，一次一次脚踏实地！ 每一次止损都要止得明明白白，止也要止在大势观上，止也要惊天地泣鬼神。 男子汉就要胸怀大势，让一切混沌凌乱的小势为我所用，小势让他们去争吧，只做做单的君王，永远不做小兵！ 付出真男人风度的止损，让所有的概率比率波段时空全部为我所用，全部为我服务。 见下图： ] 当前小周期的2个相对稳固的势： 1：假设3895完成探底成立，本周期最低收盘3955为逢低做多大势依据。离3955还有50-100点时，视五分K中期均线MA60或120站稳//或者价格自底部回升30点左右， （进场以此大势观抄底做多。止损3955）//判断融错区间（1%-2%） 2：假设日KMA40的压制持续有效，价格自日内高点回撤30点左右，放空，背靠MA40放空。//（判断融错区间1%-1.5%) 这两个势，最近一个月可以让你们RB上赚上400-600点。 亏的话，则是50-100点。 如果小势做单，能不亏损，就是无比的幸福，无比奢侈的愿望。。。 做交易的君王，选择修炼无上大道，还是做一个失败的小肚鸡肠的看不开看不透的人，自己去选择。 慢慢思考，慢慢理解。本人无法清晰解释里面的包含的原理，只可意会，难以言传。 其中妙处，自个去体会。 6000块怎么去赌的艺术，我在上面的RB上，已基本说明了。 俺对得起一名交易员的良心。 有缘者自有所获，无缘者难以踏出树立赌的大格局的这一步。 问题：楼主请留步，我再请教几个问题1.是否大资金1成仓位年收益50%的交易员都具备小资金重仓年数倍的能力。2.楼主的言谈使我第一次感觉到一种专业的水平，请问楼主有多大了？ 回答：如果不是基于极高的安全性考虑。200W以下的资金，他们都有一年平均2倍以上的能力。 1/3仓做日K大势，认真点，一年下来都是不得了。 轻仓是为了防备几年一遇，几十年一遇，乃至百年一遇的系统性风险。并不是怕常规行情。常规行情，半仓做日K我都无压力。 利物莫所遭遇的人生悲剧，对真正的职业交易员影响还是很深远的。 1929年危机刚暴发时，道指指数一个月不到跌去50%。商品的惨烈更是无法形容。这还只是危机初期。 1930-1932年，美国股市持续干了6次大暴跌。。。N多的上市公司破产，N多股票沦为仙股，价格接近0. 伟大如利物莫，也兵败如山倒。道指从1929年10月29日385点跌到1932年6月8日41点。想想其中的惨烈吧 利物莫对行情的嗅觉无与伦比，1929年最高价放空，获利1亿美元，等于美国全年税收42亿美元的1/42。 1亿美元按当时购买黄金的数量比值与当前黄金价格对比换算后，相当于目前1800亿RMB的购买力。 这样庞大的财富，在随后三年的极限杀跌中，抄底抄没了。 2008年铜胶不也一个月左右跌了十几个跌停板吗？ 顺着均线做，较大概率不会被系统性风险杀伤。但是5.30股灾不就是反均线方向的系统性风险吗？如果你辛苦了二十年，资金上去了，一个5.30在K线均线完全多头的情况下， 重仓买了股，都跌了4-6个板，那是什么样的心情呢？ 回答完毕 好吧，应要求，再说点投机之道或经营之道的精华。 什么是真正的投机之道？ 这让很多人追寻了一辈子都不得其法。 投机之道的法则，我可以肯定的告诉你们，绝对不是你们中的95%的人所认可的，所想的那样。 散户要改变命运，踏出投机之道的第一步，那需要非常人的智慧，勇气与魄力。 这本身就是对人性的挑战！ 你们中95%的人的思维思想完全被教材，被各种普遍的价值观所改造过了，你们的所接受的金融教育与信息传导决定了你们中的95%注定是失败者。 金融市场引诱你们进入这个市场的核心的价值观是“以小博大”。 这个价值观带给了你们希望，更多的是带给了你们绝望。 彩票市场就是经典的以小博大。买彩票的99%都是穷人。 以小博大，注定就是一种极大概率的失败的价值观。没有人可以挑战这一条价值观。 “以小博大”的确是吸引散户进入市场不停割肉的最为风骚经典的教条。仅此一条，就可以让绝大多数的散户 上刀山下火海在所不辞。 以小博大，我姑且把本岛艾立信定义为一个成功的典型吧，其实，更多的是散户，以小博小。 还是从现实生活中说起。 现实生活中的各行各业，有几个是以小博大的？ 现实生活中的成功者，有几人是以小博大成功的？ 以小博大，你就要牺牲最为宝贵的概率，而概率恰恰是成功者做事最需要关注最需要重视与最需要选择的东西。 追求比率牺牲概率往往是最为不智的选择。 我要说出的投机之道，注定是冲击你们的思想与灵魂的，很多人一定接受不了。 凡事有利有弊，矛与盾动态平衡。当你选择承受最少，付出最少时，可能最终的累积付出无限大都难以成功。 现实生活中，无论是干个体开店，还是开公司，开厂，还是流通领域做差价，不存在以小博大的道理，这是普世的准则。唯一的生存与发展壮大的途径，是不停的以大博小。这跟天下没有免费的午餐一个道理。你想以500元的止损，去谋取1000，1500，2000，2500，3000。。等以上的赢利，你常常这么去做的话，你必须要有破产的觉悟，要有死的决心！！！你投入10W元，去倒个产品，每次很小的确定的差价去赚，长期累积，很大概率会做大。 世上不存在单次投入获得产出1倍或几倍的好事，这种好事只有贩卖毒品，赌场，金融市场才有。 “以小博大”多么美妙，多么动听的词语，但是我要说的是，这种以牺牲最为宝贵的概率为代价的博大，其实是世上最毒的毒药，妖艳而美丽，杀人于无形，还让一批批的后来者奉若投资宝典。。。。。。 “以小博大”的本质决定了：如果你以其指导你的常规性操作，你基本注定了破产的命运！ 我不否定特殊的行情与时空点，以小博大可能成功，但是总想占市场便宜，用其指导常规性操作，。。。。 呵呵。。。 看到散户每次设那点可怜的止损，就觉得悲哀。。。 以小博大成功的概率跟买彩票中大奖，长期去澳门赌场去靠赌发财理论上是完全类同的！ 选择你最确定的势，最有把握的势，最看得分明的势，稳固的大势观，以大博小，或许是很多人走出人生泥沼的出路。 太多的人看对行情，输了钱。 有些事情你无法逃避，你注定要默默的承受，想以小博大走捷径，绝大多数人最终的下场一定是灰飞烟灭。 斯坦利。克罗做日K均线大势，单次开仓可以忍受资金开仓头寸25%-35%的亏损，总资金约8-12%的亏损！亲，我吓着你们了吗？？？ 本人做铜止损4000点，做锌止损1000点，亲，我吓着你们了没？？？ 锌一手1000点是5000块，我4W块做一手，止损一次，亏8%，亲，我吓着你们没？？？ 本人做IF，常规操作大势观，100点止损，40W做一手，亲，我吓着你们没？？？ 很多人爱在哪里显摆技术啊，系统啊，策略啊，等等，等等， 这些都是些什么玩艺？ 技术这东西，很重要，但不是万能的，个人认为，一般就足够了，能够看明白日K的均线系统的势就够了。 你们注定要承受的东西，才是最重要的，不论你们学什么术法，都无法逃避该承受的止损的压力，再好的术法，顶多是相对减轻这种压力。 想逃避，想不劳而获，想少劳而获，想付出最少的压力就成功，老天爷首先把你们成功的概率降低99%！！！注意是降低99%！！！ 你是个注定要50-100点才能看清IF稳固的势的平凡之人，你想提高到10点，更有甚者，提高到2-5点，那就不停的砍吧，砍到你有自知之明，能觉悟为止。 你注定是个要500-1000点才能看清锌的大势的人，你要人为的东施效颦，那就不停的砍吧，砍到你有自知之明，能觉悟为止。。。砍到你死去活来，割到你鲜血流尽为止。。。 。。。。 慢慢理解，慢慢思考，慢慢想，慢慢的想。。。 不是每个人都是“草上飞”，不是每个人都会凌波微步，行走武林江湖，最重要的能力是内功，是抗打能力，是生存能力，内功就是轻仓+做相对稳固的势+相对大的止损。。。 以锌为例，我就是在顺着日KMA60逢高放空，低了我只平仓不做空。这就是我的大势观。 有本事就拉上去，我毫无所谓，本人做好了砍1000点的准备，哪怕把60日均线，轻轻的碰一下，无论是500点，还是700点，还是1000点，我秒砍给你们。 否则，就不停的让我赚钱吧 我拿出1000点的止损，不说气动山河，也算有所气度吧，最高止损1000点换一个相对稳固的势，换一个大数概率。 大势观，稳固的相对稳固的大势观，相对大的止损，才能让交易者有不动如山的持仓素质， 真正体会“钱是坐着等来的”奥妙，不停的掠取一波又一波相对大的止赢。 那点小止损的小肚鸡肠之人，99%都是赚点毛毛雨就撒腿跑的主。 选择了放弃承受较大的止损压力，基本等于放弃了成功的权利。 这世上有千百种操作策略。 但归纳起来，有且只有两种：概率与比率的操作策略 再归纳以下：是老实经营还是博彩。 绝无第三种。 绝大多数人选择了比率。受神话与天才们的影响太大，受金融市场错误的普世价值观的误导太大。 赌场也从不却赚钱效应与极个别的天才赌客的神话。 回复 全心投入 实际上就是我前面提到的止赢策略是如何的，这个很关键。 shells 发表于 2011-11-24 06:44 止赢是比止损更高一级的东西，坦言，我做不好，我主要以小一级的势的反转来止赢或者以行情副度或时间副度来平仓。 也很少有人能赚走市场大部分行情的钱。 当然这些都是定法。没有什么参考价值。 简单说下个人爱好吧，本人特别钟爱从日K周K大势去寻找稳固的势去开仓，止赢我常常以30分K的均线系统的短期或中期均线（比如MA20，30，40，60）的反转来止赢的。 我特别特别的钟爱做好大势观计划后，从30分K的均线系统找进出场的机会。我特别特别钟爱从日K中期均线去判断大的方向。 可惜的是国内的商品期货在30分K的走势上与外盘相比势的连续性太令人失望了。 止损大都以大势观的反转或出现特别明显的日K反转信号。 止损与止赢没有具体的量化的标准的，世上绝对不存在定法。 我一直都认为日K的中期均线具有不可逆性，100亿资金逆势也是死。我在前面已说过:每一根中级均线大势的有效跌破或站上，开启的都是宏大的趋势行情，逆之则死。它们代表的是一种经济大势或商品大势，反应了诸多的宏观的深刻基本面，在一定的时间窗口，几乎没有人可以改变这种大势。只有你们对这种势的理解深入骨髓了，才能有完全的信心去运作大波段。比如，上证指数有效跌破60日均线，请问天下有几人能随便改变这种势呢？？ 有人说我是轻仓死扛。。。？？？我的前提是稳固的大势观+科学的相对大的止损，这个“相对大”不是你们所理解的无限大，稳固的大势观，更不是你们这些倒了1-5年的人所理解的势。 道氏很早就极其正确的指出，长期趋势（PRIMARYTREND）是无法被操纵的。巴林银行的李森，在1995年，以100亿美元逆日K的60日均线，做多日经指数，只3-4个月时间就被市场消灭了。 我对日K的中期均线与30分K的小势的中期均线，有特别的敬畏，一个是判断大势的依据，一个是具体操作的依据。 本人写下这篇文章，不指望也从不屑于与无知自负爱抬杆之人交流，更不屑于与做广告者打听隐私者交流。 一个好的观众就够了。我追求的是平凡宁静的生活，真挚的朋友与以诚相待。我不希望期货人的漂浮，自卑，盲目自负的，丧失理性的情绪反应在这篇贴下。平凡中的宁静是我最大的追求。 《一个期货老人的苦口忠告》这篇文章的精彩摘选 维奥莱塔静静地听，当克罗尔先生开始专注于自己的独白后，维奥莱塔就被对方类似神话般的叙述所吸引，她不再去想其他事情了，来时的烦躁情绪消失无踪了。 “这个世界上只有一种东西是永恒不变的，那就是死亡。” 克罗尔先生说，“任何一个生命都逃脱不了，而那些有魔力的孢子也一样逃脱不了。作为一个观察者一定要清醒地知道那些孢子是另一个世界的生命，是脱离开观察者生命的自由存在。所以观察者只能去认识和发现它，却无法干预和左右这些孢子。也就是说，人永远不能左右那些孢子的活动。当我刚开始步入这个领域的时候，当我最开始作为观察者认识这些孢子的时候，我自信地认为自己能左右大局。但经过与这些孢子四十年的交锋后，我才明白我左右不了它们。我永远只能是个观察者，而不是个控制者。” 克罗尔先生喘了口气，低下头冥想了一阵。然后继续说：“你可能对我这种叙述感觉费解，从而理不出头绪。实际上我的叙述是一种自我意识的表露，很多时候需要你去把握我思想中的火花，那些真知灼见。有些东西我是叙述不准确的，需要你有智慧去破解它。现在我们继续谈孢子吧–” “一个观察者必须了解自己和孢子之间的相互地位，绝不要去试图做控制者，永远把自己当作观察者。在这个过程中有三点原则需要注意：第一，孢子是有生命的，是活的。它是能够躲避，并有能力随着环境的改变和时间的推移而灵动的。也就是说孢子不具有稳定的形态，对孢子过去的认识不能预测将来。当观察者了解到孢子的新形态后，孢子同样也了解到它被观察者所认识，于是变异就发生了。孢子一定会趋向于向观察者未知的方向去变异。它具有足够的智慧防止观察者捕捉到它的灵动规律。所以，孢子的第一个认识就是它的永恒变异性。第二，孢子不可捕捉性。这是什么意思呢？它的意思通俗的讲就是不可掌控性。观察者不能单独把一个孢子从众多孢子中分离出来，当你把一个孢子从#体分离开后，你会发现其他所有的孢子也都消失了。也就是说，孢子的#体和个体是统一的。孢子无所谓单个，也无所谓多个，孢子是一种即存在又虚无的生命。第三，孢子的单纯性。孢子就是孢子，它不代表任何事物，任何事物也不代表它。孢子单纯到只遵循一种规律，除这个规律外任何的表象都是虚假的镜像。也就是说孢子反映的是整个世界的本原。不要用复杂的理论去表述孢子，越精细的表述越背离孢子的本质。” 克罗尔先生不去管维奥莱塔这个虽然天资聪颖，但却知识量并不多的女孩是否能听懂，他继续用几乎魔怪搬的语言讲课。这种场景假如被一个不了解真相的人看到真以为是在做某种宗教传道。 “能告诉我孢子遵循的规律是什么吗？”维奥莱塔轻声问。 克罗尔先生转过脸，定定地看着维奥莱塔。片刻，问：“你知道期货市场有名的汉克·卡费罗、贝托·斯坦、迈克·豪斯吗？” 维奥莱塔摇摇头。 “汉克·卡费罗是美国证券史上最有名的资深分析师，曾创下连续22月盈利不亏损的纪录；贝托·斯坦曾是华尔街创下一单赚取十亿美金的人；而迈克·豪斯则七年雄居华尔街富豪榜第一。” “哦！” 维奥莱塔点点头。 “但你知道他的结局吗？” 维奥莱塔又摇摇头。 “汉克·卡费罗死时身上只有五美元，贝托·斯坦被几百名愤怒的客户控告诈骗而入狱十年，出来时一文不名，而迈克·豪斯更惨，他在四十五岁就破产多次了。” “为什么会这样？” “原因很简单，他们都有一个共同的特点，就是操作成功的概率总是远远高于众人。但奇怪的是他们九十九次成功积累的金钱却没能经受住一次失败打击造成的损失。” “为什么会这样？” “你要问为什么？道理很简单，因为他们试图去控制孢子。他们都认为自己找到一条一劳永逸的预测孢子变异的方案。有时间的话你可以去看看汉克·卡费罗曾经写过的一本有关期货理论的书籍，叫《期货市场黄金技术分析》，书很有名，至今都是期货界人士的必读书。到现在为止很多期货精英依然推崇那种最终只能是失败而绝不会成功的东西。” “你的意思是说，他们这些人的失败是源于他们的理论，是这样吗？” “对！当他们把经验上升到理论的时候，失败就注定了。我曾说过，孢子是一种智能生命，它具有向观察者未知的方向变异的趋势，而且它总是向观察者未知的方向变异。当它意识到观察者看透了它的真相后，它一定会发生变异，从而让观察者总结的理论失败。” “你的意思是说，如果观察者不把经验上升到理论，那么孢子就不会发生变异，对吗？” “你说的对！当观察者不试图用规律去解释孢子的时候，那么孢子同样也无法预知自己被观察者认识。也就是说，道在不长高的同时，魔也不会长高；但是道如何试图要超过魔的时候，魔必然要长高。” 上个片段中，那位40年人生经验的期货人，用“孢子”这个词来类比期货市场的行情。 一个纵横期市40年的老人，其理解力与所经历的交易的沧桑，难道没有几个三五年经验的小P孩深刻？ 孢子的生生灭灭分裂组合又是多么的不可揣测。。。 当一个定法（指标）上升到交易系统与程序交易，基本也是毁灭的开始。孢子与行情一样，处在未知的无穷变化之中。 均线系统其实是最为高深的指标之一，它的最大价值不是固定死板的运用其某一均线，而是在变化在运用。均线本身就是一个无穷变化的孢子。我从不敢用某一固定均线去做单，无论任何周期。我做不来也看不懂太小的势，我给自己留足够的时间去思考分析评判做计划。 勤做功课，认真分析与做计划，是在某一特定时间窗口接近与顺应市场的趋势的捷径。 世尊说法，无法可得。一切有为法，皆是梦幻泡影。金融市场的一切有为法，同样是梦幻泡影。 所有的法，仅仅是某一个行情，某一个时间段，某一个品种，可能不错的参照物。当你迷信愚痴的认为，找到了定法，那不过是你的一厢情愿。本人从不认为有比均线更好的指标，均线都不该迷信，何况其它？均线都要认真分析，具体问题具体分析，勤作功课，相对的更顺应市场，难道有定法可以解决这不可揣测的行情？ 你们所有的开仓的，止损的，止赢的疑问，问我没有丝毫用处，你们应该问自己，问自己每天做的功课够不够。 每天不做交易的功课，迷信高手，相信定法的人，不过是最无知最懒惰最游手好闲的一类人。 想以定法来一劳永逸，。。。。。。哈哈 所有的开仓平仓所有的止损止赢都是你心目中的法（参照物）的多空转变的一个过程。 我来定义下我心目中的法吧： 它漂浮不定无法预测，在某一个时间窗口，寻找一个相对稳固（过往大数概率统计）的势，而我又能承受这个势的多空反转带来的止损。那么我会选择这个法（大势观）作为我当时的参照。我谋取这个大势观下行情运作的时间与空间作为我的回报。 所以，迷信高手的止损止赢，没有任何意义。可以参照借鉴学习，但不要复制。 如果想从别人的成功或失败或收益率大小或定法中找到安慰与信心，终极一生，都不是你寻求的答案。 每一个大型期货公司，券商的信息监控人员，他们见过的高手少吗？但是他们中有几人能成为成功的交易者呢？大中小资金的高手成功案例，他们了解得少？ 我在跟你们或者说我的影子表述一些交易“另类”的东西，慢慢理解。当你在市场的交易之路有了五年，十年，十五年时，分别拿出这篇文章看下，或许有新的发现。 你说的股市与期市，难道不是一个市场，本质上就是一个市场。 就像我们同样学习艾立信的贴，说句实话，他（她）是男人还是女人，美与丑，交易的开仓依据，止损与技术，甚至于记录的真假等等，我没有一丝一毫的兴趣。 我唯一能学到的是什么？想知道吗？那我告诉你吧 我唯一知道与学到的重要东西是：在日内交易上，投机岛也有一名能够很好的理解或执行控制自己交易情绪与交易心境的交易者。 她的格局也仅仅是停留在日内交易上。 交易情绪与交易心境，是大成交易员或准大成交易员才具有的一种素质，是对交易技术，市场的本质，人性这三项最重要的交易元素领悟到炉火纯青后才有的功力。 强大如利物莫，都不是大成交易员，绝对的不是！请你明白。 强大如巴菲特，都不是大成交易员，绝对的不是！请你明白。 斯坦利.克罗则是大成的交易员之一! 如果发生一波究极的变态行情，2008年巴菲特很可能已挂了，但是他胆小谨慎的性格，也可能让他避过究极的风险。 难道利物莫对市场本质对人性的理解，没有巴菲特深刻？他只是生不逢时。与其说生不逢时，不如说他对交易技术的理解，对浩荡大势的理解还太肤浅。 道氏理论的巨大贡献，在于他很早指出了中长期大势的不可逆性！ 巴林银行的李森100亿美元怎么输掉的？他胆大包天的天真的以为以小仓买进不停补仓，只要钱够多，就可以抵抗股指的中级大势！ 打开图表吧，2005年的2月，中国，美国，韩国，日本，德，法，英等主要国的股票大盘指数都处在日K中级均线压制的绝对空头大势之中。 不要说100亿美元，1000亿美元也只能影响，却无法改变股票指数的中级大势，这需要宏观基本面的配合。 就像现在，谁能用1000亿把上证指数拉上120日均线吗？这显然是不可能完成的任务。 就像现在，如果没有深刻宏大的基本面配合，光是凭借资金，中国有谁能把铜锌拉上日K60，120日均线呢？更不要说商品指数了。 5亿，够吗？50亿，够吗？我告诉你，500亿都远远不够！国际联动品种中的大宗商品，跟股指的中级大势一样，具有不可逆性。 国内的恶心庄家可以操控PTA之类垃圾品种几天的走势，但也无法操控其中级走势，国际联动的有色，他们把自己卖了，都没有操控一天的能力！ 我说这么多，是让你理解中级大势的浩荡与不可逆。对中级均线的大势理解深了，赚钱，很可能就是开张吃三年。 钱多如利物莫，以及他当时的无与伦比的影响力与号召力，都无法对抗股指的中级均线大势！ 隔了这么久，我再回来这贴，还是没有看到我所真正认可的有价值的回贴，很让人遗憾。 金融市场的瞬息万变不过是人性瞬息万变的一个汇聚。选择这个市场，本质是选择直视错踪复杂的人性。 这个论坛让我的失望在于人性的“贱格”在淋漓尽致的发挥，哪怕是爆仓亏到走投无路，都要习惯性的损人，损网友，以某些人的这种做人的品性，觉得有一丝一毫成功的可能性吗？请对号入座，不点名。就算让你们这种德性的人撞运偶尔成功一时，于人于社会又有何益？除了显摆与轻视蔑视他人还会有什么？走火入魔式的自大狂每天都无处不在，也请对号入座。也许这段话让你们不舒服，但是这是事实。 本金少的，要么忍受一个较长时间的投资周期，要么一边上班一边做日周K大势，这还有别的路吗？ 基于Android 手机的应用软件在文华财经上，目前不是广泛运用了吗？随时都可以看行情与下单。面子又值几分钱，珠三角制造业基地，只需要初中文化，2000/月以上包吃住，有社保，遍地都在招人，只要有手脚，就不怕饿死。好一点的制造加工工厂3500-4500元/月，如富士康之类。省吃俭用，存个2-5年钱，如果你有足够的本事，还不可以从头再来。我说的都是只要肯吃苦的初中生学历的打工待遇。 2003年下半年在股市的寒冬里，我亲眼见了两位当时的两大券商王牌市场总监，离职下海谋生。一位在海南练摊，一位在东莞厚街开了个很小的作坊式的小店，做模塑，后来还做大了，开了个小厂。股市转好后，又重操旧业，目前各自年薪100-150W区间。2003年的证券行业的薪水，我相信知情人都了解。如果要养家糊口，不改行，就是喝西北风的下场。不是他们不爱这个市场，他们选择了默默承受，没有怨天尤人。你们能想像一名重点大学的硕士生，为了生存，风雨无阻，当个走鬼求生存的勇气与决心吗？这是我03年亲眼所见的人。至今，我对他的敬仰尤存。一个优秀的人，不在于他成功时，做了什么，更在于他在人生的逆境时，有“安忍如大地”的耐性，有一如既往的尊重别人与市场的品性，有面对生活的勇气。 本人最看不惯那种轻视他人随意贬低他人的嘴贱之人，当行为上升为习惯，以佛家的观点，你已败光了你现在与未来的气运。 有朋友说，我没有回答，如何止赢这个问题。其实我已经回答了，只是你们不用心去读。止赢不是由我由你由他来决定，而是由市场来决定。除了以“时间平仓”或较大的赢利来平仓，没有更好的办法。世上不存在完美的止赢的方法，所谓的很多的完美的止赢的定法都是马后炮。只有你选择的大势观与止损，是可以由你自己来决定。 什么叫以时间平仓？比如你今天只想做日内，对你有利的单，就是拿到收盘前平掉，艾力信已给你们做了很好的示范。 比如你只想做一个周K，那就周五收盘前平掉。月K同理。这是一种追随市场本身的自然的赢利方式。 均线系统做单同理。比如以20日均线多空，拿到20日均线反转离场。 什么叫较大的赢利？我的个人观点，大于做单周期的平均波副的赢利，就可以开始止赢了。这个需要较长的统计数据的支持。 要做好止赢不容易的，是个复杂的系统工程，很多时侯更需要具体问题具体分析。 当你历经人生的沧桑后，或许能认同我的观点。生活的幸福多么难得，面对复杂的人性，一定要慎之又慎做出正确的选择。 无论你所求的是随遇而安的小康之家的幸福，还是纵横国内国际金融市场的抱负，乃至寻求恒久价值传承的投资帝国，我能给各位的忠告是：不要妄图走捷经，静下心来，安下心来，脚踏实地是唯一的路！这条忠告对99.99%的人一生绝对有效。 当你无法面对人性作出选择时，用这两种情景做个对比吧 第一种：财务自由人身自由，有正常的朋友圈，有知心的爱人，有幸福的家庭。。。可以享受暖洋洋的太阳照在心坎的感觉，可以有足够的财力帮助亲友，走到哪里，都有人尊敬你。。 第二种：负债累累，没有朋友，每天都是寒冬，全是对亲人的亏欠，人不像人，鬼不像鬼。。。整个一社会的垃圾。。 当你走投无路时，恭请你把我这篇文章，反复看几遍，或许你会找到你失败的答案。负债时，放下面子，鼓起勇气，去立即找个工作，自食其力是唯一的正途。一句话，大丈夫能伸能屈。 顺便提一句，N年前忽游我，欺骗我的日内炒单公司，不是一两个，是一批，6年后，当我再去统计追溯其下落，全部灰飞烟灭，什么玩艺嘛。 6年前在我面前摆谱整天快进快出倒腾折腾的那些“高手”，现在无车无房，面如灰色，见了熟人，还是整天去拉单，做一个死一个，每年每月每日生活在生存线上. 上海期货大厦里，这种快金快出的炮灰，每年不知道灭掉多少批。 感慨上天的公道，既所不欲，勿使于人。这些骗子与骗子公司终究受到了生活的惩罚。 好自为之，好自为之，各自珍重，各自珍重。 很多人对超短线交易是一知半解就去选择这种交易，这种超短线的交易在华尔街最近几十年，一直以来都是被称为“魔鬼交易”。 《华尔街操盘手阅读新经典•短线交易五大绝技》作者：杰克·伯恩斯坦 (Jake Bernstein)，这是对华尔街影响比较大的一本短线交易的经典之作。杰克•伯恩斯坦是MBH期货顾问公司总裁及《MBH期货周讯》（MBH Weekly Commodity Letter）发行人。作者所说的短期也是指2到10天的时间范围，明白吗？全书中，他都是基于这个时间周期乃至更高的时间周期在书中给读者做的技术分析。 《短线交易秘诀》美-拉瑞·威廉姆斯著，著名的威廉指标的创始人，短线交易之父。作者是位长期呆在市场一线交易达几十年之久的资深交易员。当今美国著名的期货交易员、作家、专栏编辑和资产管理经纪。他是罗宾斯杯期货交易冠军赛的总冠军。在不到十二个月的时间里使1万美金变成了110万美金。他就职于美国国家期货协会理事会，并曾在蒙大拿州两次竞选国会议员。在过去的25年里，他是始终被公众追随的优秀投资顾问之一，曾多次被《巴伦斯》杂志、《华尔街日报》、《福布斯》杂志和《财富》杂志专访过。 下面我简单让大家从他本人接受和讯网的采访对短线交易时间的定义，希望有助于帮助一些人反思浮躁的交易心态。 和讯网：您是罗宾斯世界杯锦标赛不可逾越的冠军得主，一年内将1万美元增值到113万美元，这一记录至今无人打破。这一事迹常常被人传颂广为称道，您能描述一下当时的场景吗？ 拉瑞：我当时全神贯注，交易很活跃，风格很激进，因为是个争夺冠军的比赛，那不是寻常的交易。因为那是个比赛，所以得拼搏去获胜，操作非常激进。 和讯网：你平日也是这样交易的吗？ 拉瑞：在我每天的交易中，不是日内交易，已经不是那么激进，我年纪大了（做不了日内了） 和讯网：不，你看上去很年轻啊 拉瑞：那你需要戴眼睛喽 和讯网：之后您本人刷新过这一纪录吗？ 拉瑞：我从没想过要尝试去打破他，对我来说，这件事已经静静地离我远去，那就像是一件艺术品，是件很美的艺术品，为何去碰它呢?我想不会有人再打破它，就只是远观，我把它当作一个里程碑来纪念。 和讯网：您目前的年收益率是多少？ 拉瑞：很难说，取决于市场给了你多少赚钱机会，有些年钱很难赚，有些则不同。今年的收益率超过100%，大概120%，赚了蛮多，应该会更多。去年的收益率大概是40-50%。我正在努力，创造更高财富。 和讯网：不愧是大师啊 拉瑞：不不，我仍然还有很多要学习的地方。 和讯网：您如何看待中国投资者，是否会产生大师？ 拉瑞：当然，中国有很多很棒的交易员，我见过很多中国交易员，他们在交易方面很成功。中国人口众多，在赌博有很多投机，这个市场很适合他们的. 和讯网：您目前的操作风格是什么样的？ 拉瑞：我称自己是个短线交易者，因为我的交易周期一般是12天。这与日内交易相比还是比较长期的交易。我不做日内交易，日内交易赚不了大钱。当然很多人可以从日内交易赚钱，但我并不喜欢。 和讯网：与中国的很多短线投资者相比，也许12天也算比较长期的投资了. 拉瑞：是的，但只要长期投资才能赚大钱。对我来说，将交易不是为了娱乐或刺激，而是希望从中赚取超额的利润，我的目标是在12天内赚取5-10万美金。那就是我作为一个交易员想做的事情，赚一笔大钱，而不是娱乐。 请注意：拉瑞说他的交易周期是12天。再请注意：拉瑞最近两年的收益是40%-120%之间。 可以好好看他的书，他是一个真诚的值得尊敬的人。 下面看下他几十年智慧结晶，对短线交易的经典总结吧： 《短线交易秘诀》精华摘要： 第三章 短线交易的真正秘诀 短线交易真正的秘诀是，你交易的时段越短，赚的钱越少。这令人失望，却是事实。回想一下你曾经参与过的任何投资。你曾经在一天内就大有收获吗？假如你有过那么好的运气，又能重复几次呢？不会太多吧。因为获利的普遍规则和投机的普遍规则没有两样： 获利需要时间积累。 成功的交易员知道5分钟的变化要比一分钟大、60分钟又比5分钟更大，一天或一周的变动幅度则又更大了。失败的交易员想要在很短的时段内完成买卖，自然使获利的潜力大受限制。 依照以上的定义，它们限制获利的潜力，导致了不断亏损。难怪有那么多人在短线交易这一行里表现差劲。尤其是在经纪商或交易系统推销员的鼓吹之下，它们会被当日高卖低买发大财的假象所蒙蔽，结果却陷自己于亏损的困境。这些鼓吹的说法包含那些看似合理的言论，譬如：要当日冲销，不持股过夜，你就不会受报纸消息或重大变化的冲击，这样才能控制你的风险等等。 这是大错特错的，理由有两点： 第一，风险是由你自己控制的。在这行里我们唯一能控制的是设立止损点，也就是我们推出交易，或推出所有交易的水准。是的，隔天早上市场可能在你的止损点以上出现跳空缺口，但这是很罕见的。而即使在这种情况下，我们也必须坚持运用止损点，将损失控制在一定的范围内。输家往往会一错再错，赢家就不会这样。 当你建立一个设有止损点的仓位之后，可能损失的钱就只有那么多。不管你是何时或如何进入市场的，止损点会使你所承受的风险控制在一定程度之内。不管是在市场创新高或新低时买进，风险都是一样大。 不持股过夜的做法，会让你投资获利所需要的成长时间受到限制，尤其当市场一开始就和你唱反调时。如果我们的方向正确，那就需要更多时间等待市场和我们站在同一个方向上。 更重要的是，在每日收盘时结束交易出场，或者更糟糕的是，根据5分钟或10分钟线图，在每根线的时段结束时完成一笔交易出场，那么获利潜力将大受限制。还记得我曾经说过输家和赢家的差别就是输家不肯在损失时认赔杀出吗？另一个差别是赢家会坚持抱紧获利的仓位，而输家却“太早”出场。输家似乎都无法在一个获利的交易仓位中熬得很久，它们往往赢了一笔交易就乐得要死，因而过早获利了结（往往是当天刚进场，不久就脱手了）。 你要学会紧抱获利的仓位，才赚得了大钱，而且你持有越久，获利的潜力就越大。成功的农夫绝不会在播种之后，每隔几分钟就把它们挖出来看看长得怎么样，它们会让谷物发芽，让它成长，交易员可以从大自然的生长过程中学到很多教训。交易员的成功也是一样，投资获利是需要时间的。 一切都和时间有关。 我刚刚告诉你的是投资的绝对真理。不论市场如何波动，获利是需要时间的。因此，就定义上来说，短线交易员获利机会是有限的。 当日冲销者所犯的错误就是自以为能够掌握市场的短期振荡，自以为能够确认大多数时间里价格的波动方式，而且能够预测高低点，以及市场将在何时形成头部或底部。对不起，我的朋友，我要告诉你这种情况不可能经常出现，这只是当日冲销者的梦想，不切实际的梦想。但不要放弃希望，我以多年的市场分析及交易经验发现了一项有关市场结构的真理，它可以让“短线”交易变得有利可图。 现在，你了解到（1）短期振荡是很难预测的；（2）我们要控制损失的幅度；（3）身为短线交易员，只有在价格巨幅波动而且方向对我们有利的时候，才可能有好的表现；（4）时间是我们的朋友，因为我们需要时间去创造利润。 基于赢利需要时间的原理，那么选择中长期均线作为操作的K线周期的均线参数，可能是最好的途径。 短期均线，特别体现在太小的K线周期上（比如分K周期），信号过多，过于凌乱，基本没有利用价值，所以我一直强调以相对稳固的大势观来做单，现像是回避短期信号的混沌凌乱与频繁止损，本质上是回避过于激烈的短线的人性的角逐。 过高的仓位，那怕你是神一样的技术水准，都无法做到在激烈的人性角逐中保持从容镇定，必定为人性的角逐所伤害。贪婪所带来的必定是恐惧与持续的伤害与失败。 仓位直接体现是否有成为一名成功者的素质。 中长期均线的技术意义，如果你不能对其理解达到深入骨髓的程度，特别是30分K，60分K，120分K，日K这些相对较大的K线周期的中长期均线，需要静下心来反复深入理解。如果要发动较大的单边波段行情，不可能越过这些必经之路，必定要在它们的长时间的支撑或压制下进行。 对于均线的操作，我作三点说明，仅供谨慎参考： 1：只有在顺应更高一级K线周期的均线大势观的轻仓持仓中，你才有可能利用更低一级的均线系统为你带来更多的赢利与更少的止损次数，（请注意是止损次数非止损副度），这种利用是对看长做短的利用。即你也许可以顺大势逆小势，要具体分析。 2：能够为你常常带来巨大利润的交易，往往是选择与中长期均线做朋友，陪伴它们一路发展。无论你是选择操作1分K，5分K，10分K，15分K，还是30，60，120分K，还是日K周K月K。这是无法逃避的交易哲学。每一次交易，都要有陪伴中长期均线发展的破釜沉舟的勇气与背水一战的决心。 不要随机交易 我所说的技术都是很肤浅又通俗易懂的，论坛比我技术好的高手实在太多太多。 我能给各位提醒的是两点，技术很一般就OK了，关键是勤奋的做准备工作更重要，不要随机交易。更重要的是你必须清醒的认识自己的人性。认识自己的人性的懦弱（体现在不敢给出大势观做单的较大的单笔止损，体现在不敢顺应大势观持仓较长时间），认识自己人性的贪婪（过重的仓位），认识自己人性的恐惧（贪婪带来的恐惧，炒单带来的恐惧，复杂多变的小势观微观势带来的频繁的恐惧），认识自己人性的自卑自大（失败带来自卑，盲目幻想带来自大）。 认识纯粹的短线的势的不可利用性，认识超级短线的势的混沌凌乱与复杂多变，认识到没有定法可依，一个正常的人，至少需要6年的一线市场操作磨练，非职业的可能需要10-40年的时间。本质是对人性的的一个认识过程。从肯定到否定，否定到肯定，再到肯定到否定，反反复复，会有个漫长的过程。 投资很复杂也很简单，有了基本的简单的技术，如果你能战胜你的人性的弱点与重重的心魔，那就留在这个市场吧。否则，越早离开越好。现在操作个几万块的小资金，整日幻想成为多少多少亿，XX首富的，XX万倍的，那显然是入魔深重，不可救药了。忠言逆耳。 我的观点，无论你是兼职还是全职，无论你有着多么伟大的抱负，多么高尚的情操，还是先从追求最基本的随遇而安的幸福开始吧，做一个幸福的平凡的人开始吧。反思自己的交易行为，反思自己的人性，慎重的选择自己的交易方式与策略。 希望我的贴子，能引起你们的深度思考。破灭那些吹手制造的一群狗屁般的伪神的误导，还神圣的交易一片净土。 累了，到此为止。 好好的看我的贴，不要急于抬杆，特别是亏损的朋友及新人，或许会给你们启发。 在交易的世界里，从来不存在神。从来没有过。从古至今都没有过。神仙也是凡人做。 不要盲目崇拜，你盲目崇拜，不过代表你的心极其浮躁，你的人极度愚蠢加极度无知加极度好骗。 交易是最需要理性思考的行业。 13年的一线市场操盘，大中小资金我都做过，见过了太多沧桑，从没有离开过市场一天。我的心其实早就苍老了。。 在交易的世界了，任何人都是绝对的客观的公正的站在同一起跑线上，无论你多少资金，无论你多大名气，无论你多么卑微。大家面对的是同样的图形，同样的基本面，同样的人性。张狂，轻敌，盲目，贪婪，恐惧，沾上任何一项，无论你多大的名气与金钱都是毁灭。 2006年朋友介绍认识了一位传奇性的交易者，暂定义为A君吧，朋友说是5000-6000元吧，用了7-8年的时间做到5000W以上。2007年初，再通过朋友了解，该君已资产上亿了。后来此君被猎头引见，2008年下半年做了国内一家阳光私募的基金经理（知道什么叫阳光私募吧，不要错把野鸡私募也当阳光私募），山东信托旗下，点下名吧，知情人自然会了解。但是该基金自他2008年8-9月掌陀以来，苦苦挣扎到2010年底，也是正常止损清盘的命运。国内目前合法的完全公开透明的阳光私募是695家，每一个阳光私募的基金经理，在过往5-10年基本上都有公开透明的可查的辉煌成就，这个成就足以让这个论坛99%的人仰望！但是今年还不是平均亏损20%以上。什么赵笑云，赵丹阳等等都是被逼止损清仓的浮云。市场从来不认过往成就与名气。 2011年一年，阳光私募被逼止损清盘的近200家。在伟大的市场面前，无论你过往多么优秀，只要你停止前进的脚步，停止努力认真的脚步，都是淘汰的命运。 期货的野鸡私募全国能够稳定五年以上赢利的，全国只有一家。别无第2家。年赢利80%。从未被超越。北京的。 期货上总是出笑料的，比如张文军之流，王向阳之辈，仅仅是一个笑料而已，当然很多愚蠢的人要当成神来拜。这种笑料从来经不起时间的考验与洗礼，浮华一时。交易的客观，市场的公正与客观，从来不会因为一批批的伪神有一丝一毫的改变。套用一句俗话，装逼的从来装不长久!更经不起透明公开的检验。装逼的伪神，在不停的显摆他们的定法，显摆他们莫须有的成绩或一个时间段的成绩，市场的回答只有一个词：小样！ 就像你们所喜欢的艾力信MM一样，说句很客观的话，那点微末可怜的成就，加上所经得起考验的可怜的投资周期，与目前全国排名前300位的任何一位阳光私募基金经理的过往成就相对比一下，无论是赢利副度，管理资金，资历，学历，投资的考察周期，都是云泥之别。任何一位管理10亿以上的阳光私募的基金经理，谁曾没有伟大的个人成就？谁没有过独特的适合中小资金的术法？但是重新以另一个更显赫的身份去面对市场的时侯，需要的是一如既往的以谦虚低调的姿态，戒骄戒躁的心去认识与面对市场，需要至始至终的认真与努力。很多人过往很辉煌，一放松自己，就被市场淘汰了。 金融市场从没有定法，长时间有效的适合大多数品种的定法。如果有，它是一个复杂的系统工程，要融合智力与经验的元素。 金融市场唯一的道就是战胜你的贪婪与恐惧，每天都要认认真真的分析总结，努力的做好交易前的全面分析与计划。想以定法去一劳永逸，想以懒惰战胜市场，我只能说你们想得太天真了。比白日做梦还天真。 金融市场跟任何行业是一样的，只有脚踏实地才能长久成功，跟任何行业一样，认真加努力是胜出的最佳捷径。 我的出现，是为了让有缘人真正的理性的思考。 思考自己，思考交易，思考市场。 做交易的经常停下来思考是一种美德。 有人说，我会扰乱这个市场。我说过，我的心，早就苍老了。我见过了太多的沉浮与人事。只是你们读不懂另外的意思。 金融市场跟任何行业一样，是靠认真与努力取胜，别无他法。市场是千变万化的，任何定法都可以赚钱，也可以亏钱。何来扰乱？我让你们思考，是让有缘人拨开一些迷雾与干扰。认识你们一直以来所接受的错误的引导。认识一些可耻的装逼的伪神的误导！你们伟大，能伟大得过克罗？提鞋都不配吧。50W倍的成就摆在哪里，24年的考察周期，500年内都难以被超越。但是他一如既往的坦城透明面对观众。他在交易的19年，每天都认真做分析，每一笔交易都有明确的记录与详尽分析。如果说有神话，神话存在于脚塔实地的认真努力工作，并长期坚持不懈。 同样的起点，同样的人性，同样的图形，同样的市场，如果你不比大多数人更认真与努力，自然难逃输钱的命运。交易有另外的法则？ 回答你们的问题。 有朋友说，怎么处理趋势的反复震荡。 其实问这一句话，我就知道你暂时还在交易之门的外面，你还在对抗人性，在参与人性的激烈角逐。 我用一副图来回答你们吧。 在上图中A点，1月6号是一根多头K线，小阳线。你要赌它的多头趋势，你第二天就是开盘或开盘后寻找机会逢低做多，如果仅仅赌一根K线，那么第二天就开仓做多，不打止损持有到收盘或大副赢利离场。止损就是前面一根K线的最低价或固定止损30点-40左右。1天最多只做这一次交易！！！切记！！！止损就关电脑走人。 B,c,D同理。 记住这一点，精心分析日K的形态与均线系统。寻找出你喜欢的，能够承受的日K或周K或30分K或60分K的大势观，给出一个合理的止损，一单定输赢。 如果你过度交易，过多的纠缠，一定是惨败！ 过度交易，一定会随机交易，一定会非理性交易，一定会错失大波动，一定会频繁止损！ 相信我，还是伪神，自己慢慢思考，理性思考。反复实战检验。 一天最多只交易一单，这种手法，会让你们慢慢的转到交易的正道上来，最终转到浩荡的日K大势观的交易王道上来。 K线周期越低，信号越多，凌乱就越多，毛刺就越多，你交易越多，就失败的概率越大。 读懂我的话，需要智慧。99%的过度交易者都是亏钱的，不要跟庞大的历经50年的金融市场的统计数据对着干。 无论那些伪神与可耻的家伙怎么装逼，怎么误导，怎么煽情，金融市场过度交易的失败率都是99%以上！绝不可能改变这个客观到如寒冰般让人寒冷的大数概率！请深度认识这一点。 一天一单，赌日K方向，合理的止损，你靠什么赢钱？一个较长周期的大数概率的集合。 合理的止损是你的承受力，你注定无发逃避的宿命，你想小止损逃避就是不停的失败失败。。。。再失败。 真英雄要赢得起，输得起。打了止损就是输了，关电脑走人，绝不恋战。赢了要赢一根K线或大副赢利走人。 打了止损，恋战不走人的叫赌徒！你看错了，就要认命输得起。想明白想清楚。 没打止损，就要敢持仓，别跟个SB样，赚点毛毛雨就跑。想明白想清楚吧。 我给的忠告与建议已说了，失败者特别是长期失败者最好是用一天绝对只做1单的方法来逼迫自己转型，1次交易只做一个品种！不要提震荡，毛刺之类的话，成功者的字典里没有这个词，绝对的无视震荡与毛刺。做好一天一单，完成资本积累，再转型更稳健与安全的轻仓大势观的王道。 累了，休息。 特别的点评下雷凯，因为这是众多个人无资金的朋友喜欢的一个比赛。 雷凯在20W的模拟比赛周期，还鼓励多做单，严重过度交易，还限定10个整数点的自动止损。 历经了3-4年后，这个无知且无比愚蠢的公司，才认识到它在挑战伟大的交易法则！！ 3-4年宝贵的时光，无数期货人的宝贵青春，被白白浪费。全国没有人才吗？显然不是这样。但是为什么长达几年的时光，总计上百万人次参赛，为什么没有1个人才被选出？？？为什么连稳定3个月的人才都没发现一个？？过度交易者，请停下来，静下来认真反复的思考这个问题吧。很多人还乐此不疲，我只能说你们太无知太天真了。反思吧。深思吧。不是你执行力不够，不是你不够聪明，而是你们试图挑战交易法则，玩弄交易法则，你们中的100%长期去做，注定自己被愚弄被玩弄。 所幸的是，历经3-4年的市场教育之后，雷凯终于认识它错在哪里，自欺欺人害己害人的无聊游戏终于结束了。新规之下，我相信会选出一批真正的精英人才。目前的雷凯是有参与价值的了。以前不过是SB愚弄SB，自欺欺人害人害己。 本人曾参与过一项大型的调查统计，对全国8家大型期货公司的广泛客户进行稳定三年以上的赢利客户进行调查统计，我很负责任的告诉你们，这样的客户在如此大范围的面积的调查背景下，符合条件的全国仅有13人，够悲壮吗？够残酷吗？你们所看到的一些显摆的伪神，在透明公正的第三方监督下，再检验一个较长的时间周期，他们中的95%连一个屁都不是！反思吧 给雷凯的朋友作个参考。如果你想拿实盘，归根结底，还是要战胜你浮躁贪婪的人性，欲速则不达这条利剑一直横在你们头上，想重仓满仓，想赚快钱，等待你们的一定是失败。没有思想又不思考的人，是最容易被别人欺骗愚弄的人。 50万资金做1手股指，1天就交易一次。只有赚够3-5W后，你才可以开2手股指。5W块只能抗1手股指的日K的正常波动。动不动开满仓3手的，N个月，N年后，你们都难以实盘。因为只能允许你们回撤10%。因为开3手，50多点的股指反向波动就被淘汰了。5W资金可以抗170点左右的止损，10W可以抗2手170点。170点可以赌3-5次日K的大数概率方向了。 一直满仓的，资金回撤10%那是家常便饭。好好思量吧。 只有战胜自己浮躁贪婪的劣根性，有了自己的思想时，不被一帮无耻无知的伪神愚弄时，你才能闲庭信步的交易，勤奋，认真，赚属于自己的钱。 最后再上1副图，上完这副图，永久性的关此贴了。交易已无任何秘密。 有缘者自会珍重。 在这副图里。我用300的30分K作个概率说明，什么叫大数概率。 对于稳定性较高的指数，在此图里，我用30分K做个说明，日K同理。 在此图100根30分KK线里，请问究竟有多少根K线是完全跟前一根K线趋势反向的呢？？概率多大？ 30分K的均线系统的多空转换里，是不是揭示了更为清晰的波段趋势？ 这是你们选择大数概率的底气所在。 请作好这个我留给有缘人的功课。日K同理。 交易已无秘密。就此离去。能看到此贴的人是缘份。 若干年后，诸君功成名就时，希望记得专一投机这个名字。 与有缘人结个善缘，永久关贴。 本来什么也不想说了，但太多的朋友加我好友询问，盛情难却，我无力一一回答。本来什么都说了，只是你们不理解，我再说具体点，也不过是对原来的内容的重复。就具体的操作，我再重复下。一家之言，仅供参考。 利物莫的终极感悟就是一句话：钱是坐着等来的。我把它对应的转换为操作术语：坚定的以中长期均线为依据来做单。这句话就是金融市场至高无上至尊无极的容纳一切优秀战术的究极的兵法，除此以来，其它大都是糟粕与忽游。理解这句话，需要非凡的智慧与海量的实战，99%的失败者，终其一生，都无法理解这句话。无论你做任何K线周期，跟中长期均线对抗都是死路。我可以肯定，这个论坛99%的人一样无法理解这句话。你们所有的恐惧与浮躁，都在与不理解这句话。失败与成功都是源于对这句话的理解与不理解。“钱是坐着等来的”这一句话，就是金融交易学的基石，一句话奠定一切金融交易学，一句话概括包容一切金融赚钱术法。“钱是坐着等来的”这句金科玉语，注定陪伴所有成功交易者的一生。对交易迷茫的人，都在于不理解这句话。 交易就是守侯，守侯你选择的中长期均线。 交易就是坚持，不以一时失利而灰心，始终如一的坚持你所选择的原则。 交易就是鳄鱼捕食，静静的等待，静静的守侯，获取属于你该得的利润。 三心二意者，在别的行业有可能成功，在残酷的金融市场，那太难，哪怕你才高九斗。 K线学的普及只会加速K线学本身这个狍子的变异，可以预见，今后，主力品种上，15分K至日K级别的K态概率会较快的变异，K线骗线大大增加，特别是最主流的日K线。市场是有自己的智慧的。终究大多数人要输钱。可以预见，今后越来越成熟的市场，将是小K线大均线的天下，K线学本身将被变异的市场无情践踏。均线作为第一趋势指标，在金融市场永远拥有至尊无极的地位！无论你多么强大的资金，你可以改变K线概率，玩弄K线概率，乃至玩弄小均线，但是中长期均线的地位再强大的主力都无法挑战，有意也好无意也罢，都必须无条件的接受其制约。 无论你做任何K线周期，只有陪伴中长期均线发展，你才能获得最高的安全，最高的赢利，这是任何人都无法挑战的数学哲理。对于这句话，我不想再解释。只要人性的贪婪与恐惧尤在，这句话就绝对不会过时。止损只是源于你所选择的K线周期的不同，而有所差别。 忠于绝对的忠于你所选择的中长期均线，就是具体操作的至高无上至尊无极的究极华丽的战术，用一个漫长的周期来看，这个战术注定无法被超越。它就是交易大道的化身。只有大成功的偏执狂才能理解这段话。静静的守侯你的均线，守住行情发动的这个必经之路。交易就是理解行情的必经之路，守侯行情的必经之路。 在我的止损观里，我表达的是，如果你输不起，你绝对的赢不到。在我的操作观里，我要表达的是如果你没有无上的决心去忠于你所选择的中长期均线，你就难以成功。 短期均线，无法承载你所需要的波动。选择太小的均线就跟选择跟婊子去谈恋爱一样的可笑。你可以守侯住你心中的中长期均线的原则，它就是行情发动的必经之路，它就是不停的帮助你大副波段赢利的关键。赢利需要时间，赢利需要稳定，赢利经不起反复的折腾，更经不起反复的止损。 对于自己的交易准则，需要像守侯自己的生命一样的守侯。要舍才能得，舍弃你所有看不懂的，折腾不起的行情，独自忍受独自守侯你看得懂的能清晰的执行的大势观准则。交易的艺术本身就是残缺的，完美主义者注定备受煎熬。交易就是种残缺。大成若缺的哲学来形容交易最好不过。 中长期均线与行情价格的震荡，比之短期均线，要小很多,轻松得多，简单得多。舍与得的哲理，需要慢慢的体会仔细的体会。很多时侯，对于赚取利润，要看淡看开。你想着完美，必然大副增加操作难度。大道至简，决非戏言。越复杂的指标，操作难度就越大，失败的概率就越高。 以上其实是我对具体操作的看法。 我的观点：T+0操作依据必须放到日K级别的均线上来，从日K着手。日K才是主力资金考虑的。在小K线上以中长期均线来实现日K均线的指引。日K的短期均线反应即时的基本面，日K的中长期均线反应中期基本面或宏观基本面。95%的短线交易者痛苦的根源在于看得过短，做得太乱。日内短线交易应遵循日K的短期均线的指引（小K线大均线），有清晰的条理和明确的章法。这一篇主要为95%的短线迷惘者而写。 短线交易者，好好理解这段话：无论是日内还是日K波段，行情能过越过日K的两日，五日，十日，十五日均线四条短期均线的制约来发展吗（当然你也可以设类似的参数）。只要发动像样的行情，绝对无法逾越这些必经之路！守侯好必经之路，还需要瞎折腾？就算是日K的突然的反转，能逃过两日（2.5/3.0）均线的监控？把日K均线转换成你喜欢的小K线周期，就是具体的操作之道。 最后上图说明 股指2、5，10，15日均线在五分K图里。 每一次开平仓，都是一次对日K均线的位置，趋势，止损，综合分析判断的过程。 没有你能承受的止损范围内的日K均线大势观（好的趋势位置），唯一要做的是空仓等待。 每一次开平仓，都需要有清晰的日K均线大势观依据及科学的仓位与止损。 交易就是理解行情发动的必经之路与守侯必经之路。 只要足够活跃的品种，无论是过去还是现在与未来，行情都无法逃避日K均线特别是短期均线的制约与监控，这就是“投机如山岳般古老”的终极技术解说。 无所谓短线与非短线，短线与非短线可能是不同的资金需求所导致的不同选择。 站在日K均线的角度，短线与非短线的本质是完全一样。 今天喝了几杯，可能会冒犯大家。树欲静而风不止啊，几百条问询让我很烦，我也没什么好说的，说再多也是对以前所说的一个重复。不要问我日内交易的技术，日内交易我是稳定的亏货，我有自知。在我十多年的市场一线职业生涯中，本人在多家知名公司上过班，自己跌爬滚打外，招聘过不下2个连的交易员，也经常跟券商，期货公司，公募私募，信托里的很多朋友与前辈学习与交流过，我今天在这里，死了你们的心吧，不得已的冒犯你们一次。 在本人及诸多朋友的经历中，真的没有见过你们梦幻中的那种小止损稳定长期赢利的日内高手，一个也没有！我们亲眼见证了中国期市与股市十几年的风雨与乱像，吹牛的，装神棍的，欺骗的，造假的，你方唱罢我登场，真正经得起考验能稳定长期赢利的一批人，早就被一批批求贤若渴的机构高薪挖走了，以深圳为例，私募资金7000亿以上，公募资金1万亿以上，需要多少真正顶尖的交易员？ 矮矬穷的屌丝总喜欢赚快钱！ 矮矬穷的屌丝总喜欢重仓满仓超重仓（配资）！ 矮矬穷的屌丝总喜欢的在狭小的波动区间分出胜负！ 矮矬穷的屌丝总喜欢以小博大，以很小的止损去博大副止赢！事实上是博不了大被止来止去找不到北！ 矮矬穷的屌丝根本没有承受亏损享受浮亏的勇气，哪怕是狭小区间的正常波动，那怕是行情再正常不过的波动！ 矮矬穷的屌丝缺乏最基本的智商，缺乏最基本的理性，缺乏最基本的逻辑推理能力，总是以莫须有的虚幻的伪神骗子神棍为奋斗榜样，从没有想过认真的冷静的理性的分析及科学的仓位作交易。有那么多神话吗？你亲身见过，考察过记录，实事求是调查过？多少的神话，被拍死在18层地狱！多少的神话人物，苟延残喘偏安于某个疙瘩独自伤悲！年复利26%的巴菲特成就了最大的真正的神话。深圳1万7千亿资金随时恭候神话高手，你们眼里的那些遮遮掩掩厚颜无耻不知羞耻的神话， 也只能骗骗那些智商低劣的矮矬穷屌丝，经得起任何第三方的透明的检验与考验吗？在投机岛，至少本人没见过任何一个像样的神话，一个也没有，不用找了。 神话只存在于脚踏实地的努力工作中！在日内交易的定性术法中，你们在寻找神话人物来学习来励志？我旗帜鲜明的告诉你们，100万人中，也没有一人！严格定位，长期考察，100亿中也没有一人！如果有，巴菲特早就不是首富了。五年的时间，我相信雷凯的老总，最深的体会就是：日内交易没有神话，没有高手，一个也没有。 太多的人不知道自己在干什么？总把商品股指正常的波动看得如洪水猛兽，用超重的仓位折磨自己。银行利率一年5%，不使用杠杠主力合约的波动是银行利率的100倍了，矮矬穷的屌丝还要把它放到500倍，700倍，1000倍！这样的仓位，难道不是疯狂的魔鬼？？以疯狂的魔鬼的心态，你们配谈技术与策略吗？随便一个正常的波动与震荡，都让你们坐立不安，寝食难安。以几百倍上千倍银行利率的心态，去操盘， 研究讨论技术，难道不是亵渎高贵的技术？高贵的技术为你所用的前提，你还是个正常的人！ 几十万的矮矬穷的屌丝，征战雷凯，从来没有想过本人上面的问题？高贵的交易领域，疯狂的魔鬼过去未来和现在，都是养料，仅此而已，100亿人中，也无人可以改变这个规则，更别说一个小小的投机岛。 量力而行，这是生活中最朴实的道理，也是我送给大家的。在这个前提下的，真正的努力认真的做好研究分析工作，才能有所作为。 跟很多45-50的成功的老前辈交流学习过，听他们的诉说与感悟，很多人感慨，20年的跌跌撞撞，看了 很多的书，走了很多的路，做了很多的交易，不过是回到了没做交易前的状态才赚到钱，用最朴实的生活道理战胜了市场。 不得已的冒犯，不得意的回贴。虽然无礼，但说的都是真话。三思。不要再问我，该说的，我毫无保留的说完了。也请别再刷贴。 T+0导致太多的人过度交易。 太多的人幻想从不稳定的频繁发出的日内信号中追求长期稳定的赢利 试问，不稳定的频繁发出的日内信号真能实现长期稳定的赢利？如果说能，概率学这门科学以后大学不用上了。数学金融方向的所有学科都可以取消了。 在朴素的哲学面前，在伟大的交易法则面前，想超短炒单长期稳定赢利的人，那是白日做梦，想得太美。 极低概率的短线高手可以风光一时，但也绝无可能用日内不稳定的超短炒单来实现。 期货公司与相关机构包装的短线高手与托总是那么神奇，一个赛季N倍，下几个赛季就看不到影了，这里面的水太深。把国内前五规模的实盘比赛历史都比较下吧 日内不过是谋取每天单根K线的利润 日内向连续的日K趋势衔接，个人认为，一天一单都足够了。 日内谋取的仅仅是一根日K的利润 一天一单，仅此而已。 开仓带好止损，不打止损持有到收盘。 别想得太复杂，折腾得太多。 日内连续的势就是日K均线的势。 我对日内的定义：带好止损，一天一单，仅此而已。 没有章法的瞎折腾日内，绝对不如一天一单的顺其自然的守拙，无论赢亏，都是一单。 每个阶段，都听到很多缺资金少资金的朋友的抱怨。 我能给的建议是，在没有真正的有一套稳定的赚钱的交易体系前，请不要以自有资金做单，更加不要去代客理财。人至少要35岁以后，你才能认识到这个问题。你必须正视导致你贫穷的本质根源。一个人穷困，一是懒惰，二是性格与思想的巨大缺陷。 投资这条路上，每一天每一单都是决战，不是儿戏，那怕是模拟单。在你的性格与交易思想没有成熟前，自有实盘做单不过是一场恶梦。而没有稳定3-5年的连续的优秀交易记录例证的前提下，我给的忠告是饿死不代客理财！如果你想从事投机这条路，你想进入财富的上流社会，必须有足够的底蕴与极佳的人品。任何一笔失败的代客理财，都会成为你的人生污点，极难消除。凡是找账户做的人，不首先提供三年以上连续交易记录且有第三方佐证的人直接列为骗子。无论这三年的记录如何，你必须无保留的提供给你的投资方参考，是否决定与你合作，不得有一丝一毫欺骗。 对于雷凯这种模拟盘稳定2个小周期就选拨人才的公司，我对其表示崇高的敬意。其气度在全球的投资界都让人仰望。他给了广大参赛者一个无比宽容且宝贵的机会。如果你们去领教下，真正的投资公司选拨人才的苛刻与追寻你进入这个行业开始的第一笔始的记录，你有何感想。本人遇到过追踪本人10年记录的公司。越是好的公司越是苛刻。他们要看到你成长的每一步。履历与记录作假与逃避，你想都不用想。 要想拿到令人咋舌的薪水，你必须做好从现在起，每一笔交易都必须有充足的理由及严格的止损。 越是穷人，其风险意识越差。越是有钱人，其风险意识越强。每一笔交易，开完仓无条件带上止损。这是交易员的第一步。 风险控制是交易员的第二生命，贯穿每一笔交易。 有人说本人没有对仓位管理提出过建议。那我告诉你们吧，我是固定资金比例交易者，并严格止损。 比如50W做一手股指，100W做2手，依次类推。金字塔加减仓我个人认为那是个天大的笑话与乌托邦，仅供参考。如果你浮赢加仓，势必加重仓位，那么在重仓后，你无法承受行情的正常波动而提前出局。如果你亏损减仓，势必后续头寸加大你的止损及与趋势对抗！金字塔加减仓是投机界的一大笑话。太多浮赢加仓的被打回原型，乃至巨亏爆仓。金字塔减仓遇上非理性的行情，轻仓也会爆仓。每一个神话背后，都是利益的肮脏的驱使的原罪，经不起客观的基本的自然科学的考证。 江山易改 本性难移 如果你没有稳定的赚钱的能力前，无论以任何手段进入投资公司与代客理财，都注定是你的人生悲剧与耻辱。谨之慎之小心之切记之。君子决不行不义之事，不取不义之财。 雷凯之类的平台或在自己能力容许范围内的小资金实盘练习是唯一的的走向稳定的路。如无真本事，切莫自取欺辱。 我现在觉得雷凯就很好，真的很好。它基本可以做到以日内的日K的趋势衔接日K均线的势了。 过于过度交易，盲目随机交易者，我能说的一句话是：江山易改，本性难移。 如果不正视自己的恶劣的交易习惯，正视自己性格与思想的巨大缺陷，并痛下决心改之，也许一生你都是失败者，并且这8个字耻辱的伴你一生。 仓位，固定你的仓位，我的忠告。 止损，严格止损，每一笔下单后带上合理的科学的止损。并伴随交易的一生。 交易次数，一天只做一次交易，就算是雷凯，极其特殊情况，不超过2次。一天一单，严格止损，按交易计划交易，是广大过度交易随机交易者，改变恶劣的交易秉性的最佳方式。你可以信，也可以不信。 日K均线交易者，以年度计算，交易次数应低于每天0.2次。 今天跟朋友聊起交易的圣杯，偶尔有感。 太多的人在追求交易的圣杯，其实交易的圣杯就是没有圣杯！你们被一些肤浅的骗子误导得太久了。 法无定法，圣杯无圣杯！特别是短线，特别是狭小区间内的精准定位行情的术法，那是绝对的不存在的。 谁如有精准定位短线行情的术法，可以复制，机械执行，哪怕是只做全球前五的股指与利率期货，最多三年，一定是世界首富。这是基本的常识。有些短线天才，其做单体系，绝对的不可复制。如能复制，下一刻，市场的狍子立刻异变。正如初期的指南针软件一样，用的人一多，立刻异变。 太多的人付出N年的心血与无数的金钱与憔悴疲惫，浪费宝贵的青春，乃至负债累累，追求一个根本不存在的圣杯。 短线或者说狭小狭窄区间去精准把握定位行情，跟预判即时的复杂的人心没有任何区别，一念生，一念起，谁能预判预测？所有的静态的复盘完美的短线机械系统都经不起实盘的检验，因为你们复盘的过程中加入了太多的主观美好的，正确的判断产生的结果。 如果没有稳定的持仓，一定没有利润，这是常识。钱是坐着等来的。一天都发出N次信号的东西也配叫系统？持仓等待是寂寞的，等待大势观的狙击位也是寂寞的。好动，是需要付出惨重的代价的。 打开股指，你能在3%-5%行情波幅内的止损给出一个稳固的大势的，都是完全合格的优秀的交易者，剩下的是策略了。 短线的本质就是混沌。狭小区间内的行情本质就是混沌。全地球也没几个人能战胜短线的混沌。 无论是狭小区间内设置止损，还是追求狭小区间去定位精准定位行情，唯一的下场就是死路一条。 没有稳固的信号，就没有稳定的盈利，这是期货交易的根本所在。 日K以下的K线与均线及重要的市场心理位，没太多参考价值。 依托稳固的大势与重要市场心理位或确定稳健的基本面做出交易计划，给出相对大的经得起行情正常波动的止损，相对轻仓，进行交易，是所有有志于有番作为的交易者最终都要走的路。 别想懒惰的追求短线的圣杯，那只能是很傻很天真。 绝大多数的人，历经5-15年的交易后，不过是回到交易的原点，一如交易的第一天面对的市场，无法掌控，一无所知，无从下手。这个过程后，回到这个原点后，你们才能卸去你们曾经的狂妄，自负，无知，贪婪，浮躁，野心勃勃。重新像面对生活的油盐酱醋一样，你才能新生。一句话，把交易当成朴素的过日子的心境了，你才能新生。 一个男人，只有历经沧桑后，才会明白人生的信誉多么重要。 年轻时偶尔冲动做错几件事，也许需要几年，几十年的时间去恢复你的信誉。有的则成为一生的遗憾。 本人严厉反对盲目自负自大无知拉资金的行为，这是对自己对别人的极其不负责。 如果没有自有实盘记录或第三方公证认可的记录，那么你就老老实实做2年模拟，提供2年持续的模拟记录，靠嘴皮忽悠，非君子所为。 华尔街无数的交易了一辈子的职业交易员，我也没听谁说掌握了交易的圣杯。 还有人居然以交易的圣杯来忽悠。。 40-50年的职业交易的沧桑，都不如中国几年十几年的亏货与暴发户掌握的圣杯? 国内的一些大神，根本不知道也不理解国外程序化所涉猎的深度与广度。 交易的圣杯比乌托邦还虚幻100倍。市场的浩瀚与复杂，就是人心波动的海洋。 交易像山岳般古老，同时也是随时准备裂变变异的狍子。任何时候，都需要具体分析。 市场像山岳般古老，只是揭示了特殊基本面背景下，可能大概率要走的一种大势。 但是人心是万变的，即使是曾经的已经客观走出的走势，也仅仅是千百种走势里的一种，或者说被命运所选中。如果以这种走势或者说历史走势，来进行系统或术法的说明与检验，那是错误的。因为这种即使已走出的走势都是千百种走势的一种。静态的复盘就是马后炮。小势的图形由资金任意刻画。但是特定时段的特定的大势均线的能量轨迹是非常稳固的。 如你用软件对全球的活跃品种选取10-15个，假使以1-480日均线，进行为期20年的主力合约测试，从1-480日均线参数，将盈亏综合，所有的参数都会亏钱，你信吗？在特定的基本面背景下或行业背景下或市场气氛下，选择大势均线，可能能很好的赚钱。如何去定位大势，则需要你具体分析，努力工作去定位。有些参数在某个特定品种上某个时段，能很好的赚钱，但你认为找到了万能的圣杯，那就太小看市场了。 有些人对一个特定品种，复下盘，对一个指标的参数下意识的优化与盈利最大化，检验一个历史时段或运行于一个时段，就认为找到了圣杯。我给这类人的点评时，你很傻很天真。你以既定的走势为依据，先入为主的历史测试叫系统？换一个主力品种，截取一个较长的时段，进行动态的测试，所谓的系统，大概率是亏钱。市场的智慧与复杂远远超越了我们曾经的想象。 见过很多不知所云的投资公司的招聘广告，“有自己的交易系统，能长期稳定的盈利”。想下就觉得荒唐。如果有这种人才存在，堪称逆天也毫不过份。管理1万亿的基金都太委屈他（她）了。区区几千元几万元的工资，你们就招来了逆天的人才。。 我们做交易的，太多的人，活在乌托邦里，脱离生活太久了。 法无定法 任何方法与参数都可以赚钱，也可以亏钱。 克罗先生的方法只是对过去的特定的品种特定时段有效。未必适用于现在与未来。 如何选择你所做的品种的特定时段的稳固的信号或者说稳固的能量轨迹最重要。这个需要具体分析。 学习兵法不要拘泥于一成不变。 很多人问我怎么做交易，我如实告诉你们，我不知道，因为每个人的实际情况不同，心理承受力不同。 期货交易，我有个标准，可供借鉴参考。 1：平均1星期止损一次的，基本及格，50分 2：平均2星期止损一次的交易者，60分。 3：平均1个月止损一次的交易者，70分。 4：平均3个月止损一次的交易者80分。 5：平均半年止损一次的交易者90分。 6:平均一年止损一次的95分。 7：平均一年以上止损的，满分。 这是我对我所了解的成功交易者所做的一个止损统计做的评价。 止损很重要，但如何做到少止损次数与不止损，远远重要于止损本身100倍。顺大势，轻仓，耐心等待狙击位，精研基本面等等都是为了少止损与不止损。 止损是不得已而为之，短线行情，资金的刻意暴力打压与拉升，不过是打出散户的止损。多少止损，如果多拿上3天，一周，一月，都是暴赚的单。 立足于少止损不止损，再去寻找狙击机会，才是正道。仅供参考。 开完仓就想着止损的人，那叫不知所谓。重仓的人，满仓的人，随时想着开仓的人，顺小势的人，都是随时准备割肉的割肉机。 如果你能做到回避大的系统性风险，又能做到少止损与不止损，实现财务自由，那不过是易如反掌的事情，你可以信，也可以不信。 现在天气很冷,码字辛苦.顶不住几位论坛朋友的殷勤邀请,我再讲2点交易之外的东西,仅供借鉴参考,高手们多多批评指正. 我可以把我前面所有的所说的话,总结为三个字&quot;不要贪&quot;以及不要贪的缘由. 我把投资总结为九个字.后面6个字的总结将会很简单. 获取利润无非是靠三种模式: 1:市场在非理性的高度泡沫之时,逢高做空获利. 2:市场在非理性的价值洼地或商品生产成本与生产成本以下的,逢低做多获利. 3:市场在箱体震荡时,寻找市场的局部非理性机会或错杀错配,狙击,高抛低吸获利. 无数的人败在我下面要说的三个字,那就是:不要怕! 各行各业,太多的失败者,都有非常好的眼光,但是他们败了.败在哪里?败在不够执着与坚定,因为害怕,所以不够执着与坚定.败在没有坚持自己的理性的思想判断，败在害怕亏损。 最值得尊敬的人是有自己的思想与主见的人. 最可怕的对手与最让人敬畏的对手是执着的人,坚定不移地执着自己的思想与主见的人. 每一个大成功的人,不管任何行业,都有霸绝天地的执着与坚定信念.墙头草永远是配角与悲剧. 我再重复一次:只有偏执狂才能大成功,这是万古的真理. 如果你在高度泡沫的市场相对轻仓(1-2倍)做空,你需要害怕什么?让利物莫德名言陪伴你就好了.钱是坐着等来的. 如果你在价值洼地或生产成本以下相对轻仓做多,你需要害怕什么?同样让利物莫德名言陪伴你,坐着等吧. 看对行情的太多,做对行情的太少,因为他们害怕暂时的短线的失利,害怕一时的反向的基本面评论,就早早放弃.他们只争一时只争一天. 浮亏值得害怕吗? 正如前面,我坚定认为2000点的上证是大底一样,说句实话,就算跌倒1500点,我一样是最坚定的多头,跌倒1500点我一样如沐春风,算什么.是男人,就要执着于自己的思想与理性判断!那怕战至一兵一卒,那怕只剩裤衩，那怕举世皆敌,也不为所动，再黑也会有黎明。 没有绝对的信念,就没有绝对的成功.敢跌我就敢补,无视一切.别说一根或几根小小的阴线,更别论一批墙头草的靡靡之音.技术与图形很多时候就是扯淡,特别是些小势,只有无敌的信念才能让你无敌于期市,无敌于股市.在价值洼地,主力一定会刻意做线欺骗,一定会基本面控制媒体欺骗.反之,同理.技术图很重要,基本面也很重要.但更重要的是信念与执着.只由信念与执着才会让你不会害怕.记住,无敌的信念与执着,才有可能让你无比的辉煌!这不是能看懂几张破图,会些小法小术换得来的.这是至高无上的情商.如果你的投资的理性判断符合社会发展的基本规律与普世价值观,又占据了极佳的位置,那么就要用无敌的信念扫平一切障碍,打败一切无知的做秀的对手与主力. 说句实话,如果你坚定认为上证会恢复到估值常态,比如16-20倍的整体市盈率,那么至少2000点上再升50%,这是必须的.那么任何下跌,都要敢于加仓敢于补仓,算什么,无视一切的持仓.图形是什么玩艺?要做大事就要有足够的绝对的抗压能力,绝对的执着于自己的思想!走自己的路,让那些无知的可悲的可怜的墙头草被市场扒光裤衩去吧.对不起,平生最看不起墙头草。太多的期货媒体还以墙头草为荣，搞笑。 斯坦利克罗,2美分的极限低价建仓白糖,后来跌到1.33美分不使用杠杠的前提下,亏损35%.他放弃了吗?他认输了吗?没有,他顶住一切压力,想尽一切办法,最终暴赚30倍离场(不使用杠杠).没有绝对的抗压能力与绝对的忠实于自己的思想与主见,在金融市场,注定百无一生. 太多的人想以小搏大就大成功,想蜻蜓点水的停留于交易的表面就成功.有可能吗?我前面就说过这种价值导向本身就是错误.主力是极其贪婪的,顶部与底部都是非理性的,因为他们需要足够的腾挪空间.小止损失自欺欺人.逆势又如何,顺势又如何?什么是趋势?这本身就值得思考.主力是极其诡诈的，所刻画的所有的图形与控制媒体，都为了让散户在价值洼地交出筹码，在高位站岗。主力可以在50多倍的整体市盈率下，让广大散户去买48元的中石油，可以让广大的散户买铁定归零的末日权，无它，造势与赢利效应锁定贪婪的人。上证11倍整体市盈率了，大批的个股破净了，正如我前面说的，大批散户被吓尿了。因为主力会用自残的短期砸盘导致散户与大批技术派错判，K线很多时候也是主力愚弄不坚定者的工具了。情商高明的人，早就看明了看透了这些小动作。心洞若观火，再持无敌的信念，何惧之有？ 如果你认为5400是白糖的生产成本（2012），那么5400以下你何惧之有？商品运行于生产成本之上是常态吧。你为什么害怕短线的亏损？为什么害怕？亏2个板怎么样？5个板又如何？算什么。轻点仓，尽你的一切力量与智慧去忠实于你的判断，去化解风险。狭路相逢勇者胜。没有承受巨大亏损的能力，就没有暴赚的可能。以大搏大，以大搏小才是王道。主力赚什么钱？就是靠非理性的小部分仓位的自残来打广大散户的止损来获利。看对亏钱的比比皆是。看对并做对，无视一切的持仓到大赚，你知道需要承受多少压力与浮亏与煎熬吗？没有无敌的信念与执着，你能坚持？ 为什么一些高手，经常几天半个月，乃至整月的不看盘，连软件都不开，自己去想吧，这类人是什么人？ 如果全球政治稳定社会稳定,没有大的战争与动乱,农产品有牛市吗?有熊市吗?高度泡沫了,就少种点,接下来就是暴跌.生产者亏本了,来年又是高价…以什么样的眼光与级别去看待市场,远远胜于对基本的图形趋势与各种指标的把握.而情商则远远重要于上述一切. 一些没有什么波动的小品种与国家严格调控品种，说句实话，任何位置，一名持无敌的信念与绝对执着的情商高明之人，都可以完美的赚到钱出来。一名真正的高手，就算所做品种反向运行5个板，都会如沐春风，毫无压力，最终暴赚出来。也许你们觉得我天方夜潭，神经了。我严肃地负责的冷静的告诉你们，你们没听错。这种枭雄式的无敌信念与意识，这种不为市场杂音干扰初判的决心，这种霸绝天地的气度气魄与思想，也许需要你们终生体会。我也在体会的路上。。 看对行情的人，基本判断对大顶大底的人，市场参与者中占绝大多数。 在正确的判断，基本正确的判断的前提下，能持无敌的信念与绝对的执着，不为一切所动，执着持仓的人，寥寥无几。 投资是智商的较量，更是情商的较量。 我对于A股的观点与看法，我可以告诉你们： 我坚定地看好2000点附近及以下的A股，我无比坚定地首先看到3000点，这是估值恢复的需要，是股市自身平衡的需要。没有任何人可以改变与动摇我的观点与决心。严重的看好中小盘的低市净率有政策支持的低价股。 图形是什么玩艺？几个破指标又是什么玩艺？一些破股评更不值一提。 在A股当下的价值洼地，敢跌我就敢尽我的全力加仓，无视一切图形与指标，我只要绝对低廉的位置与价格，并持有到暴赚。上证2200点以下的任何阴K，我如沐春风。如果上证再跌向1950点，我买10响礼炮来庆祝。真正的毫无压力与不值一提。1500点我都如沐春风。我的信念：危与机并存，价值洼地的机会一定大于危险。 亏了钱骂人的，别在我贴下留言，那叫丢人与无知。我的所有观点仅供参考。骂我的，2013年底，记得来看A股的高度。 我要表达的东西是：30分K的K线概率最多不过50%，没有大的参考意义。就算是日K与日K组合对于90%的交易者都没有太大的意义。K线的意义只有结合较大的均线时，才能体现威力。 随着K线学的普及，原有的K图代表的大概率趋势，已经在变异与加速变异。股市上的日K做线，特别是活跃股，比比皆是。寻找大概率，首先要从较大的均线入手。较大的均线才是更高的更稳重的趋势。赢利源于稳固的相对少的信号。 以日内短线为例，无论是多么活跃的品种，它所承受的短线与超短线的资金的冲击都是很有限的。假使有超短线天才能在股指上很好的盈利，当他用同一种术法教会10-20名学生，一个阶段后，当所有人的资金达到短线的流动性瓶颈，则80%-90%的人注定亏损。市场无法承受瞬间的资金冲击时， 必定以变异来应对。那怕一个人的资金，一种短线术法达到极限，也会变异。这是基本的哲理。放到战略的高度与时间的长河里看待交易，再辉煌的短线交易员都注定上不了台面，最多暂时领先中长期均线交易者3-5年。 有很多的朋友问我怎么交易？ 我很难给你们准确的答复，哪怕说的再多。 我给你们个案例吧 从2002年至今，整整10年了。 以上证指数为例，请问10年了，年线240与日K线的交点多吗？50次以内 半年线120呢？120次以内。 这些我可以把它定位为超级少与稳固的信号吧。 而像60日均线与20日均线的信号，可以定位为相对少于相对稳固的信号吧。 从稳固与相对稳固的信号中，寻找答案吧。 K线可以基本忽略，只有均线支持的K线才有意义。 如果能做好MA20,60,120,240四条日K均线的趋势与相互关系，同时严格止损，任何品种都能独步天下了。根本不需要起早贪黑研究繁琐的基本面与整天小心翼翼的盯着电脑了。很多人以为有了交易系统就可以赚大钱了，这是最致命的，交易系统永远不会给你带来利润，能给自己带来利润永 … 严重的同意 交易系统在很大概率上带给人们的是盲目的无知的自信与依赖。 我的观点：任何过往的趋势指标与摆动指标的历史走势不能作为统计参照数据，并上升为系统。否则就是刻舟求剑的系统。因为所有的趋势指标与摆动指标都处在无穷变化之中，所有的指标都是变量。特别较短周期的趋势与摆动指标。只有极稳固的势与极少的交点与极稳固的市场心理参照才有参照意义。 我举个简单的例子 假使以30分K的MA60均线与K线的交点作一个参照指标，事实上，如果以今天的静态图来看前一个小周期的图形，在事后走出的静态图上，图中的ABCDEF产生的6个交点，你并看不出来。而实际上，它真实的跟K线价格发生过明显的交点。无论是指标与K线的交点，还是指标与指标的交点，在事后的静态图上，有太多的交点，没有体现出来。 技术图形特别是小周期的图，在实战中，远比我们想像的复杂得多。 我曾经在前文中说过，国内有好多位真正做了几十年交易的前辈功成名就后的感悟，聊天后谈起，走了那么多坎坷，不过是回到了交易的原点，用生活的朴实的道理战胜了市场！ 交易的初始点是什么？就是看准一波搞一波，看准一票搞一票，看准一单搞一单，并循序渐进的推进。除此以外，别无其他。而如何去看准一波，看准一票，看准一单，需要严谨的分析工作。看准了就要搞到，止损无所谓大小，只要你能承受正常的波动压力。只要能胜利，多些宽容度，多些应对的策略又有什么所谓。 看准了就要足够的坚定，交易不需要墙头草。 妄图走捷径寻找机械的，系统的术法，懒惰的一成不变的交易原则不过是找死，至少99.9%的概率是找死。市场太过复杂，特别是短线的图形走势。复杂到难以想像。 无论从技术图形的角度，还是基本面，还是市场心理市场氛围，还是博弈学角度，只要能看准一波一票一笔，都是难得可贵的。看准了，特别是好位置进场，就要坚定的等起，拿起，正如这波股指，假如以2000点低多，我做一手股指，只要死拿，就是600点利润。一个月600点，短线，全国有几人能一月600点？有人说，你多少止损，我告诉你们，只要是确定的价值洼地与政策大底，2000点的上证，给200-500点止损都是对的。不付出代价，怎么赚到大钱？不坚定怎么赚到大钱？看准一波后的策略，智慧，配合后的战术也很重要。 巴菲特罗杰斯从来提过交易系统吗？看准一波搞一波，看准一单搞就一单就是最好的最牛的交易系统。 如果你能坚持看准一波搞一波，看准一单搞一单，20%-25%仓位，中小资金一年50%-100%是较轻松的。 坚持5-10年，找你做基金经理的公私募机构绝不在少数，坚持20年，你的身边任何日内短线交易者哪怕最顶尖的也只够看到你的鞋面。30年后已经叱咤风云。40-50年就是金融界流芳千古的传说。 正确的道路，初期的行走，太过艰难，有太多的诱惑。这个社会真正的智者与有钱人，还是认同有稳健的投资理念与稳健投资风格的交易者的，特别是历经坎坷一路稳健的走过来的有漫长的稳健记录佐证的交易者，暴发户与短线暴利者极难得到社会普世价值投资观的认同。 你不要以为趋势线就有什么了不起，某种意义上说，任何指标都是渣。 真正的高手是深研行业与经济基本面与稳重的信号。基本面，仓位，价格已经决定了真实的成败。 很多时候，完全无视任何图形。绝佳的基本面支持，好的位置，就是等起赚钱。 任何短期指标与短周期的图没有一丝一毫的意义。 你交易的是什么？是你的思想。思想能画图吗？你思考的是对一种所有人都看到的一种行情现象所体现的其内在基本面与市场心理及人性的博弈。有0.1%不到的高手能在短周期指标中追涨杀跌中赚到钱，无可否认，但是概率一定是低于0.1%，同时这批人要更大的成长，也必须转到交易基本面与稳重的指标信号上来。 这个市场上的决定力量，大都是深研基本面做单的，以较长的基本面预期去做单。小部分成功的技术派，追逐的是稳重的技术信号。 不要轻易的下单 看准再搞 看准了，很好的位置了，相对轻仓等起赚钱。不贪，就不会惧，不贪不惧就不会败。 波动，短期波动一定是无序的，看淡点就好。顺个大势观或基本面，轻点仓，反复止盈就是。止损是万不得已而为之。 对不起，本人现在基本没有止损的习惯。换月也要扛到胜利，仅供参考，别效仿。下了单，我一定有我坚持到底的理由与信念。 所谓的趋势与止损，整天挂在嘴边的，99%都是期货没入门，可以当我放肆的说这句。 不局限于某一种方法或分析角度，关键是做你最有把握的最确定的机会，最好把目光放得更长远些，预期更远些。 为什么大资金超大资金的布局都是提前几个月乃至到瞻望以后1-2年？ 我随便举个例子吧 目前豆粕现货价格4000以上，前期近月1305在1月份打压到3200附近，难道不是低多的机会？1-3个月可能恢复几百点的价差。 再如豆粕的现货价格最近半年从未跌破过3800，目前M1401的价格仅为3171.到2014年的1月份以前，如此低的位置，有多少获利的机会？特别是在2013年的夏秋冬的生猪家禽的饲料需求高峰期。做单最好预期长一点，仓位轻一点，看淡一点，多留些余地，别太在意即时的涨跌，要步步推进，一点点累积进步。资金累积越来越大，轻仓就会成为一种生活习惯。 曾经见过好几位大资金运作者，特别喜欢在农产品牛市时逐步开空远月，只要位置足够好；在农产品熊市时或暴跌后或产能严重过剩时，做多远月，只要位置足够好。曾经的“唐高宗”“算你狠”等不是很好的例子吗？工业品则要跟随政策。比如水泥，螺纹钢等与地产政策就紧密相关了。 2008年白糖的生产成本3300，但是主力合约最低跌到2800附近.接下来的一年多，从2800左右涨到7000多。暴跌后必定是减少生产，来年供不应求。暴涨后必定是丰产，来年供过于求。农产品非理性的泡沫后，就要敢轻仓空远月，非理性的暴跌后，更要敢轻仓多远月。 无论是商品还是股票股指，其真正的决定走向的因素还是其基本面。特别是波段与中期走向。换句话说，基本面决定未来行情走势，任何中大级别行情都离不开基本面的催化。技术图形只是一种对行情的浅层次的更直观的表现。 了解所做品种的基本面信息后，更要理解博弈学。比如螺纹钢的走向，受宝钢的调价政策的影响就极大。2012年二季度末，宝钢下调几大主要品种钢产品400-600元/吨，期货螺纹选择强势震荡1周来迷惑投资者，之后就是狂跌900点。这是主力用博奕学来麻痹对手。2012年11月中旬，宝钢宣布上调主要钢品种200元/吨，期螺纹钢选择短线杀跌200点来虚幻一枪，之后短线再爆拉500点来应对宝钢上调钢价这一基本面。例子很多，看准了，就要坚定。该持有就持有，该加仓就加仓。很多时候，要从人性的角度分析对手。 千里明眼镜 发表于 2013-2-26 18:25 本金4万元 1万5我才敢开一手豆粕3100 ，还得跌到2800再补1手，3万只能开2手 剩下的还得生活费难啊 也许这是很不合时宜的想法与思想。所有的穷人都是穷在思想上。这种想法很有代表性。每个人的思想决定了每个人的行为选择与行动力，以及执行的信念是否足够坚定。穷人与富人的最大区别是在思想与心境上。 作为一名交易员，有多大的本事就可以做多大的资金，市场的资金源源不断。只要能证明自己，资本市场想做多大资金就可以做多大资金，那怕之前一名不文。抱怨只是因为还没有足够的底气与耐心及信念去做一件事。 以雷凯为例，如果您准备严格的花4-6个月时间来晋级实盘，坚持50W做一手股指或商品期货更低仓位，步步推进的话，6个月左右晋级实盘。前提，轻仓一波一波的推进，而不是没有计划做短线的瞎倒。50W做一手股指都仓位较重了。股指是非常稳健的品种，均线趋势性强，跳空及跳空副度很少。做雷凯，最好是任何一笔交易以轻仓大止损的态度去做，持续1天或一周或2周或3周或1月去做一个你确定的机会。日内与过夜并无多大区别，只是每天下午盘多了次平仓，早上多了次开仓吧。没有谁能时时刻刻洞悉短线的走向，除非是神。但是我们能有时候很大概率确定一个大概率极大概率的大势吧，轻仓交易这个大势就够了，并步步推进，进入良性循环。没有好的机会与位置，就休息观望。 能够做到像对待自己的生命一样对待仓位的话，成功是没有悬念的。过高过急的欲望往往是阻碍自己通往成功之路的最大障碍，并导致自己短视与愚蠢。 成熟的交易员，能以轻仓坚定的去交易自己的思想，做自己最有把握的机会。 最后，送您一句话：欲速则不达。朴素得不能再朴素，但要时刻谨记。 对于轻仓交易者而言，所谓的趋势在较大概率上是您前进或成功的绑脚石。我们这代交易员受财经媒体的愚民式的洗脑太严重了。什么是趋势，好好的问下自己吧。难道是跌破某条线，就是趋势向下？站上某条线就是趋势向上？不要把趋势挂在嘴边，那是最幼稚的交易员的表现。您深思过，11月8号的位置吗？当时天胶面临的内外形势与行业基本面吗？所谓的图形，只有配合好的位置与行业基本面与周期特点以及博弈学等要素才有意义。 以博奕的观点看，RU1309合约，11月8号约处在23000的位置，前期大底20990已经跌破了生产成本，这个筑底的过程图形也比单纯的跌破60天线一根线更为稳靠与久经检验吧。假设20990是下方强支撑，合理吧。那么您可以思考下，23000的天胶在未来的几个月，往上2000点容易，还是往下2000点容易，答案不言而喻。如果轻仓，即使跌到20990有又什么所谓，那是基本面的生产成本线了。 在天胶本身处于严重的相对低位区间，跌了几千点了再去判断趋势向下，并形成操作依据，您觉得合适吗？反之，同理。所以您的这2笔交易都是明显的败笔。 如果有足够的基本面支持与图形大势观支持，轻仓交易者就要有勇气大无畏的敢于抄低摸顶，这比马后炮的伪趋势交易安全100倍。 天胶20-25W做一手就OK了。目前天胶就是个箱体。20990的支持到上方120周线的持续压制。120周线压制一年了吧。 正如现在，就箱体位置而言，20-25W逢低在24000-24500小区间或以下低多一手显然要安全的多。 前几天还跟位朋友聊起白银，某期货公司的分析师还建议他大举开空，他跑来问我的建议。我当时简直有点愤怒，他唯一的理由就是均线趋势向下。我们这代的一些鸟人，用“趋势”这个美好的词玷污了投资不下20年。对于货币长期泡沫的浮动货币体系下，白银杀跌25%后，就大举开空了。这跟2000点的上证去做空股指有任何区别？6000点的白银无论是短线中线长线，往上1000点都比往下1000点容易的多吧。也许往下500点都比往上1500点难。很多时候投资真的要独立思考，多角度思考。不要单看所谓的一个破趋势。所谓的趋势也许几天就反转了。很多逆势的好位置，都是输短线之后波段暴赚的点位。 抄底摸顶也没有那么可怕。规避大的系统性风险的同时，规避边缘化的品种，操作关系国计民生的大宗商品或指数时，有相当的稳重，只要保持严谨的分析与轻仓与好的多空位置，无论是谁是主力，一样无惧。金融市场自己永远是自己唯一的敌人，就怕自己不够认真与不够勤奋。盲目的恐惧是无知的表现。 对于股票来说，我曾给过很多散户建议，个股看都不用看，常年操作ETF基金就行了，比如ETF50，ETF300.投资首先要选择稳重的品种。个股也许一个阶段赚了很多，但是不小心就是一个单个的黑天额事件导致爆亏。很多时候指数没跌多少，个股跌得认不得爹妈。指数的波动会少很多，也稳健很多，特别看好的底部时，那怕融资1倍，也要好过操作个股。操作个股一旦运气不好，就是满盘皆输。一步一个脚印的做稳重的品种与实打实的掌控风险，终会有大成之时。边缘化的期货品种更要回避，太容易控盘与深度操控。 2000点的上证时，就算是操作ETF基金也比存银行安全得多，同时按两者整体市赢率计算，收益高于银行86%。因为银行5.5%的年存款利率，市盈率为18.18倍了。有人问，为什么比存银行安全？如果ETF50或300这50支，300支中国最优秀的蓝筹崩盘，整个A股与所有的上市公司照样全部崩盘，所有的银行股一样崩盘，所有的银行一样倒闭破产，风险是一个级别的。1929年大股灾时，多少银行倒闭了？2000点上证跌到1600点，一定是史无前例的股灾了，操作ETF的风险完全确定，就是20%。如果A股不崩盘，经济态势再烂，也至少会向估值的中轴线靠拢，这只是时间问题。 同样，假设2000点是A股2013年的大底的话，那么在低位区间的任何一次回调（比如2300点附近），可能都是弥足珍贵的低吸机会。 无法操控市场，但是可以确定机会，在确定中学会坚定，在确定中学会坚强，在确定中稳步发展。 你做多的理由是什么？何需问别人呢。棕油的定价权在马来西亚，全球70%的产量在马来西亚。它本身就是一个很边缘化的品种，在中国，一无强力的行业协会，二无国家政策的调控与保护，太容易产生意外的偏差与深度控盘。凡是与中国国内的产业工人没有密切关联或经济息息相关的品种，都要特别的小心应对或回避。 既然你这么诚意，我简单的分析下吧，仅供参考。无论你做多任何品种，第一要关注的现货价格，第二是生产成本，第三是行业的盈亏价格线，第四是行业周期规律与行业基本面，第五才是当前的趋势。 棕油最近一周，其现货价格主流报价都是在6100-6150元。看你的贴，你在6600左右进场本身就是极大的不智，我的理由很简单，日K空头均线排列之下，期货升水现货500点，你有什么做多的理由呢？？空头均线压制之下回归现货与向现货靠拢是极大概率事件。摆明亏几百点的事为什么要做呢？ 棕油因为定价权在马国，我们并不清楚其生产成本，或者说马国的棕油行业认可的赢亏底线。所以要格外小心了。 棕油在前期7200时，升水现货近900点。波段与小周期做多的几乎是必败的局面了。再看下行业基本面，中国是全球最大的油料消费国，4月左右，南方天气升温，水产养殖复苏，对饲料的需求大副提升。同时，4月后南美大豆集中到港，粕类饲料的提升需求，加大大豆油的供给压力，势必影响到同类的植物油，棕油是世界第2大植物油，显然会受影响。呈现粕强油弱的格局。棕油的库存与供需，还要分析马国当前的具体情况，我不清楚，不予分析。未来1-2个月，大豆油可能还是一个相对较弱的格局。 目前来看，棕油的现货价格在最近阶段一直比较稳定，或许1309的棕油在靠近其现货价格后，会获得支撑。即使棕油继续向下，完成中期底部的探明，我个人看，未来1个月，也难以有大的表现，即使有技术性反弹，级别可能也不大。从辩证的角度看，1401的棕油在棕油完成中期底部的探明后，可以耐心等逢低做多的机会。 1309的棕油或许还有杀跌，理性的对比各方因素考虑，杀跌的幅度可能在200点以内了，或许并没有200点，谁有能精确预计呢？我的理由是，产业方面，在近阶段稳定6100左右的现货，自然有产业方面的深刻考虑。 粕特别是近月的1305的豆粕与1305的菜粕，可能远强于油。原因，极度紧缺的供需关系与进入4月的旺季需求与交割月即将到来，高高在上的粕现货，极大概率多头要进行赤裸裸的硬逼仓。目前以豆粕为例，现货价格稳居4100以上，目前4160.而1305的期货仅为3685.期现价差盘中超过500点。菜粕现货稳居2800，而今日盘中，菜粕1305杀跌到2550.如果近期近月的粕不进行价差恢复，接下来就是赤裸裸的硬逼仓，没有丝毫悬念。主流资金近阶段也一直在空油多粕，多油能有前途吗？ 靖 发表于 2013-3-12 10:59 请问博主，现在白糖的行情是否将很快启动 我倾向于白糖1309在3-5月运行箱体，箱体5300-5600.5400以上运行概率更大，也就是偏强运行。 一方面政府的收储政策与制糖刚性成本为糖价提供支撑；另一方面我国白糖工业库存高峰通常出现在每年的3-4月份，其中3月份为库存高峰的比率超过70％；白糖生产的自然规律决定了糖价在每年3-5月份存在季节性下跌需求；如无大的反弹，在高昂的制糖成本（5400-6000，也有糖协说法5800-6000）支撑下，难有大跌。 另一方面，今年两会有两会代表提出议案，在高昂的制糖成本下，为了不伤农与保护糖企，提出了每吨糖直补500元的议案。 同时，目前云南的干旱，可能对白糖减产造成较大影响，这个需要接下来持续关注。美糖也底部放巨量，商业买盘进驻，有明显的止跌企稳，构筑底部的迹象了。 无论是内糖还是外糖，我个人认为，当前的低位的价格已经基本反映了全球供应过剩的基本面。现货市场4月份之前难以出现大规模的采购，且1、2月份进口量仍处在比较高的水平，我国白糖生产的自然规律决定了糖价在每年3-5月份存在季节性下跌需求。数据显示，我国白糖工业库存高峰通常出现在每年的3-4月份，后期逢高做空较为适宜。但是这一利空的周期基本面可能被我上面所说的4点利多基本面基本消化了。短线的涨跌，我看不懂，请见谅。 综上，考虑到时空因素，1309在5400附近或以下，逢低多或许更好。在3-5月，在5500-5600或以上，逢高空或许更好。仅供参考。如果云南干旱加剧，做空要格外小心，箱体上沿做空也要格外的小心或观察。 （白糖每年10月-1月往往是上涨周期，炒作霜冻概念与双节需求概念，同时库存相对全年最少。10月左右，寻找机会，轻点仓，逢低布局是上选。） 真正的大资金稳健赢利操手，我几乎没见过超过2.5倍杠杠的。常态是1.5倍到2倍。你跌100点就加仓，不过是灭掉自己的后路。做错一件事（大是大非的下单错误），不要指望几天内10几天内通过窄副补仓来消除影响。轻仓抗过一个周期或许才会让你认识到勤奋的做好准备工作的重要性。盲目下单的恶果你要深刻的品尝。 交易是一项轻松，自在，自由，高贵的工作，只有洞悉人性的人才能闲庭信步。不是让贪婪与恐惧主宰自己，把自己变成不像人。交易的过程一定是快乐与充实的，不是恐惧的。简单再分析下： 马棕榈油2月末库存量略低于市场预期，但是3月份马来西亚毛棕榈油关税上调对出口的影响开始显现，据船运机构ITS数据，马来西亚3月1-15日棕榈油出口量较2月份同期微幅增加0.2%。且南美丰产大豆即将批量上市，全球植物油供应增加仍对国际棕榈油市场形成打压。 从海关数据来看，2013年新的进口植物油检验标准并未对棕榈油进口受阻。而在需求仍未有明显起色下，棕榈油港口库存量居高不下，至本周初，港口库存攀升至140万吨左右的历史高位。今日24度棕榈油现货价格总体稳定，报价5750-5900元/吨。期货05合约相对现货升水约150元/吨，09合约升水约400元/吨。但豆油期现基本持平，不存在升水，所以棕榈油仍相对豆油偏弱，豆棕价差维持高位运行。棕油的近月与现货价格开始往下松动，这是对你不利的。你依然要保持最高的警惕与风控意识与手段。 马棕榈油库存有所缓解，但受南美大豆即将收获上市影响，3月份出口需求仍令市场持忧，且国内库存压力居高不下，现货市场购销行情清淡，期价承压短期弱势难改，反弹幅度或有限。 建议：无论你多么看好未来几个月的棕油，但你还是要对3-4月的南美大豆丰产做好最坏的打算，寻找短线反弹机会减仓。4月国内水产养殖对粕类的需求暴增，特别是菜粕（水产主饲料），势必加大对菜油的压榨。菜油与大豆油的双重供过于求，会在较短的特定的时期内对棕油起到较大的基本面负压。 如果你下行窄副加仓，那怕一次10%，100点一次，如果下行到5900-6000点，那么你就是爆仓或大副亏损，这种可能性完全有存在。所以你要短线技术性反弹后减仓，减仓后轻仓耐心等起，等待周期性的回升机会的到来。几百点的空间对于周期性基本面来说，根本不算什么了。 如果你做了勤奋的研究，从1月开始布局，做多的是1305的菜粕而不是棕油，现在享受的不是胜利吗？基本面与图形对你双重利好，外加硬逼仓。 所以我说，交易的一致性是勤奋，勤奋的研究分析，打有充分准备的战争。 如果你在6600-6500点的首仓建仓多头后，不动，不加仓该多好。几百点的跌副算什么呢？2倍杠杠也最多亏17%-20%，完全扛得住。多头的基本面周期到来，也许还轻松赚几百点或更多。鼠目寸光的期货人，总是输不起，输一点就要加仓，那点幅度值得加仓吗？如果杀跌或上涨没有引起国家的干预，或者倒逼供需一方的产业，完全没必要补仓的，目前任何一方的棕油供需方，我还没听见谁喊痛。好的位置进场，不需要随便加仓。等起就是必胜。 内心的过多的贪欲需要时刻反省。 胶自2009年初到2011年长达2年的大牛市，需要1-2年或以上的时间要消化修复。只要是大宗商品，注意这个前提，非超级稀缺的黄金，无论是不可再生资源还是可再生资源，牛市过后，都有强烈的修复要求。这是供需产业一方与整个社会经济行业的一种适应性调整或者说平衡手段。 2009年-2011年是因为一则对2008年的暴跌的一种适应性的平衡修复，二则是对09-10年底中国汽车保有量爆发式增长的一种需求反应。目前是对经济全球衰退大环境下的正常刚性需求下的平衡性估值。流动性和短期刺激推高的价格需要实体经济的消化。 2月27号以来的阶段杀跌原因有六： 1：2013年2月20，温总理在中南海主持召开本届政府最后一次国务院常务会议,针对近期部分热点城市房价上涨趋势明显,研究出台了有关调控措施。这是新城镇化概念提出后，首次中央层面的再出重拳打击地产，与地产密切相关的钢材，螺纹，水泥，玻璃，焦炭纷纷暴跌，天胶具有强烈的金融属性，难以独善其身。 2：2005－2008年主要产胶国大量新种植橡胶树于2012年开始陆续进入成熟期，潜在新增产量规模很大，成为中期压制橡胶价格的主要因素。这也是导致2012年年线收阴的主要原因。主产国库存积压严重，目前依然是去库存化的过程。 3：2012年的天胶价格受到了泰国国家收储政策的一定提振。2013年2月后，泰国宣布3月份不收储。这是一个较大的阶段利空原因。 4：汇率贬值因素推动。日元近期贬值比较大，日胶回落，沪胶跟随回落。 5：3月7号，青岛保税区天胶仓库发生大火灾，青岛保税区来了一个政策要清库，如果按照这个制度来执行的话，将有十几万吨橡胶会推向市场，这样对市场形成压力可想而知的。因此，出现暴跌走势情理之中。目前青岛保税区依然没有太大动作，如果这种状况被大家淡化，也就发文过后没办法推行下去，对青岛保税区清库行为逐渐淡化，不排除修复过程。如果这个制度严格执行，市场可能一定低点走势。 6：塞浦路斯危机，整体商品期货市场释放系统性风险。或许级别不大与短期的，胶的金融属性强，会跟随短线杀跌。 胶的价格目前来说，可能已基本反应了以上利空。个人倾向于短线不破前低。（前提：塞浦路斯危机系统性风险不蔓延与加剧以及青岛保税区的天胶清库计划搁置） 这几天好几个网友问我对A股的看法与如何买股。我没法精准的回答。我简单说下自己的看法。 A股的行业基本面要一下掌握太难太难，不是一缀而就的。我把ETF指数基金与券商股作为两个最重要的投资标的介绍给散户朋友。较大资金考虑ETF指基，银行股，两桶油等超级权重就好。 如果A股的整体估值过高，融券做空券商股是个很好的选择。如果A股进入价值洼地与杀估值行情，逢低坚定做多券商股。券商股是股市真正的晴雨表。好好的看下龙头中信证券在牛熊市的疯狂表现吧。这个相对于ETF指基有一定的激进。可以这么说，A股牛市的话，投资能跑赢中信证券等券商股的投资者或机构聊聊无几。中信证券在2005年到2007年2年多40倍，谁与争雄？拿近的来说，2012年12月大盘的大底到反弹高点，中信证券最高反弹近70%，两市又有多少个股可比？2008年中信证券暴跌75%。 随着股指与ETF指基的发展（比如ETF实行T+0），越来越多的中小盘个股可能会被边缘化，要特别小心。随着融资融券成为常规业务，牛市中，券商股的业绩收益是可以预期的。在大盘处于较低的位置时，要保持对券商股的关注。 在熊市中，大部分的个股的杀跌会远远大于50ETF，300ETF等指基，也要特别小心。看不准个股，又想抄底时，ETF指基是首选，连印花税都省了。稳重与稳健的标的，在很多时候，本身就是避风港。 还有2位朋友要求我一定谈下对私募基金的看法。我也简单说下，仅供谨慎的参考，无意冒犯任何人。 私募基金的要求与监管太低，所以我个人看法，至少要考察其5年以上，才做是否投资的决定。对产品基金经理的过往5年或以上的投资业绩的稳定性与安全性要充分了解。请注意，至少是5年。游走在灰色地带的私募基金经理往往比公募的概率高不少。 无论私募多么夸夸奇谈舌绽莲花无论打着任何旗号营销，国内目前还几乎没有牛比的稳重的能连续3年跑赢指数100%的股票型基金经理，连续5年跑赢指数50%的都聊聊无几。 私募基金的门槛太高了，对散户的风险太高，本身就是与散户严重争利。如果散户想赚钱，必须寻找到 稳健的能跑赢股票指数（比如说300指数）100%的基金经理，才算不跑输指数。事实上，国内目前暂时没有这样的人才。 我的理由很简单，私募基金的成本真的太高，不是一般人可以承受。投资是为了赢利，如果选择私募产品，首先50-60%的赢利没有了。3-5%的管理费，国家收20%的法人税率，20-30%甚至更高的私募基金经理或团队的业绩提成。如果算上1年2-4次的业绩说明会与年会等的自负的旅差费，选择私募产品，可能60%的收益不见了。如果自己以自然人的个体户买券商股或ETF指基，可以赚100W，那么私募产品，你只能赚40W-50W。也就说，你只有寻找到跑赢指基100%-150%的私募基金经理，你才能勉强跟指数持平。 付出60%的潜在业绩收益，如果碰上连指数都跑不过的私募基金经理，不过是赔了夫人又折兵，空留一声叹息。 在中国选择私募产品，意味着选择逆天级的人才，谨慎思考吧。 盘中我也不看任何的即时的短线的图。个人11年的成绩一般，12年的成绩相当好。别把我某些对行情在特定的时间窗的评论与个案放到不合时宜的较长时间来考察。基本面时刻在变，行情的观点也要跟随变化。 “小亏、小赢、大赢、保本”所谓的这些词语，是属于博弈学的范畴，研究这些的人，不过是这个市场最低级的炮灰层次。忠言逆耳。 对于图形，现在我只关心中长期均线的突破与跌穿，其他任何图对我没任何意义与参考，基本无视。我用一些图来举例，只是为了说明较长的均线周期比较短的均线与K线相对信号更稳定。稳定的信号比不稳定的信号好。除此以外，别无其它。 我唯一关心的是自己是不是足够勤奋。对于所做品种的基本面，行业周期，重要的即时财经新闻信息突发事件等是否较好的总结分析与掌握了，这是我每天的必修课。本人目前的成绩周K资金收益，30周无回撤。每天我用在所做品种上的基本面分析至少不低于5小时，一般6-7小时。早盘还要浏览重要的财经信息。每天的东方财富的期货要闻，股市新闻，财富天下的期货报道，期货连线，期货日报，4大证券报的重要内容，腾讯头版新闻，ppI100的商品与宏观，商品与期货，商品与产业，商品与证券等都是我的必修课。所做的期货品种，必须无条件的看完所有机构的分析师的观点，吸取精华，再作操作判断。基本每天晚上做完功课，都到了晚上11-12点。早上7点准时吃饭。吃完饭看完早间新闻，准备上班交易。白天，无敌的信念油然而生。不知贪婪与恐惧为何物。 基本面是比技术图形靠谱100倍的东西。真正的做好了功课，基本一份付出一份收获。 我用什么去寻找稳定的信号，甚至于期货行情唯一的真实。我明确的告诉你们，基本面外加日K的中长期均线。迷恋短线图形与圣杯的人，绝大多数不过是懒惰无知的表现。要赚钱，赚大钱，精准的把握小波的，小周期的，中线的行情，必须无条件的精研行业基本面。 我最喜欢跟勤奋的人交朋友，勤奋的人在任何行业都是无敌的代名词。 如果你对所做品种，做了持续的，足够的，充分的准备分析工作与严谨的计划，输钱比登天都难。 绝大多数时侯，基本面，所做品种的基本面，界定了行情发展的唯一的方向。举个例子，中央11月中旬，首提新城镇化概念，对应RB主力合约期价3600.谁去对抗谁死，无论你多大资金。RB借新城镇化概念飙升到4300.2月20号，温总理召开最后一次常务会议，布局重拳再次打击房地产，谁敢做多？在那个特定的时间周期，谁敢逆基本面的政策反向多空呢？100亿够吗？1000亿够吗？再到后续的国五条等。RB一直在跟随国家的地产政策起伏。2011年，2012年，国家打压地产2年，RB从5300爬到3200，爬了2年。很多时候，跟基本面对抗就是跟整个国家意志对抗，跟整个社会的资金与力量对抗。 小小的RM，够小的品种吧，在4月水产养殖暴增，现货紧俏，供需超旺的基本面下，有谁能打下RM1305吗？逆基本面运作，没有谁有那个本事。别说几亿，几十亿都不够看。 短线的图形，资金随意刻画。认识不到这点，是智商问题。改变短线的图太容易了。而基本面却具有唯一性的界定。 国内前20-30家主要期货公司的知名分析师的名字，我基本都很了解。乃至于他们的分析风格，作息时间。每天早晚几点发研究报告。对于勤奋专业的他们，我有最高的敬意。我一直把他们当亲密无间的战友，虽然大多数素为谋面。多少个寂寞的夜晚，有他们的陪伴，内心里充满斗志与温馨。从他们那里，我学到了太多。每天向他们不断学习与分析总结他们的东西，成为了我的职业习惯。在此表示最高的敬意与谢意~很多时候，一个分析师的多空观点，看了会有思维与基本面的定势，但通盘看完，就有心里看得通透，洞若观火的感觉，无敌的信念，必胜的信念油然而生。是他们，陪伴我从幼稚走向成熟，从亏损走向稳健赢利，乃至现在时刻都有无敌的信念。 只要够努力与勤奋，做好足够的充分的准备，超越了曾经懒惰无知的自己，稳定的赚钱，不过是水到渠成。 再次谢谢所有陪伴我征战的亲密战友们！· 散户，绝大多数的散户愚昧到爆，总是想从神话人物励志故事中寻找成功的捷径。愚昧到总想用简单的单纯的一致性交易，简单的技术图标去界定精准的行情与复杂的人心。从来不愿意花时间去寻找决定行情走向的本质因素。从来没有自己的思想与为梦想真实勤奋打拼的决心，用虚无飘渺的东西麻醉自己。动不动像个弱到爆的屌丝样以“未来巴菲特”自居。 深圳福田中心区，上海浦东我所知道几十家待遇最好的投资公司，没有招技术派的先例。自己去思考吧。那点肤浅的技术，谁不懂？精研基本面，即时的时时刻刻的与时俱进，掌控所做品种的全面基本面，需要付出多少汗水与艰辛？没有做过的永远不会懂。 冒犯大家了。下了。 一个XX到自以为看几条均线就天下无敌的人，不想点评。 我们只相信透明的公正的东西，等你们的小基金跑赢指数时，可能牛都会吹到天上去。4个月，从来都没见你们跑赢过指数。如果不是赶上1季度的A股的上升周期，你们已经在裸泳了。不要只会天天念“感恩感恩再感恩”。忽悠的最高境界就是让别人“感恩感恩再感恩”。 当散户朋友用自己的血汗钱交出去时，付出60%的潜在赢利，我不知道这是怎样的一种信任，基金经理又是怎么样的责任。跑赢指数100%-150%,仅仅是散户自己做,跟指数持平的收益。多点理性与常识吧 赢利的60%不属于自己，亏损30%自己全额负责，任何一个有基本智商的人都知道这是一种什么样的不平等条款。包装得再美的泡泡，都经不起客观与公理的检验。任何一个有良知的人，省略N字。 请以后别再问这类问题。等于是逼我做黑脸。 时隔半年，再来看下。我并不喜欢打字。 有很多人不理解，在我的这篇文章中，为何最重要的部分是最后一部分。 基本面派的荣耀不是几个看热闹的可以理解的。 有人拿着我的N个月前的AG的点评说事，哪有任何的意义吗？基本面变了，行情就会变，我没有定期报告的义务。我的点评只是对当时的那个小阶段有效。Ag上面，我的朋友也并没有亏过钱，无需多解释。贵金属的基本面是最复杂的，其次是外汇，再次是大宗工业品，再次是股指，最单纯的是农产品。 展望国内外期市的沧桑与血腥的历史，让人感慨。 还是从基本面说起，才能对前面的所有文字做最后的总结。且看我步步分解。技术大势观也只能是基本面分析的一个辅助性的过渡。微观的技术，啥也不是。 先说，99%的期货人挂在嘴边的“趋势”吧 趋势是什么？趋势不是K线，不是均线，不是所有的技术指标。不是右侧交易，也不是左侧交易。趋势是事物发展变化的本质原因，期货趋势是基本面规律，是供求规律。趋势是“因为。。。所以。。。”的定律，不是“如果。。。那么。。。”的定律，“如果。。。那么。。。”的技术算命，最终失败的概率高到难以想象。根据本人对“如果。。。那么。。。”的交易者的统计，几乎没有成功者。 纵观国内外的期市的统治者或者说金字塔尖的交易者，几乎清一色是基本面派。巴菲特，索罗斯是技术派吗？国内的“葛，叶，田，励，林”五大天王是技术派吗？国内前10的基本面派交易者资金总量就占了国内期市保证金的半壁江山，至少400亿。实事求是的讲，不是为了打击技术派，资金总量前10的技术派还没有一个。 纵观国内外的期市书籍，介绍技术分析技术图形的书籍千万本，但是能够条理化的从供需关系，周期规律，生产特点，基本面行业规律介绍一个商品品种的书籍，我没有看到一本。明白为什么吗？所有的基于“如果。。。那么。。。”模式的技术分析与形态论都是算命，都是标准的垃圾堆。99%的技术书籍是失败者的吐槽。基本面高手，有无比的强大的自信与信念，只想默默赚钱，不会也不想向别人介绍与普及基本面知识。基本面知识的系统学习与整理，必须开自己的主观的积极的努力。基本面是知其然并知其所以然，技术是不知其然也不知其所以然，技术靠算命。John Arnold一波横推15亿美元，并让对手输掉60亿美元，靠的是算命的技术吗？ 基本面高手的人生境界与成功，不是几本垃圾堆式的技术书籍可以解释的。我可以放肆一点么？在我眼里，千万本技术书籍都不如一本《股票作手回忆录》，全球所有的技术书籍的总和也不如它。一本作手录，读通透，足以悟道与入道，再放肆一点，什么波浪，缠论之类的垃圾堆还那么多人去膜拜，让人很莫名。说真话，太难。因为读懂真话的人都高处不胜寒了。叶大户会懂我的话，葛老大也懂，但他们高处不胜寒。傅海棠是非常值得尊敬的一个人，好好去百度下他的那篇采访贴吧，一个真正说了真话的高手。那篇文章与作手录都是非常难得的，需要一个字一个字拜着读的东西。 说真话真的太难，被攻击是免不了的。我如果说95%以上比例，趋势挂嘴边的交易者，最终都是期市这个残酷的市场的韭菜与牺牲品，我一定会被一群人攻击。但这是任何人与力量无法改变的趋势。炒单派的模式基于如果。。。那么。。。模式，失败概率一定是100%。基于因为。。。所以。。。模式。。。，失败概率90%。 感慨，国内外一帮做盘着，控制媒体，终于让算命的技术登上了神坛，让追随者的数量统治了股市期市。而能够抽茧剥丝般解释行情发展唯一大方向的基本面本质被丢弃在角落少有人问津。 期货反应的是预期。你看到的是利好兑现。你提前1-2个月，低位潜伏低多会败？ 好好想想。 说下期市的本质。 期货是什么？期货是远期交割的货物或标的。 期货交易的本质是什么？ 期货交易的是未来，而不是当下。 期货交易的是未来，而不是当下。 基于当下的所有技术分析，程序等等都是算命，期货的最佳盈利模式是基于未来的基本面预期波段盈利。 我们需要从供求关系，供需规律，行业特点，经济大势等基本面本质因素去定位未来的行情，并跟随新的信息，不断跟踪分析修正观点。 再用心读一遍： 期货交易的是未来，而不是当下。 当下的折腾最终会毁灭自己。理性全面分析操作品种的基本面，相对轻仓波段推进，不折腾，不贪婪，不恐惧。 钱是坐着等来的，当下的无尽的折腾有半点意义么？ 全球金融市场，注定是基本面派一统天下。 基本面一旦定性一个品种的未来波段行情，神也无法阻止其发展趋势。阻止就意味着对抗其关联的整个产业。 基本面一旦定性，其它一切都是浮云。策略，技术，图形，资金管理，止损都是下乘，基本面正确的定性后，8成仓都是对的。 多下功夫去研究期市的本质的东西吧 那些算命的技术，真的都是垃圾堆，都是害人的毒药，没有任何积极意义。K线与均线在基本面高手眼里，唯一意义是衡量价格的相对高低。 夜深人静时，用心去拜读《股票作手回忆录》吧，传世经典，不是几本垃圾堆的技术书籍可比万一的。 利物莫的人生高度与境界，至少现在还无人可以超越，巴菲特都远远的不行。19世纪30年代是什么年代，几万美元可以买架飞机，利物莫可以在金融市场赚1亿多美元。这需要什么样的基本面气魄与素养？ 他的悲剧是整个时代的悲剧，多少国家亡国，多少将军战死沙场，动乱的年代，金融市场都崩溃了， 有几人可以独善其身。在和平盛世，让我们再次膜拜用心体会投资之神–利物莫。 读懂利物莫，足以受益终生，乃至惠及数代。 巴菲特是君子，利物莫是谦谦君子。 多少年来，一帮宵小横行国内期市，什么玩意呢？今年多少倍，明年多少倍，几个月多少倍。有意义么？ 至少以资金计算，在国内的股市期市，我没看到一个炒单的可以上得了台面。真正励志勤做基本面分析的，20亿以上的，都有一批了。强如叶大户，2000年前研究技术，搞出个名堂来了吗？2000年后，转型基本面，是什么样的成功？ 回想巴老年会时的名言，记忆犹新，有记者问他如何看待那些每年多少多少倍的短线高手时，巴老环视一周，轻轻的反问一句：你在这里看到他们了吗？ 巴老的名言，人的一生，抓住10支翻倍的股票就够了。是一生哦 期市有多少个可以确定的翻倍的，50%，30%，20%的基本面波段机会？ 在一堆堆的垃圾堆的神话故事的激励下，我们忘了我们的本心，忘了我们可以把握的确定的机会，忘了投资还有条最大的大道，在诱惑与折腾中迷失。 在我坚持基本面分析的本心可以做到不动不摇时，我再来完成以上文字，也算是对自己的一种坚定。 入期市，修心炼心，体会生活，正视自我。时间，复利，确定的基本面定性的行情，足以战胜自己，战胜市场，战胜一切可怕的对手。共勉！ 专注1-2个品种，持续的学习与研究开始。 技术大势均线可以反应“鱼身”的一段基本面，但无法抄底摸顶，基本面必须抄底摸顶的。 如果基本面大势没变，坚持定性的方向高抛或低吸，无需理会太小的事件信息。较大的事件与基本面信息，需要具体的认真分析在做决定，或多听下其行业高手的意见。 看你自己追求什么 如果你追求的仅仅是衣食无忧与单纯的财务自由，坚持日K大势均线足以。无需那么累。 如果你追求的是成为一代宗师或站在金字塔尖，必须打下坚实的基本面基础与素养。并坚持每天都看新闻，看信息资讯，条理化的搜集整理分析你需要的信息。信息资讯在信息时代，金融时代就是财富。 技术派高手是兵，充其量是将，而基本面高手则是王是帝，最次的都是帅。 追求的人生高度与财富的高度不同，选择的路也不同。 基本面派比技术派要努力太多，付出的多太多，收获自然也多很多。 技术派只能吃行情的鱼身，基本面派是鱼头鱼尾鱼身通吃。","path":"posts/20230404100634-f9d58008.html","date":"04-04","excerpt":"","tags":[{"name":"投资","slug":"投资","permalink":"http://kisma77.github.io/tags/%E6%8A%95%E8%B5%84/"}]},{"title":"数学的思维方式","text":"科学是什么？数学是什么呢？ 我们从小学、初中、高中、大学都学了许多数学，就觉得数学的内容很丰富，也很有用。 你看，咱们从主要领域、分支来讲，数学有几何学（最早的欧几里德几何，后来又有非欧几何），当然，集合还包括其他的一些派生的微分几何，或者可以把拓扑学也可以放在这个大的领域里面去。 代数学：同学们初一就学一元一次方程，开始学代数了，它跟小学的算术不一样。从方程开始，解方程，研究比如说一元高次方程有没有根，那有没有根这个问题，二次方程早就知道有求根公式能算出来。公元前1700年左右，巴比伦人事实上知道了一元二次方程的求根公式。那么三次四次方程有没有求根公式，直到公元1500年左右才解决。那谁知道五次和五次以上方程有没有求根公式？经过许多数学工作者的努力，包括拉格朗日、鲁菲尼、阿贝尔，最终有伽罗瓦完全解决，就说明五次和五次以上的一般方程是没有求根公式，或者叫不可用根式求解。 那具体的五次和五次以上方程，有没有可能用系数作为根式可解，就是它的系数经过加减乘除、乘方、开方运算能把它算出来，那么具体的五次和五次以上方程，有可能。那到底什么样的具体的五次和五次以上有可能呢？伽罗瓦他证明了五次和五次以上方程有根是可解的充分必要条件是这个方程的群是可解群。所以伽罗瓦有群论、域论，彻底解决这个问题。伽罗瓦不仅解决了这个问题，而且后来，我们称为伽罗瓦理论对数学的贡献，不仅仅在完全解决了五次和五次以上方程有没有求根公式这么一个长时间讨论的问题，更重要的是他解决了这个问题创立了理论，引起了代数学的革命性的变革，从此代数学从研究方程的根为中心的经典代数学，转为现代、进世代数学是研究代数系统。所谓代数系统就是具有代数运算的集合，研究代数系统的结构，比如说群、环、域等等，还要群之间、环之间，它们之间的映射，这个映射还要保持运算，叫态射。所以，从研究方程的根为中心，转变为研究代数系统的结构和态射为中心，这就是代数学的革命性的变革。 分析学：牛顿和莱布尼茨在1666年创立了微积分，整个分析学能够用得非常地广泛，在工程上有非常多的应用。 [[概率论]]和数理[[统计]]也是数学的一个重要分支，它处理不确定的关系。 那么这些，说明数学是什么呢？ 数学可以说是内容丰富、渊博高深，运用非常广泛的一门学科，应该是这样。 但是呢，我们就进一步要问：数学这些知识到底是怎么获取的？这些知识是怎么来的？它是不是天上掉下来的呢？大家肯定说不可能，天上掉不下馅饼，如果天上掉下馅饼，那我也坐在草地上等着天上掉馅饼，我也发明一个数学的定理。这是不可能的。那肯定就是数学家数学工作的努力。也许（有人会说）有的数学工作者他很聪明，他的脑子一蹦就蹦出来一个什么定理，一蹦就蹦出来了，其实并不是这样。表面上看好像他创立这个定理好像是他脑子里想出来的，但他也经过艰辛地探索才得到的。 所以数学知识这么高深，这么丰富，这么有用的数学知识怎么来的呢？最重要的是，他们按照数学的思维方式来获取的。 所以，今天要给同学们讲的第一课是： 数学的思维方式 数学的思维方式是一个全过程，不是某一部分。中学的时候我们听老师介绍过一些数学思想、数学方法、数学思维，比如说数形结合就是数学思想，我们做习题时一些选择题如果用数形结合，很快就做出来了，你要是一题一题的算就比较慢了。但这种说法都是个别的来说这个数学的思想、数学方法，我们说数学思维方式是一个全过程，不是某一部分、某一部分。从小就学习了数学，对数学有一些看法，比如数学的概念比较多、数学是需要证明的，而初中的平面几何要进行逻辑推理，大家对这两点比较熟悉。 这些概念怎么来的？我们不能说把概念接受了，背下来就行了。这个概念不是天上掉下来的，也不是数学家脑子里蹦出来的，它需要一定的过程。 数学的思维过程 观察 观察客观现象（包含生活中、生产活动中，以及社会上的现象，也包括已经学过、掌握了的数学知识，这些我们都把它看做客观现象），你观察客观现象，它（纷繁复杂），乱入一团麻。那在这一团乱麻前面，我们首先应该要关心什么、做什么事呢？因此，我们要提出问题。 提出要研究的问题，抓住它的主要特征（用哲学的语言叫抓主要矛盾，忽略次要矛盾）。这样一来，我们就能抽象出概念 抽象 抽象出概念，或者建立模型（数学模型，最常用的就是函数模型，如指数函数模型）。然后 探索 运用直觉，根据我们的经验，包括生活中的经验以及我们学习过的数学知识，觉得这个应该可能有什么二样的规律。 另外还有我们要解剖麻雀（就是拿一个具体例子来做，不要一下子在数学抽象的原野里奔驰，你要在具体的例子里面解剖它，麻雀虽小五脏俱全，你解剖了之后就知道很多东西）；还可以用类比，归纳（数学归纳法），还有联想（这个也很重要，在探索过程中如果联想不丰富，你始终只会一个路子走，想不到别的知识，那你就可能解决不了，所以联想很重要），探索过程中还要有推理等。 有了探索后，就会有一些发现，这个时候的发现不一定对，于是会有猜测。 猜测 可能有的规律，至于这个猜测是对是错，是真是假，一定要进行论证。 论证 （数学怎么论证呢？数学论证是用公理化的方法。什么叫公理化的方法呢？就是它）只能用公理（公理就是大家的共识，大家都共同承认的，比如欧氏几何里的两点决定一条直线，老百姓都知道的，墙上两个钉子就能拉出一条直线）、定义（就是前面说的概念，抽象的概念就是定义）、和已经证明了的命题定理，用这些来进行逻辑推理。你不能添加直观（主观）的东西。 （用陈景润的例子，再次说明）数学论证只能用公理、定义和已经证明了的定理来做，你才能证明，你不能说“显然”，那绝对不是，你说看上去就是，那也不行。所以数学论证就是这样，这样保证数学就有好处了，数学证明的东西，你可信它，你相信它，因为它真的是讲道理的，这个讲的道理就是公理，公理是大家共识的那些命题，在这个基础上往前走的。数学的公理不光是数学界，我们广大老百姓都能承认它是对的，数学证明的东西我们是可信的。 这样经过论证，进行逻辑推理和计算之后，最后 揭示出 事物的内在规律 （就变得井然有序）。 总结： 所以你看这数学思维方式，（上面这些）这就是全过程。它从纷繁复杂的客观现象观察出发，最后揭示出事物的内在规律，井然有序。比如说那数学公式，非常简练，或者得出个数学定理，非常漂亮，就是数学的思维方式的威力之所在。 上面的文字系北大丘维声教授在《科学是什么》课程上的内容摘录文字版 影像版","path":"posts/20230403234613-9b5e16cd.html","date":"04-03","excerpt":"","tags":[{"name":"认知","slug":"认知","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5/"}]},{"title":"4.03 夜盘赚了￥539，但没做好","text":"白天收盘时持有2张多单浮亏980元，晚上高开，赚了500多块钱，目前账户67394，又掉下7万来了。 棕榈最近200来天实在难做。","path":"posts/20230403230848-ed97c871.html","date":"04-03","excerpt":"","tags":[{"name":"交易","slug":"交易","permalink":"http://kisma77.github.io/tags/%E4%BA%A4%E6%98%93/"}]},{"title":"抽象，稀缺的能力","text":"2017年，智联招聘曾针对44万名应届生进行了一项职业通用能力测试（NET）测试，测试对象来自全国16个省市的200所高校，包括从中专到博士等各学历阶段的学生，覆盖12个学科专业。测试结果显示： 大专、中专及以下学历人才虽然在创新能力上与本科、硕士及以上人才并未表现出明显差异，但在言语理解、数理应用、逻辑推理、问题解决等方面的能力得分相对较低。 上述数据中体现出来的是抽象思维的差异。 关于抽象思维 提起“抽象思维”这四个字，大家并不陌生，但总觉得很遥远，其实不然。 我们小时候的数学课，就是抽象思维运用的集散地。每一个定理，每一条公式都是抽象思维的体现。它的强大之处在于只要你掌握了加法运算规则，即便从未计算过1+1，也能自信说出正确答案。 工作也是如此。抽象思维的熟练运用，是进入编程等行业的敲门砖，是中职人群从普通技工向高级工程师跃进的重要跳板，这也是抽象思维的现实意义所在。 抽象思维能力强的人，在学生时代常被夸会“举一反三”、“一点就透”；毕业进入工作岗位后，也会给领导和同事留下做事有条不紊、善于总结勤于思考的良好印象。 和这种人相处，你会惊奇地发现同样是3MB的信息，你只看到了3MB，他却能经过思考推导出30MB的信息，并把它熟练应用在解决300MB的问题上。 如电影《头号玩家》中，普通人只能成为游戏玩家，而只有极少数人才能成为游戏的设计者。电影情节固然有夸张化的艺术处理，但在可预见的未来，诸如AI人工智能、大数据等技术衍生产品将会逐渐普及。同电影一样，多数人只能成为产品的使用者，而只有少数人才能成为工具的创造者，其中的天壤之别，想必大家一目了然。 抽象思维能力强的人，很显然将更容易在未来的职场层级中，获得更高的位置。可以说，抽象思维能力是授人以渔的“渔”，是万变不离其宗的“宗”。 挖掘并培养抽象思维能力的三个方法 1、观察 面对同样的事物，我们每个人看到的东西是不同的。小说家看见故事，艺术家看见美，而抽象思维强的人，看见的是本质。想要达到这种境界，知识储备必不可少，才能犀利老道地观察到问题本质。 那我们平常该如何积累呢，一是“读书”，二是“读人”。 “读书”可以轻易窃取作者眼中的世界、思维方式，从而拓宽自己的视野；至于“读人”，则是通过双向沟通，吸收别人的观点和见闻来丰富自己。读得多了，你自然看到的比别人多，思考得比别人深。 2、提炼 对于抽象思维的训练，不能止步于观察，我们还必须提炼出言简意赅的抽象规律。 乍一看高深，实际并不难。举个有趣的例子，很多父辈都有节约的习惯，即便我们给家里打钱，父母通常也只会存起来，舍不得用来改善生活。但如果你给家里寄5000元购物卡，告知父母只有一个月有效期，花不完则作废，他们就会立刻变身月光族。 方法很聪明，但稍安勿躁，我们再进一步用抽象思维仔细思考，看看能提炼出什么：父母的行为看似有180度大转弯，但内核实际上是不变的——害怕浪费。之前是舍不得花钱怕浪费，后来是怕购物卡作废造成浪费。这个方法之所以有效，正是抓住了父母“怕浪费”这一痛点，并对其进行精准打击。 于是我们可以提炼出以下定律，劝服别人需两步： 1）换位思考挖掘对方痛点；2）围绕痛点进行劝服更易成功。 至此，我们已经提炼出了事件背后的抽象逻辑，接下来，让我们试试效果吧。 3、应用 抽象思维的神奇之处，在于你可以把提炼出的定律运用在不同场景中，它不仅能促使父母花钱改善生活，也能在商业谈判中大展拳脚。 举例 让我们来看看真实案例： 小明之前在一家软件公司任职，年初参加了一次电商后台系统开发的商业竞标。小明所在公司的报价高出竞争对手20%，根本不占优势。在竞标进入尾声的关键时刻，小明决定试试挖掘痛点思维方式： 换位思考，电商后台系统开发最大的痛点不是花钱多少，而是系统可靠性。如果系统出现故障导致崩溃或宕机，客户是绝对无法接受的。于是小明转换思路，他不再尝试与其它竞争对手展开价格战，而是转而向客户强调，自己所在公司严谨的开发流程和完善的品质管控，一定能确保系统在客流量激增的情况下也保持良好的可靠性。 果不其然，他的策略得到了客户的认可，公司顺利中标。 同样的套路，同样以痛点为突破口，却能搞定两个完全不同的问题。是不是很神奇？ 我们回过头来进行复盘，不难看出，抽象思维的强大之处在于它提炼出的规律相当于一株树干，向上可以生长出不同方向的无数枝叶，应用在各个领域。父母花钱的问题可以解决，商业谈判的问题也可以解决，二者看似毫不相干，却从相同的树干中吸取养分，运用相同的方法解决问题。 这就是“举一反三”的核心思想，也是“以不变应万变”的底层逻辑，这就是抽象思维的惊人能量——它从普通的事物中寻找规律，提炼规律，并用其解决所有相似或甚至看似不相干的问题。 大象无形，大音希声，大道至简。抽象思维，就是这个复杂的世界中化繁为简的最佳答案，而以抽象思维为代表的综合素质，则是我们从技能向技术、从重复向创造、从低端劳动向高端事业跨越的最佳途径。 个人观察 咱们中国较偏重于形象思维。我们从启蒙阶段开始，就会接触到大量运用形象类比手法的文章和人物，比如较为简单的古诗词，中国寓言和成语故事等。而在小学阶段的学习中，形象思维的培养和训练更多。例如，大量形声字的教学法、描写类作文的学习等等，抽象思维在中国低年级教学中占比相对较少。 进入中学阶段，随着数学、物理等科目的开设或深入，逻辑、计算等抽象思维的锻炼逐步增多。因为形象思维和抽象思维的差异，很多学生也会感到突然而来的不适应，课堂上听不懂，作业题不会做，从而可能形成学习成绩的分层。而在欧美等西方国家，则偏重于抽象思维。在古希腊时期，逻辑学就十分发达，后来的三段论等推理的理念，也成为西方人思维模式的重要组成部分。同时，西方人的抽象思维也体现在对事物的定义上，较之于比较宏观的、描述性的形象思维而言，抽象思维更多聚焦于微观、概括或概念。 这是文化上的差异，各有所长。 比如我们很多人数学不好，这就是抽象思维差点事，要在理科学习上通透，需要整体思维能力的出色。 上述思维能力，相互影响，构成了我们思维体系。 我们的人生，有三件事情： 感受世界 理解世界 改变世界 对这三件事情，对应着三种类型的思维能力： 感受世界 =&gt; 形象思维（关注经验、直觉、感受，注重建立经验、形象化的意识和能力，产生听觉、视觉、触觉、动感等） 理解世界 =&gt; 抽象思维（从形象层面升级，产生抽象概念、模型，理解形象背后的抽象规律） 改变世界 =&gt; 创新思维（打破常规、创造出新事物、新观念、新科技） 这三种类型的思维能力，阐述了能力问题。然而，为什么人们要去感受、去理解、去改变？ 这就涉及到动机问题。 人的内在驱动力，跟主动思维的关系密切。强烈的好奇心、探索欲、追求卓越的精神、高度责任感，这些往往都是高度主动心态的产物。 没有高度主动的思维，那么就容易停留于表面，被动的接受现状、服从安排。比如老师叫做什么就做什么，不会就死记硬背，缺乏深入学习、思考的动机。 我们看学习顶尖的人，往往他们主动性强，不是因为「老师、爸妈让我学习」，而是自己就想要学习爱学习。 他们也有自己的学习思路、打法、规划，不会盲目遵循老师、学校的安排。 他们不满足于答案，而是会提出各种问题、去探索研究。 这些，都是高度主动性的体现。 三个层次的抽象思维 在抽象思维的范畴，又有三种思维： 逻辑思维（一元思维） 辩证思维（二元思维） 整体思维（多元思维） 一个常见的误区是，把「逻辑思维」等同于「抽象思维」。 真正顶尖的抽象思考、把握本质的能力，是需要上述三者的共同作用。 我见到一些顶尖高校的同学，他们都是经过严格的筛选进入一流学校的，逻辑思考能力不错。但是缺乏大局观，容易钻牛角尖。 单从他们的那个逻辑链条看吧，未必有问题，推理链条严谨；但整体思维欠缺，难以把握整体形势，最后还是搞不定。 这背后是整体思维、辩证思维的缺失。 形象思维不过关，是理科学习的普遍瓶颈 形象思维能力，包含两部分内容： 意识层面：关注重视生动、具体、直观（形象化）的经验和感受 能力层面：善于捕捉、获取、创造生动直观具体（形象化）的经验和感受 一个普遍的迷思是，大多数人认为，中学数理化成绩不佳，是逻辑思维差，因此导致理解水平不够。 其实中学数理化，从高考的角度来看，对学生逻辑思考能力的要求并不高。 例如数学 135 水平，需要的逻辑能力，是大多数同学经过基本训练，没有特殊难度就足够的。 中学理科学不好，首先遇到的瓶颈不是逻辑思维，而是形象思维。 作为自然界的高等级兵种，人类这种生物进化出来了独特的功能：大脑。而基于大脑，我们又产生了特殊的能力：创造和理解各种抽象语言。例如文字、数学公式，都是从现实中抽象出来的语言。 抽象思维，是大脑的功能。 然而，要让抽象思维工作，我们往往还需要具体的体验、感受，而这就需要依靠生物的原始功能：视觉、触觉、味觉等。 在理解世界之前，我们先要感受世界。 理解能力跟抽象思维密切相关，而感受能力则跟形象思维密切相关。 数学常常是学渣的噩梦，其中一个原因就是数学本身是高度抽象的，我们看到各种公式符号也许连基本的意思都没搞懂，更别说他们背后的意义，与现实的关联。 所以在大脑中，没有与这些抽象语言对应的基本体验，也就谈不上理解和掌控。甚至反过来，久而久之就产生恐惧感。 而形象思维水平高的人，会主动的寻求建立形象化。 本书前面谈到，上个世纪，有位全国特级教师马芯兰，她在小学数学教育方面卓有成效，经验总结为了“马芯兰教学法”。她的实践中，就包含强烈的形象思维。 举个例子，今天我们对 111 这个数字中，三个 1 所代表的不同含义，已经很清楚了。但是想想你作为一个几岁的小朋友，在最开始接触到数学进位制计数法是，会很容易搞清楚十位上的 1 还是个位上的 1 有什么区别吗？ 为了帮助学生建立直观的概念，马芯兰设计了一些滚筒，把它们排成一行。最右边的代表个位，然后是十位、百位… 然后用小棍子代表 1，放到个位筒里。当有 10 个棍子的时候，就把它们困成一扎，放到十位筒里。这样一来，就直观表示了十位筒的「1」和个位上的「1」的差别。让学生对于进位制有了直观的认识，从而在符号语言与具体感觉上，建立起了桥梁。 而其实只要对进位的理解突破，小学前三年级，基本上也就是一路平川了。 有个基本的数学思维叫数形结合，背后也蕴含着形象思维的理念。 所以「数形结合」，在学习数学中是一条基本的指导原则。它其实就是形象化思维，在数学学习科目中具体应用。 对于形象思维能力出色的人，他们遇到抽象概念，本能就会去建立直观经验、感觉联系。 但大多数人并没有这种形象思维的基本意识，所以他们会接受概念和感官脱节的状况，生硬的记忆套用，而不去寻求解决形象体验、直觉问题。 巧妇难为无米之炊，缺乏形象直观的经验、感觉作为基础，你的抽象思考引擎是开动不起来的。 再比如物理，很多时候同学其实卡在一个地方，就是难以把文字描述，转化一个头脑中可以理解的生动场景，例如物体运动的具体情境。 在中学学习中，我们也可以经常看到，一些日常生活中被认为是头脑聪明、思考敏捷的同学，也卡在数理科目上。 往往他们形象化这一步就没过去。","path":"posts/20230403215118-89250134.html","date":"04-03","excerpt":"","tags":[{"name":"认知","slug":"认知","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5/"}]},{"title":"4.03 又犯了“摊平”之错","text":"今天收盘时，落袋盈利980-31=949元 账户浮亏980元。 我又犯了“摊平”之错，具体是这样的： 周五夜盘我将多单早早平了，今早开盘就飙高，追上时回落了，其后我犯了“摊平亏损”的错。 心理关很难过。","path":"posts/20230403143417-aeee92ef.html","date":"04-03","excerpt":"","tags":[{"name":"交易","slug":"交易","permalink":"http://kisma77.github.io/tags/%E4%BA%A4%E6%98%93/"}]},{"title":"如何通过学习心理学进行自我迭代？","text":"今天在知乎看到一个问题：如何通过心理学学习来提升自我？这个问题我觉得应该改为“如何通过学习心理学进行自我迭代？” 这事我干过，并且在成功的路上… 不过，要先从另一个话题聊起， 人能不能在短时间内养成新的习惯。 这个问题，大家都希望回答是可以，而且最好有明确的方法。可惜真相是包括你我在内的绝大多数人，基本上做不到，而且抱有短期蜕变的念头，对实现目标往往有百害而无一益。 我不是在散播悲观情绪，只要你对认知科学稍有涉猎，就会得出相同的结论。这篇文字，我想先从改变的生理学本质说起，这有助于你理解改变为什么总是困难的。然后，我会聊一些改变过程中人们经常遭遇的困局，比如为什么总感不到自己的进步？决心和计划为什么短期就失效？自我批评为什么失效？……虽然我也会简单的给出解决办法，但我想把重心放在它们的成因上。毕竟市面上教你改变的药方很多，但剖析病因的却很少，如果你事先知道会在哪里跌倒，就能更好的避开这些坑，不是吗？ 就从“改变”本身说起吧！ 一.改变的本质 前人吐槽过，励志书籍都是一个套路：“[[改变]]了心态，就改变了思维，就改变了[[行动]]，就改变了人生” 但无论是思维模式还是行为习惯，本质上都是个生理过程——行为和心理其实是由你大脑里的神经系统决定的，不同的神经元在大脑里的连接形成了各种神经通路，它们的工作方式类似自然界里的河流：人类的惯性是使用已有的神经通路，就如同水总是沿着已有的河道流动，用进废退，使用的越多，河道越宽，不被使用的则慢慢退化。 神经可塑性正是一切改变的基础——大到你掌握一门外语，小到你学会一首新歌，都是在大脑里构建新的神经通路。回想你是怎么学会一首歌的：先把它分成若干小节，一段一段的唱熟之后再把它们串起来，期间发出每个音节时，声带、舌头、口腔肌肉、呼吸系统该如何协调，背后都是神经信号的流动。这就仿佛在修一座大桥，先把一截截的桥段修起来，再将它们合龙，之后我们的神经信号就可以畅通无阻的从这头畅游到那一头，你就能完整的唱出一首歌曲。 建立新的思维和行为习惯跟上述过程没有本质不同，你需要大量的重复训练来保证新的神经元不断生长，直到神经通路足够宽，足够强健——就像巴甫洛夫训练那只狗一样。人类发达的大脑中，数百亿的神经元交织成密密麻麻的网络，除了出生时自带的各种本能，后天的环境和经历帮助新的神经通路不断形成，让我们得以站在生物链的顶端。 而改变，不仅意味着构建新的神经通路，还意味与过往的惯性做斗争——这需要你在神经冲动的源头改变它的流向，生生在大脑中辟出一条新的河道。你不仅要时刻清醒自己现在要做什么，还要抵御过往的惯性，稍不留神就会走上老路，这是一场持久的拉锯战，任何改变成功过的人都知道这绝不轻松，稍不留意，就会陷入各种陷阱，导致改变失败。 二.为什么改变如此难 一千个读者就有一千个哈姆雷特，然而在“改变”这款大型沙盒生存游戏中，一千个玩家可能只有几种常见的死法。作为资深玩家，我根据自身的经历和观察总结了四种，容我一一道来： 1.长期缺乏成就感 迫切寻求改变的人，往往长期感觉不到自己的进展，处于成就感匮乏的状态，直接结果就是不断袭来的自我怀疑。造成这种现象的一大原因是他们不擅长将目标具象化，也不擅长将目标分解： 目标分解 “我要挣很多钱”，很多是多少？如果你是上班族，对应的月薪目标是多少？如果你是开淘宝的，对应的月销售额应该是多少？ “我要练好英语”，什么程度才算好？你是要用英语进行阅读、写作还是口语交流？你的词汇量要有多少？语法要掌握到什么程度？ “我要练出好身材”，你减到多少斤？打算用多久完成这个目标？为此你每周要做几次运动？每天的饮食应该如何安排？ 缺乏清晰的、可以达成的目标，意味着在公路上行驶却没有路标，你永远不知道自己离终点还有多少公里。有多少人在长期没有进步的情况下还能坚持自己的计划？ 还有一部分人的情况更为糟糕，他们“负债在身”，在做出正向改变的同时，还要为之前的错误买单，知友@陈诺 对此有过精彩论述： 在做出正向改变的同时，还要为之前的错误买单 大学三年都用来玩电脑睡懒觉的人，大四时决定好好念书。打开书本，他面对的不仅仅是这三年懈怠遗留下来的落后，更有对这三年浪费时间的悔恨和自责。不管他自我改造的意愿有多么值得嘉奖，他需要面对的一个事实就是，他必须用旷日持久的努力将前面的空缺补上，才能有新的建树，而且这建树会比周围早就在按部就班努力的人来得晚，来得艰难，甚至来不及。他必须在很长一段时期里放弃自己过往的成就感来源（暴饮暴食，电脑游戏，和失败者抱团的无用社交等）来适应新的模式，并且长期得不到新模式给予的回报。而这种对长期决策的执行力和忍耐力，往往又是惯于追求短期回报的人所不擅长的。 长期没有进展，不断的自我怀疑，结果就是过度的压力。 2.压力过度和唾手可得的即时满足感 压力的来源是多样的：自身的不安现状、校园和职场上的竞争、父母和亲人的期待、买房买车的需求……适度的压力能迫使人们聚精会神，尽快完成任务。而一旦压力过度，带来的往往是拖延和逃避。 过度的压力下，大脑会释放大量的多巴胺，这是一种神经递质，它会劫持你的注意力，让你迫不及待的想要放松，想要找点乐子。而在这个屏幕泛滥的时代，获得即时满足感的成本前所未有的低廉：玩不够的各色单机、网络游戏；看不完的剧集、电影和视频，以及永远下拉不到尽头的微博和朋友圈…… 更糟糕的是，大脑中有专门的模块负责给行为做出合理化解释，它会在你放松享乐时为你编造冠冕堂皇的理由：“时间还早呢，我先放松一会儿，马上就开始学习/工作”，“今天都忙了一天了，晚上就放松一会儿吧，明天再干还不是一样”……让你心安理得的继续这一切。 就这样， 我们乐此不疲的搜索再搜索、 刷新再刷新、点击再点击。等你回过神来，只剩下一无所获的空虚和浪费时间的悔恨。 3.顿悟和三分半钟的热血 关于改变，人们还有一个最大的幻想，就是“一夕顿悟，得道升天”——某些时刻，可能是读了篇精彩的文章，或是聆听了前辈高人的教诲，又或是被身边的人或事触动，我们会顿悟，仿佛参破了束缚自己潜力的症结，获得了无穷的动力，于是定下宏伟的计划，决意改写自己的人生。然而结局往往如乔纳森·海特在《象与骑象人》所写： 如果你的人生曾有过那灵光一闪的片刻，并下定决心改变自己的人生方向，那么你可能会发现，三个月后，你又回到原点。顿悟可以改变人生，但大部分最后都只是镜花水月，只有几天或几星期的热度。 如果你中枪了，别担心，这是大家的通病：人的记忆包含短时记忆和长时记忆，简单的说，前者好比内存，后者好比硬盘——关机或者重启后，内存里的数据不复存在，而存入硬盘里的才会真正被保存。绝大部分的顿悟都是短时记忆，如果没有长期的行动来强化和巩固，它就不会变成长时记忆留下来，而你的思维和行为模式也不会有什么根本改变。 同时，**“下决心”产生的是另一类典型的即时满足感。**我们最容易做出“我要改变”这一决定的时候，往往是处于低谷的时候。发誓改变让人重新拥有放松感和控制感。想象中，改变后的自己越光芒万丈，我们获得的愉悦感越强——既然做出宏大的计划能让自己更爽，为什么还要去定下那些毫不激动人心的小目标呢？ 然而当你真的开始行动时，现实会给你当头一棒：想象自己拥有动人的身材很容易，去跑步机上跑个半小时很难；想象拿到 dream school 的 offer 很容易，早起背几百个 GRE 单词很难；想象自己升职加薪很容易，拿出新项目的工作方案很难……**改变意味着要走出自己的舒适区，这一定会遭受阻力和痛苦，而今天的你和昨天并无本质不同。**大多数人会在这些痛苦前放弃，即使那些克服的人，他们达成的进步在原有的雄心前也显得微不足道，因此目标越宏大的人，越容易在长征的第一步倒下。 而失败会引发对之前决心和计划的怀疑，“明明前几天已经想明白了，为什么还是做不到？”，“我的决心已经很强烈了啊，是不是我这个人不行？”，这样的过程循环几遍，很多人会陷入“习得性无助”，不敢再做计划，甚至连改变的决心都不敢下，四肢一摊倒在地上，任由悲观将自己卷入绝望的漩涡中。 4.“我是不是对自己不够狠？” “对自己狠”有两种表现形式，一种是定下难以达成的目标，比如一个从不锻炼的人决定从明天开始每天跑步10公里，这是之前已经讨论过的恶性循环开端。 另一种表现是在计划或行为失败后，试图通过严厉的自我批评来教育自己：“你实在是太垃圾了，连这点挑战都完成不了，”、“你真的太懒了，你让自己和大家都失望了”……任何自我谅解的念头都会被视为对自己放松要求，我们普遍觉得内心要有一个严厉的执法者，在自己松懈的时候用无情的痛斥，这样才能抵御人性的懒惰和懦弱。 尽管上述情况是人之常情，但大量的心理学研究已经证实：**情绪低落下的自我批评会耗尽你最后的意志力，带来压力，甚至导致抑郁。**而你应该记得，此时的压力最容易让人寻求即时刺激，进入“破罐子破摔”的状态——“算了今晚已经这样了，状态又不好，就继续玩一晚上又怎么样呢？”、“计划已经完不成了，今天就放松一下，明天再说吧”……这样的念头一再上演，而明天多半又是重复今天的故事而已。 上述几种困局总是互为因果，狼狈为奸，坑杀了一批又一批想要自我革命的仁人志士。你问我怎么办？这些坑我一个都没避开，我能怎么办？我也很绝望啊！ 当然，说笑归说笑，有病症就自然有药方。 三.不对症的药方 其实上面说的那几个坑，你知道症状、知道病因，解药也就呼之欲出：要学会量化和分解目标，用健康的方式舒缓压力，有心的话自己就能找到不少教你怎么做的干货；至于顿悟、决心，还有如何用自我谅解取代自我批评，我也会推荐相关的书籍和文章。除此之外，我想说两点客观现实，大多数人对它们缺乏足够的认识，接受它们能让你改变的道路少很多波折： 1.懒惰、好逸恶劳是人类的本能 我不是罗永浩的粉丝，但我尤爱他给自己打鸡血学英语的故事，其中有这么一段自白： 我和所有人一样，都是懒惰的、容易放弃的、坚持不下去的、没有毅力的。所有人都是这样，这个你也不用感到自卑，因为我们从基因上就是被设计成这样的。 心理学的研究证实了这个结论。准确的说，人的自我是分裂的，人类既有先天的动物本能，让你在美味的零食前垂涎欲滴，在漂亮的异性前心跳加速，在好玩的游戏前蠢蠢欲动；人类又有后天进化出的理智模块，让你能够衡量局势，为长期目标放弃眼前的享乐。前者像是大象，后者像是象背上的骑手，只有在大象没有欲望时，骑手才能轻易的控制大象，否则骑手是斗不过大象的。 每个人都有“我明知道该做什么，可身体就是不听使唤”的体会，很多人把原因归咎于自己的懒惰和意志力薄弱，他们没有意识到大象和骑手都是自身的一部分——你没有办法同欲望本身作斗争，也不要因为这些去苛求、痛恨自己，那是我们的本能。聪明的骑手会摸清大象的习性，学会与大象共处，并且驯化它。 ![[Pasted image 20221110210110.png]] 2.改变是一个困难的过程 其实整篇文章都在讲这一点，我只是想再强调一遍：**改变无法一蹴而就，有困难就会有痛苦，有过程就会有拉锯和反复，就会有一次次的放弃和重新开始。**如果你能更深刻的体会它，就能用更平和的心态去正视改变途中的沮丧和自我怀疑，你需要的只是平静下来，自我谅解然后重振旗鼓。 后记：关于逆袭的故事 人们喜爱故事，尤爱弱者经历重重磨练变成强者的故事。 平凡懵懂、甚至浑浑噩噩的主人公，突然遭遇了人生的重大打击：或家道中落、或爱侣分别、或至亲离世、或生死大劫……在巨大的悲痛或震惊下一夕顿悟，从此三观尽改，洗心革面，迸发出了惊人的斗志和毅力，历经千辛万苦，终于构建出了自己的美好生活，可以笑看过去的起落沉浮。 我不是要吐槽这类故事，我相信它们中很多是真的，能给人激励和希望，让本已绝望的人又有了奋斗下去的动力。 但这类故事流传的太泛滥后，会给人一种错觉：“我之所以不够厉害，是不是因为我遭遇的挫折还不够大，我经历的磨难还不够多？是不是我对自己还不够狠？” 巨大的困境和挫折的确可能令人蜕变，但更多时候是给人毁灭性的打击，让人陷入恶性循环并且无法自拔。而试图对自己狠一些的下场，我们已经探讨过，往往不怎么样。 对于大多数人，合理的改变应该是循序渐进的，它们也许只是生活中一些毫不起眼的细节：决定早睡早起的你，夜里爬上床掏出手机，犹豫了一会，还是选择了关机并把它扔到了枕底；决定减肥的你，路过甜品店的门口，踯躅片刻，还是一咬牙快步走了过去；决定好好备考的你，坐到桌前打开电脑，纠结再三，还是忍住了点开新剧集的冲动，断开了网络连接，打开了复习的PPT。 是的，这些可能不是你想要的那种改变，毕竟它们一点都不轰轰烈烈、一点都不激动人心。但不要小看它们，这些小小的挑战日复一日的出现在你生活的各个瞬间，做到一两次并不难，难的是坚持，一次的松懈很可能成为下一次放纵的借口，让你尚未坚固的习惯毁于一旦。而反过来想，如果你连这样的小事都未曾做好过，你又何来的底气去立下惊人的誓言呢？ 当然，有抱负和志气总是好的，用高一点的目标和严苛一点的环境来倒逼自己，最大限度的激发自己的潜力，不失为一种改变的手段，结果取决于你对目标有多渴望、行动的方法是否正确、能多大限度排除外界的干扰以及能坚持多久。过犹不及，希望这篇文字能帮你更了解自己，对上面这些做出更合理的判断。 最后，扯点个人感悟，纯属一家之言，没有科学依据，仅供参考 : ) 很多人改变的初衷来自于外部的刺激：心仪的对象嫌你条件不好弃你而去，昔日的同窗已经事业有成衣锦还乡，过年回家看到爸妈头上又添几许白发……这些可以作为最初的火种，但并不足以支撑你的整个旅程——也许很久以后，你终于达成目标，但当年的情愫早已淡忘，当初追求的姑娘只能在心中荡起浅浅的涟漪；同窗的事业攀升到了另一个层次，你清楚自己再也追赶不上；而父母从未奢求你大富大贵，他们更在乎你身体是否健康，平时过的是否开心。那个时候，你会不会略带疑惑的问自己：“我这些年做出的改变，是为了向谁证明什么吗？” 我想不是的，改变不是为了炫耀、拿去比较或是向他人证明什么。很多改变，诸如早睡早起不再熬夜、戒烟戒酒开始健康饮食，除了偶然被友人发现时能获得几句嘉许，也并不足以让你走上人生巅峰。那我们为什么还是要做这些事情呢？因为改变是我们自己的事情，是作用于自身的善举，我们不堪忍受庸碌的自己，不想日复一日的看着同样的风景，我们想知道自己可以爬多高，走多远，想看到更多的可能性。即使越过山丘，发现无人等候，而山的那边还是无穷无尽的山，我们还是义无反顾的继续攀爬——成为更好的自己，才是改变最大的动力，也是对自己最好的奖励。 未完待续","path":"posts/20230403142955-e13acb3e.html","date":"04-03","excerpt":"","tags":[{"name":"心理学","slug":"心理学","permalink":"http://kisma77.github.io/tags/%E5%BF%83%E7%90%86%E5%AD%A6/"},{"name":"改变","slug":"改变","permalink":"http://kisma77.github.io/tags/%E6%94%B9%E5%8F%98/"}]},{"title":"希腊科学的内在演绎特征","text":"文章：希腊科学的内在演绎特征 亚里士多德在《形而上学》第一卷中，区分了经验、技艺、知识（科学）的不同。他认为：低等动物有感觉，高等动物除了感觉外还有记忆，从记忆中可以生成经验，从经验中可以造就技艺。经验是关于个别事物的知识，技艺是关于普遍事物的知识。技艺高于经验，经验只知其然而不知其所以然，技艺知其然而又知其所以然。技艺者比经验者要有智慧，懂得更多。 这便是我们通常熟悉的二个知识类型—经验知识和理论知识。理论知识来自于经验知识，是把经验知识概括、总结、归纳、一般化后，形成的知识。理论知识会再用于经验之中，通过经验来检验、优化，从经验中来到经验中去，实践—认识—再实践—再认识，循环往复，不断提高，这是我们耳熟能详的马克思主义认识论体系。 然而，亚里士多德认为除了以上二类知识外，还有第三类知识即科学，它是最高级的知识。前二类知识都有实用目的，技艺者是为生活之必需，有功利成份，只有仅为消磨时光、无用的技艺才是科学。第三类知识的特点不为别的目而存在，只为自身，这是自由的知识。希腊人认为，自由的知识和确定性知识是等同的，为什么？有用的知识不是确定性的，它对这件事有用，对另一件事就不一定有用，自由的知识为了自身而存在，可以看成永恒的、绝对的、确定性的。希腊人认为：眼睛看见的是流变的世界，是不确定的，是现象，不是本质，现象背后那个主导着它而本身又不变的内核，才是本质世界。希腊文化一开始，就着眼于永恒性，确定性，不变性，不变是高级的，变化是假象。 第三类知识是无用的知识，任何知识你强调它有用，就是贬低它，把它变成手段，只有知识本身无用，才能够真正做到自由。无用的知识是什么，它是一种内在性知识，一种自我推演、自我演绎的知识。它是论证的、证明的，目的是服务于自由的需要。无用的知识怎么建构？不来自实践经验中，不是经验科学，而是超经验科学。唯一的构建法是演绎法。 演绎的知识是确定性知识的典范。它主动截断了与经验的联系，通过内在推演，自己推演自己。演绎的知识能超经验，保持它的独立自主性，因为它是形式化的。为什么形式化的知识才具有超经验性？因为它像是“废话”，公理、公设都像是“废话”，恰恰是这些形式化的东西，与经验保持一定的距离，可以做到永远正确。演绎推理能够保真，经验推理是不能保真的，这是希腊人特别追求演绎性知识的一个重要原因。自由的学问是纯粹的学问，不受实利所制约，而演绎科学正好符合这一“自由”的原则，正是希腊人开辟了演绎和推理的传统。 推理是把事物包含的内在性展开而已，演绎是把一个卷轴展开的意思。希腊人民对世界的一个贡献：从表面看起来的废话、纯粹无用的概念出发，通过推理和演绎，奠定了我们这个世界的基础，这个基础就是理性。希腊通过自我推演的方式展开了一个理性世界，这个世界是根据自己的规则来推演的。现实中具体的物件是流变的，不具备确定性、不能永存，而从概念、定义、理念之中，推理演绎出来的知识，是纯粹的知识、确定性的知识、永恒的知识。逻辑学要说明道理是一种普遍的存在，不依赖于当下的条件。把道理讲通、讲透是对理性行为的一种尊重，理性是真理的自我推演。 希腊人高标特立强调知识是无用的，越无用越自由，只有无用的知识才是为自身而存在的知识。有用的知识很可能会把自身消耗在应用之中，用完之后就没用了，就失传了。为了把知识搞成无用，只有从“废话”开始。没有对“废话”的执着，就没有我们今天称之为演绎的科学。二千多年前，希腊人欧几里得的《几何原本》就是个典范。它从点、线、面等23个定义的基本概念出发，从像是“废话”的公理、公设开始，比如：公理1，等于等量的量彼此相等；公设1，从一点到另一点必可引直线，等等“废话”，经过严密的推理演绎，把当时所知的平面几何学知识全部推导出来，推出来的定理，共有467条之多！二千多年以来，《几何原本》一直被全世界各国选为平面几何学的重要参考教材，它是演绎知识永恒性，确定性，不变性的一个佐证！ 自由的知识一定需要是形式化的、超经验的、永恒不变的。这样的知识才是纯粹的、绝对的、理性的知识。理性的基本含义是内在性，应有一种超出当下条件的超越性。道理常常和现实有矛盾，但道理应该超过现实，在不同时间、空间，不同人际环境中都成立。现实不是这样，所以才有理想和现实的冲突。希腊人特别强调理想这部分，强调道理这部分。道理靠什么构造自己呢？内在构造，自己构造自己，道理不依赖空间、时间和现实条件。道理是自己说了算，自己决定自己，自己为自己开辟道路，自己推出自己，这就是希腊人为人类贡献的一类新型知识——理性知识，主要包括：形式逻辑、演绎数学、体系哲学。 以上文字转载自希腊科学的内在演绎特征,本人对“几何大厦”的图做了重画，以清晰化。 阅读心得 读完本文，我有了一个“知识分类”的认知，即 知识可以分为三类 第一类为：经验知识 经验是关于个别事物的知识，技艺是关于普遍事物的知识。是人们在生产实践中通过观察、总结得出的可行性总结。 第二类为：理论知识 理论知识来自于经验知识，是把经验知识概括、总结、归纳、一般化后，形成的知识。理论知识会再用于经验之中，通过经验来检验、优化，从经验中来到经验中去，实践—认识—再实践—再认识，循环往复，不断提高，这是我们耳熟能详的马克思主义认识论体系。 第三类：科学知识 第三类知识的特点不为别的目而存在，只为自身，这是自由的知识，是一种内在性知识，一种自我推演、自我演绎的知识。 它是论证的、证明的，目的是服务于自由的需要，构建法是演绎法。 前二类知识都有实用目的，技艺者是为生活之必需，有功利成份，只有仅为消磨时光、无用的技艺才是科学。 知识={经验知识、理论知识、科学知识}， 其中 有用的知识：{经验知识、理论知识} 没用的知识：{科学知识}。 此“没用”表示的是“无功利成份”，并不是彼“没用”、“无用”。 我理解的不一定对，可能错了，但这个“分类”我很喜欢。许多人读了大学，认为“学的知识没有用”也正是由于他不懂这个分类。 对于（国内）学生来说，理论知识的用就是“在规定的时间内高效率答对试卷上的那些题”，这样才能取得高分。出了校门，工作后没有“试卷”了，学过的那些知识的“用法”要改变了，即要转变思维，让学过的知识与实际工作中遇到的问题产生关联，将知识的思想带入工作中解决问题——这里的问题如同上学时试卷上的问题。","path":"posts/20230403104314-9d3a6454.html","date":"04-03","excerpt":"","tags":[{"name":"知识","slug":"知识","permalink":"http://kisma77.github.io/tags/%E7%9F%A5%E8%AF%86/"}]},{"title":"4.02 去姐姐家蹭饭，及人生路的关键几步","text":"姐夫因家中亲人病危，和他爸妈回老家了，姐姐呢因公要去天津大学学习一周，家里俩孩子没人看护，邀请了岳父岳母过来照看，我和媳妇就打算过去蹭饭，反正也近，仅隔着一个小区。 早上我俩睡到8:40才起床，起来后吃吃早餐老婆就催着要去姐家，我说不着急，去那么早干嘛，后来到了10点多催的次数多了我们就出发，10分钟就走到了。 走在路上时，我突然想到老婆这么早就想着要来，是因为她想见自己的妈妈，这方面我确实没有她这么强烈，我和母亲没见面已经好几年了，前两年本来想着回老家过年，但因为疫情就一直没能回去。 我也挺想母亲的，现在每个礼拜打打电话，平时就在监控里看看她老人家。 去姐姐家蹭饭吃到好吃但不知名的食材 中午吃的很开心，我不知道是什么食材，是这样的，是下面这样的。 加入面粉 看《人生之路》得一金句 吃完饭后我俩就回来了，本来是看电影的，但看了10分钟我俩都困了，就睡了一个午觉，一觉睡到17:00左右，醒来看《人生之路》电视剧，对立面那个黄部长（剧中黄亚萍的父亲）对女儿黄亚萍说的一句话记忆犹新，他说：“有位作家说过，人生的道路虽然漫长，但紧要处常常只有几步。” 《人生之路》这部电视剧是改编自路遥的小说《人生》，小说的扉页上有句话：“人生的道路虽然漫长，但紧要处常常只有几步。” ” 确实，人生的道路虽然漫长，但要紧处常常只有几步，特别是当人年轻的时候。我也是在学习了随机过程等课后才知道Ω、随机场等知识后想明白的，我们没有一个人的生活道路是“直达”的，都有很多岔路口，有些岔路口只要走错一步，可以影响人生的一个时期，这个时期可能是三五年，也有可能是一二十年，甚至是影响人生。这些“关键的几步”要是走对了，就在赢面较大的概率域或者“场”里面了，搭上优势“传送带”，较省力，甚至是快速实现美好人生。比如十多二十年前买了房的人，像我的姐姐，她们当时首付不到20万买的房子，现在市值1000多万了。还有千千万万个姐姐家这样的家庭，他们并不懂投资，但因为这样那样的原因“走对了”买房的那一步，后面就好过多了，同样，也有成千上万个像我这样的家庭，当初由于各种原因错过买房的“关键一步”，随着居住成本的提高，生活变得越发的艰难。 有时，我一想到孩子要出生了，而我还没有钱买房子，他将来上小学怎么办，我就焦虑得睡不着！ 人生路，真的就是关键的几步，真需要规划的，我的成长过程中父母没有在这方面给予我任何帮助，他们都是老实巴交的农民，我希望以后能在这方面给儿子（点点）一些有价值的帮助，为此我还学习类似如何做计划这样的知识。 我想象中的“路”是这样的， 但不美观，网上借用一下，但还是不是我想要的图 最后，测试一下外链图片和路过图床","path":"posts/20230402231356-ac1fba5f.html","date":"04-02","excerpt":"","tags":[{"name":"人生选择","slug":"人生选择","permalink":"http://kisma77.github.io/tags/%E4%BA%BA%E7%94%9F%E9%80%89%E6%8B%A9/"}]},{"title":"谈“做计划”","text":"做事得有计划，但问题在于知道并掌握做计划所必要的技术准备，如若不然，会以为做计划只是在大脑里把步骤设想一下写下来，或者干脆就是把自己的愿望分解一下，这不能叫“计划”。 很遗憾，我一直不会做计划，导致即使赶上了“改开”的黄金期，到目前这岁数了却把生活过得稀烂。 做事应遵循“向优秀者学习”的原则 做事情应当遵循或者说必须要有一个基本的原则：向该领域内最厉害的人学习。 想要学什么，就要从对这件事最上心、做得最好、做不好就会饿肚子 / 会死的那些人身上去学。其次是从成绩最好的好手那里去学。没人教你，你也应该去这些地方寻求启示。 那么这个世界上，谁对计划最在乎，做不成的损失最大呢？ 军队。军队设计的计划执行不了，那是要尸山血海、丧权辱国甚至亡国灭种的。 谁是计划执行得最好、最完美的呢？ 实验室。实验室设计的实验计划要是有逻辑漏洞或者执行困难，等于是几年时间、人力、经费全部打水漂。实验室里是一群知识精英，他们当然会竭尽全力避免这种最大的失败。 什么叫好的计划？军队和实验室是两个最好的观察窗口。 那么这两家为什么制定的计划就更容易成功呢？请你们仔细想一下。 凭什么他们两家就能相信自己的计划够可靠？他们的原则非常简单——计划必须是对已知可靠要素的综合运用。 他们在做计划之前，先做了大量的工作使得计划拥有足够结实的“砖块”。对于军队来说，就是训练、测试、训练、再测试，直到获得某个战术动作的充分可靠数据。一切的计划，都是建立在对这个战术动作的数据可靠性基础上的。 一个师有多少个人力？多强的机动性？有多少油料？多少弹药？多强的火力输出能力？多强的生存力？军队能做计划，是以规范训练为基础的。他们假定这个师在六小时内可以进入空中机动状态，是因为这个师每个月、每个季度都在为六小时内打包全部装备人员登机做训练。一遍又一遍、一轮又一轮。训练、测试、训练、测试。 冷天试、热天试、大风天试、大雨天试、大雪天试。是因为这个，总参谋部才能做出“假设的人从某处登岸，我们将在六小时内调动三个师进入xx阵地进行侧翼牵制”这样的计划。 这计划能行，是有足够坚实的“砖块”。 看到问题所在了吗？ 计划如果不是由千锤百炼的SOP[1]构建而成，是谈不上可靠性的。 计划的可靠性，完全是由计划关键路径[2]上的步骤的可靠性的乘积决定。 假设一个计划由六个任务组成其中四个任务在关键路径上，且它们每个的准时可能性是80%，那么计划准时交付的可能性就是0.8^4 = 40.96%。有六成机会会延迟交付。 如果这四个步骤是像军队训练那样由千锤百炼的sop组成的呢？那么这种风雨无阻日练夜练反复测试的sop，就可以保证95%以上的可靠性。 更准确的说，同志们，现代商业实践的要求是六西格玛的可靠性。 这是什么意思？只允许百万分之三点四的失误。 这样，有两千多个六西格玛SOP组成的计划，才能有大约99.3的准时交付的概率。 你也许觉得，这怎么可能办得到？ 你每天都办到了——你徒步走去学校上学，哪次失败了？那就是由两千个标准sop——迈步——首尾相连而成的计划。哪一步你崴了脚计划都会失败，但是你上了几年学，失败了几次？ 你看到问题了吗？ 没有SOP，没有SOP的可靠性，就没有资格做计划。这就是为什么我说一般人做计划只是在过家家——因为一般人所作的计划常常是由没有严格训练测试的不结实的“无定形任务”组成的。 这样就根本没有制定计划的基础。 为了可靠的制定计划，你必须首先有高度可靠的SOP来作为基石。 SOP并不是一些按照时间顺序排列的操作说明，而必须是一个基于基本原理的、极尽合理的、界定清晰的、经过充分测试的、健壮的、高度自觉的系统化方法。 SOP的每一个步骤安排、每一个步骤的细节，都应该有足够的原理支持而不能是知其然而不知其所以然的照方抓药。如果不是与坚实的基本原理牢固的连接起来，你的SOP很可能实际上是无效的，根本不能有效的达成它所追求的目标，那么其他的一切也都是枉然了。 它同时必须是极尽合理的，这意味着它要经过深思熟虑，反复的调整，整体规划，挤干每一分没有充分实际价值的水分。 它必须是界定清晰的，每一个步骤从何处起，到何处止，交付什么样的交付物，产生什么样的副产物，都应有充分的定义和准确的界定。 不应该有任何一点操作、任何一个交付物或无产物没有明确的步骤归属。 然后它要经过充分的测试。最终是测试结果——而不是自觉完美的计算——决定着你的SOP的真实设计品质。 如果你设计得当，你的SOP应该有很高的容错性和抗干扰性。它其中的每一个自步骤都并不要求操作者有什么特殊的过人天赋，其难度要求应该普遍低于一般人经过简单训练就能达到，经过正常训练能高水平完成的水准。 这种低标准、高抗干扰的设计特性，就称为健壮性。 高度自觉，是指SOP中应安排足够的便捷有效的排除错误的机制，使得在每一个关键节点上都有恰当的、有效的、最好还是成本低廉的质检措施，以便使操作的失误都能被有效的察觉，及时得到纠正，保证最终的输出物质量和效率，从而使得在操作之中执行人能透彻的、完整的对操作的进度和质量细节保持觉察。 SOP一旦设计好了，就要视作最重要的个人资产反复加以练习和强化。 要反复反复的练习和实践，直到你掌握它的一切变通、一切细节的原因、一切操作的要点，能如呼吸般自然从容的执行它为止。 执行你的SOP，应该是一种完全不消耗心力的轻松的体验，完全不会令你感到任何紧张，也不会感到任何压力。 举个例子——刷牙洗脸会让你感到紧张吗？它是不是已经不消耗脑力到了你经常会需要回忆“我刚才刷牙了吗”？ 对SOP掌握的牢固程度、深刻程度，就是你的基本功所在。 一项计划是有大量的环节的，也会有非常多纷繁复杂的变数，它之所以总是不能如愿的执行，其根本的要害就在于你计划的步骤的抗干扰能力太差。 你计划了十个步骤，每个步骤的执行你都会受到意外情况的干扰，如果你每一步都发生交付时间和交付物的偏差，积累十次你的计划就会完全失败。 合理来说，你必须将你的计划归化成为由大量的SOP和少量的临时过程的组合。 这犹如规划一段旅程。SOP就犹如地铁、高铁这些轨道交通，而那些临时过程就如同在站点与站点之间的步行、骑车和打车过程。 一旦踏上了轨道交通，那些段落就是准时准点、极少意外的，而且不需要你消耗心力去关注、焦虑，而且成本高度可预料。 而那些无法用纯轨道交通完成的路段，你就要依靠临时的灵活机变、依靠种种的投入去保证正常完成。 你的大部分机动时间、机动预算以及违约预备金都要放在这些环节，然后大睁双眼把这些环节看好。 这些灵活机动的环节，是真正考验人的机变能力的部分，也恰恰是因为如此，你才更需要把一切能用SOP处置的环节先归化为SOP，一遍减轻负担，集中精力去对付这些环节。这些机动环节就像胶水和桥梁一样将坚硬可靠的SOP们联结在一起。SOP是坚硬可靠的，胶水环节是柔软灵活的，于是你的计划才会刚柔并济，在可靠性上有保障而在有效性上有意义。 坦白说，一个人的效能，几乎完全的看ta身上有多少可靠的SOP可用。 其实对中国人有一个特殊的文化优势，那就是事实上SOP的划分已经在语言中内化了。 在中国，每一个单字的动词，都是一门单独的SOP，是被几千年历史识别提纯的功夫， 吹、拉、弹、念、做、打、说、学、逗、唱、描、摹、写、画、洗、染、编、织、切、割、斩、剁、蒸、炒、煮、炸、烹、炙、腌、渍、刺、扫、劈、卸、勾、挂、投、缠、雕、钻、刻、划、测、算、计、谋、骑、射…… 每一个单字，都是你可以练的功夫。 真正占住一个字，你已经可以在人间立足，无惧任何竞争。你要是占住三四个字、乃至八个、十个字，你已经足够开宗立派，荫蔽后人了。 叫你吹，你气力悠长吗？你收放自如吗？你节拍分明吗？你呼吸转换能自由掌握吗？ 叫你描，你线条流畅、力度均匀、粗细得宜、出锋如刺、转折如斩吗？ 叫你刺，你意到劲到，力透线直吗？ 你知道这些字合起来可以做到多么令人惊叹的事情、可以支撑多么复杂的计划吗？ 但是现在叫你站出来，叫你拿一个字出来试给人看，试给自己看，你有几个字有这个硬气？有多硬？ 没有SOP，就没有功夫。 没有功夫，没有资格做计划。 没有计划，你人生必败。 本文总结 一，计划的定义：计划是技能和未知的结合。技能越可控，未知的因素越少，计划的成功率就越高。 二，技能的地位：人所养成的技能就是已知要素，其作为可控的部份组成了计划。 三，技能的设计 1，明确技能目的 2，确保原理支撑 (1）借鉴认识的基本原则：learn from the best. 四，技能的形成和优化 1，形成：实践 2，优化 (1）提升效益 无效化去除：发现并减少无效化的部份 (2)提升技能适应性 1)降门槛：降低操作难度 2)抗干扰：提高抗干扰能力 3)易优化：人应该形成对技能的使用效果有着便捷的成本低的察觉机制 五，疑问/想法 本文与关于【如何做事】所说的不矛盾，具体情况具体分析，前提条件不同，真理的适用范围不同，认真做好眼前的事是每一刻应该持有的心态，所谓谋事在人成事在天，认真做好手头的事，不要去管有何种目的有何种好处，认真做好就是了。至于这篇的“人生必败”，我认为意思应该是糊里糊涂到处乱荡死路一条。话又说回来了，认真做好手上的计划也是认真做好这一刻我应该做的事情，至于这个计划未来能不能成功那不是我此刻应该想的，我此刻应该想的是怎么把这个计划做好，分析可能的难点，提出需要的解决方案，有更好的可执行性，更高的成功概率。未来实际出现的问题，那是未来的我应该认真去解决的。 [粒度过细并不是收益] [操作的基准要尽量平易近人，越是平易近人，出错的概率会越低] [SOP是乐高积木，它不应该妨碍你组合出任何形状。] 注释 SOP:Standard Operating Procedure,“标准作业程序”，就是将某一事件的标准操作步骤和要求以统一的格式描述出来，用来指导和规范日常的工作。SOP的精髓是将细节进行量化，通俗来讲，SOP就是对某一程序中的关键控制点进行细化和量化。 ↩︎ 关键路径：指由延迟就会影响计划交付的事件首尾相连形成的事件路径 ↩︎","path":"posts/20230402100627-9cc92f78.html","date":"04-02","excerpt":"","tags":[{"name":"人生规划","slug":"人生规划","permalink":"http://kisma77.github.io/tags/%E4%BA%BA%E7%94%9F%E8%A7%84%E5%88%92/"}]},{"title":"4.01 姐姐带孩子来家里玩|旧人生日","text":"招待姐姐和俩孩子 今天姐姐带俩孩子来家里玩，诺诺吃饭时又嘤嘤嘤，我很烦，我不喜欢他，总是喜欢哭，小孩子哭正常，但他被带得太娇气，我还是喜欢曦曦。 午餐给他们做了粉蒸肉、杏鲍菇炒牛干巴、牛干巴炒白菜和凉拌土豆丝，俩孩子很喜欢吃。 披萨是她们自己买的。 老婆说我态度太过于明显，姐姐、姐夫他们坑定看得出来，我说那我以后改一下。 旧人生日 今天是愚人节，是张国荣的忌日，也是一位旧人的生日，虽然离了婚早已分道扬镳，但我为啥会想起是“生日”呢？ 前一段疫情严重的时候来电话问我怎么样，顺便告诉我她结婚、生子了，我告诉她过去这八年我挺恨她的，但现在我放下了。她还要了我妈的电话，说一直记挂老人家，我给了电话，同时要了她爸的电话，但我一直没打过，短信都没发，老张对我很好，但经过这些年这些事，我不知道该怎么对话。 让往事随风吧，放下了。","path":"posts/20230401235237-51fee0ff.html","date":"04-01","excerpt":"","tags":[{"name":"生活日记","slug":"生活日记","permalink":"http://kisma77.github.io/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E8%AE%B0/"}]},{"title":"hexo博客内插入B站视频自适应大小的办法","text":"在博客插入视频所需要的条件请阅读hexo官方文档，这里仅讨论如何使插入（B站）的视频后视觉效果更好这一问题。 B站官方给出的“嵌入式代码”直接插入，但效果不好。 问题 1&lt;iframe src=&quot;（视频网址）&quot; scrolling=&quot;no&quot; border=&quot;0&quot; frameborder=&quot;no&quot; framespacing=&quot;0&quot; allowfullscreen=&quot;true&quot; width=&quot;100%&quot; height=&quot;580&quot; quality=&quot;high&quot; &gt; &lt;/iframe&gt; 按照次方式，插入代码 1&lt;iframe src=&quot;//player.bilibili.com/player.html?aid=781122340&amp;bvid=BV1a24y1u746&amp;cid=1054637103&amp;page=1&quot; scrolling=&quot;no&quot; border=&quot;0&quot; frameborder=&quot;no&quot; framespacing=&quot;0&quot; allowfullscreen=&quot;true&quot;&gt; &lt;/iframe&gt; 出来的效果是 能播放，但显示效果不是很理想，两边有很宽的空白，而且视频尺寸太小，需要调整一下。 解决方法 在&lt;iframe 前面加&lt;div style=&quot;position: relative; width: 100%; height: 0; padding-bottom: 100%;&quot;&gt;,在&lt;/iframe&gt;后加&lt;/div&gt;,即插入的代码为： 123&lt;div style=&quot;position: relative; width: 100%; height: 0; padding-bottom: 75%;&quot;&gt;&lt;iframe src=&quot;//player.bilibili.com/player.html?aid=781122340&amp;bvid=BV1a24y1u746&amp;cid=1054637103&amp;page=1&quot; scrolling=&quot;no&quot; border=&quot;0&quot; frameborder=&quot;no&quot; framespacing=&quot;0&quot; allowfullscreen=&quot;true&quot;style=&quot;position: absolute; width: 100%; height: 100%; left: 0; top: 0;&quot;&gt; &lt;/iframe&gt;&lt;/div&gt; 这样尺寸就大，视觉效果好很多。 当然，还有其他网友的办法，比如Hexo博客Next主题bilibili视频Markdown引入文章,可供参考。","path":"posts/20230401234705-3c203bfa.html","date":"04-01","excerpt":"","tags":[{"name":"博客插入视频","slug":"博客插入视频","permalink":"http://kisma77.github.io/tags/%E5%8D%9A%E5%AE%A2%E6%8F%92%E5%85%A5%E8%A7%86%E9%A2%91/"}]},{"title":"wiki主题的本地搜索","text":"wiki主题很棒，我决定就用这个主题了。 之前配置时由于我将永久连接设置为essay-:.html，essay是文章的意思，我自定义的一个“前缀词”，这样设置后，文章地址就是https://域名/essay-xxxxxx.html这样的，很好用，简单，但在使用wiki主题时遇到本地搜索时无法转向文章连接的问题 遇到的问题 具体错误为 如搜索某个关键词后点击文章出现的连接为https://essay-af71958ebe31.html/这地址没有GitHub的前缀，无法打开， 完整的文章链接应该是https://kisma77.github.io/essay-af71958ebe31.html，也就是缺少https://name.github.io/ 解决方法或过程 期间也检查、重新安装了插件hexo-generator-json-content，不知道问题出在哪里，还去给主题的作者留言请教，但暂时没得到回复，一直无法解决问题。 今晚我修改_config.yml的永久连接，将原来的permalink: /essay-:hash.html改为posts/:date:abbrlink.html,居然可以本地搜索了，真是无心插柳解决了问题 思考 （当然，对于不懂代码的我来说，这个“思考”有点滑稽，但有必要记录，我想并不是每一个人都懂代码，也许有跟我一样既不懂代码，也正好遇到这个问题的人） 本地搜索时，程序可能会去‘post’文件夹内搜索（提取），我之前是把‘post’改为了自定义的‘essay’，因此无法显示正确的地址连接。（哈，不懂代码的人的思考，实在是滑稽！但好在问题解决了）。 以前在解决永久连接这个问题时，网上看到的一些方法里会说：“..‘post/’可有可无，删掉也可以”这样的介绍，我的经验告诉我，这种说法会导致本地搜索时出问题。 更多“永久连接”的信息，请阅读hexo官网：永久链接（Permalinks）.","path":"posts/20230401225237-cdbc5704.html","date":"04-01","excerpt":"","tags":[{"name":"hexo博客","slug":"hexo博客","permalink":"http://kisma77.github.io/tags/hexo%E5%8D%9A%E5%AE%A2/"}]},{"title":"3.31 为什么很多聪明人却过不好生活","text":"今天出去溜达时，在国瑞城看到有一家杨国福麻辣烫，我就跟媳妇聊 榜样的力量或者环境对个人成长的影响 张亮麻辣烫与杨国福麻辣烫的故事 以前网上盛传张亮和杨国福两大麻辣烫巨头的创始人是亲戚，张亮原本在舅舅杨国福的店里打工，学到技术以后出去单干，创立了张亮麻辣烫。 这个说法后来被张亮亲自辟谣了，两人确实有一些关系，但杨国福并不是他的舅舅，而是没有血缘关系的“姑家表姐夫”，并且在事业上也没有什么交集，但做麻辣烫确实是受杨国福的启发。 这事儿有意思的一点在于，杨国福在事业上并没有提携过张亮，从公开内容分析，两人大概率是属于没有走动的远房亲戚，但张亮就因为“姑家表姐夫”的成功示范，从一家苍蝇馆子开始做起，创立了属于自己的事业。 这个示范效应的威力还远不止如此，在杨国福和张亮的带动下，两人的老家哈尔滨宾县，发展成了麻辣烫之都，诞生了大大小小几十个麻辣烫品牌，大街上随便一个不起眼的门店，都有可能是连锁品牌的发源地。 在宾县麻辣烫行业最火热的时候，宾县街头任何一个野心勃勃的年轻人，今天可能还是麻辣烫的消费者，明天就可能进入麻辣烫行业， 从而改变自己的命运。做出这种选择的年轻人当然是聪明的，但客观来说，这种改变人生的选择，更多的是因为他生在宾县，近距离看见了成功。 因为人们对“远方的成功”往往是迟钝的，但对“附近的成功”却非常敏感，比如杭州那个长的像外星人的小个子成功了，你不会起心动念，但要是隔壁二傻子做成了一件事，你自然会觉得“我也可以”。 所以，很多产业都有地域上的聚集性，比如曹县的汉服，灌云县的内衣、昌乐县的吉他，最初可能是某个当地人的天才或意外（后者的可能性更大），在这个行业获得了成功，然后吸引了更多人的加入，最后形成了产业集群。如果你生在某个产业集中地，那么选择进入这个产业就是你的“决策舒适区”，就像你生在山东曹县，就比出生在河南驻马店更有可能去做汉服生意。 人不能想象自己没见过的东西，也自然难以跳脱环境的桎梏去做人生规划。 当宾县的年轻人选择麻辣烫的时候，与此同时，沈阳可能也有一个聪明、勤劳、有野心，愿意从小生意做起的青年，但他的选择大概率是卖烤鸡架，几年以后，宾县的年轻人可能已经开出了连锁店，沈阳的年轻人却只能在深夜收摊以后，在网上发出灵魂一问“为什么我这么聪明，却始终在社会底层？” B站非洲飞哥的故事 B站有一个叫“非洲飞哥”的up主，80后、农村人、只上过大专，底层打工人专属配置，但飞哥的命运在婚后第三年改变了，这一年飞哥有了女儿，养家的重担让他极其渴望赚钱，飞哥的原话是“前后一年都在想怎么挣到钱，压力特别大，越想越慌”。 很多底层年轻人都会经历这样的阶段，也许是因为像飞哥那样要养家，也许是因为极度渴望自我实现，但局限于认知和人脉，他们往往会尝试一个被做烂的生意，或者学一门存在了几十年的手艺，这样的选择自然不会改变一个人的命运。 但飞哥最后的选择是去非洲打工，因为他有一个在非洲务工超过十年的父亲。 接下来就是一个很俗套的成功故事，飞哥先是从普通工人做起，在非洲熬了几年之后，发现了当地运输业的商机，于是跟别人合伙搞运输，一年就挣到了一套学区房的钱，有了钱就有了时间，闲暇之余拍了一些展现非洲风土人情的视频，又赶上了短视频的风口。 看过飞哥视频的人，恐怕都不能否认飞哥是个聪明人，但飞哥这种程度的聪明，任何一个村子都能找到十个，但“去非洲打工”这个选项，根本不会出现在他们的选择列表里面，因为非洲距离他们的生活太遥远了，不但是地理位置上的遥远，更是人际关系的遥远。所以不论非洲怎样“广阔天地，大有作为”，跟他们都是没有关系的。 （社会学）有一个“六度分隔理论”，即：你和任何一个陌生人之间所间隔的人不会超过六个，也就是最多通过六个人你就能够认识任何一个陌生人。在六度分隔的基础上，有学者提出了三度分隔理论，既：相距三度之内是强连接，强连接可以引发人的行为。相距超过三度是弱连接，而弱连接只能传递信息。 从这个角度来说，不论是飞哥因为父亲的缘故去非洲，还是张亮因为“姑家表姐夫”的启发做麻辣烫，本质上都是“强连接”引发的选择。 所以，一个碌碌无为的中年人回溯过去二十年，也不必为自己马不停蹄地错过了各种机会而感到懊悔。对于大多数人来说，不论是外贸的火爆，还是互联网的发展，都只是“远方传递过来的信息”，而不是“眼前可供选择的选项”，抓不住这些机会是再正常不过的事情。 尤其是青年时期认知还不成熟的时候，在决定命运的几个关键节点，那条通往成功的路没有出现在你的选择列表里，那么泯然众人是大概率会发生事。 还有一种更坏的情况，就是被周围信赖的人提供了错误的建议。很多事情年纪到了才能深刻理解它，但又不得不在很年轻的时候做出决定，以至于很多出身底层的年轻人，被认知低下的人给出的建议，草草决定了命运的走向。 刘强东的故事 比如刘强东就是这样，东哥是宿迁的高考状元，本来清华北大随便进，但高中老师告诉他，如果想要回家乡当县长，带领家乡人民致富，应该选择[人民大学社会学系。不得不说东哥高中老师的认知相当“朴素”，想当然地认为人大社会学系是离人民公仆最近的专业。 然而，听从了老师建议的东哥，进大学第一天梦想就破灭了，学长告诉他人大毕业是不能直接当官的，社会学系更是就业率倒数第二的专业。 一个年轻人，即使拥有能考进清北的智商，但在青年时期对世界缺乏认知的时候，被信赖的人提供了错误的建议，那么这个坑也是很难绕开的。 当然，东哥后来努力从“坑”里爬了出来，用另一种方式为家乡做了贡献。不过这个过程其实也很值得分析一下。 大家都知道被坑的东哥后来自学编程，给别人开发软件赚到了一些钱，大四的时候拿着自己的积蓄，又从父母亲戚那里借了一些钱去开了饭店，饭店虽然赔钱了，但也为后来创业积累了经验。 对于东哥这种学霸来说，自学编程是很正常的，做生意也算不上奇怪，但在大学还没毕业的时候，就敢借钱去开饭店，这对于一个90年代的农村做题家而言，人生道路的切换也未免过于“丝滑”了。尤其是东哥的父母居然愿意借钱给一个大学还没毕业的孩子去做生意，就更不符合常理了，大多数出身底层的父母的生存逻辑往往是求稳的，大学还没毕业就想着做生意，正常来说只会被斥责为“不务正业”。 但了解东哥的家族史以后，就会明白这种选择其实并不突兀，东哥的家族从曾祖父开始就在京杭运河一带做生意，祖父也有自己的船队，到父亲这一辈才开始没落，也就是说东哥家其实是有“富人记忆”的，也有做生意的积淀和传承，这一点从他父母在改开以后，就马上辞去工作去做跑船的个体户就可以看出来。因此东哥在掉坑里以后，把经商作为自我实现的另一条途径，可以说再正常不过了。 思考：环境对个人成长的影响 具体的见《钢铁、病菌与枪炮》，这里就是“朴素”的口水话。 通过以上“故事”，我们可以明白两个残酷的事实： 大多数人成功的原因，无非是因为他能近距离接触到成功，知道成功长什么样子，然后才能模仿成功； 人的“主观能动性”是有限度的，你能做出的选择，实际上都是环境给你的，如果环境没有给你相关的选项，就很难找到通往成功的切入点。 所以，如果有什么人生建议的话，那就是： 到离开舒适区，即离开“搞钱”思路很狭隘的生活环境，到更有利于“发展”的环境中去。古人云：家贫走他乡。或许就是此考虑。 到看得见成功的地方去，先看见才有机会复制成功。 在这个所谓的信息时代，人们其实都是听闻成功，但看不到成功的全貌。不说远方的成功，就是附近的成功也很难看到，举个例子来说，你天天上班，但你知道你所在公司的供应链，产品细节，获客手段吗？ 不知道也不能怪你，因为生意就是这么设计的，如果所有人都知道生意的全貌，那老板的生意就不要做了。 但在新兴行业，员工往往有全流程参与的机会，从而一窥生意的全貌，比如电商行业刚兴起的时候，电商运营离职单干的概率特别高，就是因为运营这个职位清晰地知道，从选品到获客的所有环节，所以后来做电商的老板，哪怕多招一些人，也要尽量拆分这个职位。 如果你还年轻，在面对离自己生活环境很远的新兴事物的时候，不要在心理上隔绝它，不妨大胆一些，让它成为自己的选项，给自己一些犯错的机会，也许能在这个固化的时代，找到突破阶层的缝隙。 数学上有个“初值敏感”的概念，人的命运本质上是“生活环境的延展”，几个初始参数的不同，最终的结果可能天差地别。这很多事情，很多道理，年纪到了都能会都能懂。 但社会比的是谁先懂，早懂和晚懂是不一样的命运。","path":"posts/20230331225808-d24b4fc3.html","date":"03-31","excerpt":"","tags":[{"name":"成功","slug":"成功","permalink":"http://kisma77.github.io/tags/%E6%88%90%E5%8A%9F/"}]},{"title":"三月最后一周（3.31），本周亏大了","text":"本周（3.27-3.31号）是三月的最后一周，操作却亏了7000块! 交易 本周我就没好好交易，心不在焉的，不专注。 今晚姐姐带俩孩子来家里，陪她们玩去，待总结。 今晚的收入￥780，需要扣除21块的佣金，759元净利润 生活 每天陪老婆出去遛弯，随着预产期越来越近，我很焦虑，好在溜达的时候可以散散心。 这个季节的北京很美，走到哪里都是花。","path":"posts/20230331223221-588772fe.html","date":"03-31","excerpt":"本周（3.27-3.31号）是三月的最后一周，操作却亏了7000块!","tags":[{"name":"投机","slug":"投机","permalink":"http://kisma77.github.io/tags/%E6%8A%95%E6%9C%BA/"}]},{"title":"3.31 如能运行，切勿动它","text":"以前在公司就听程序员们说编程第一法则是如果你的代码可以正常运行,就千万不要再去动它，当下我算是深切领会了。 昨晚，我手欠，把GitHub上博客的库删了，瞬间博客就挂了，没有“回收站”，没法找回，最后是重新建了一个库，一模一样的名字，慢慢一步一步恢复的。 我找到了这个wiki的主题，还蛮喜欢，暂时就用它了。可惜本地搜索有bug。 这个博客很容易让人掉入“优化陷阱”，一杯水，一包烟，一个主题搞一天。 以后再也不乱搞了，不手欠，也不让自己掉入优化陷阱，博客就是个工具，可不能被它用我，应该是我使用它，不能反过来。","path":"posts/20230331015223-45aca943.html","date":"03-31","excerpt":"","tags":[{"name":"博客","slug":"博客","permalink":"http://kisma77.github.io/tags/%E5%8D%9A%E5%AE%A2/"}]},{"title":"3.30 颐和园美景","text":"颐和园，北京市古代皇家园林，前身为清漪园，坐落在北京西郊，距城区十五公里，占地面积约二百九十公顷，与圆明园毗邻。它是以昆明湖、万寿山为基址，以杭州西湖为蓝本，汲取江南园林的设计手法而建成的一座大型山水园林，也是保存最完整的一座皇家行宫御苑，被誉为“皇家园林博物馆”，也是国家重点景点。 清朝乾隆皇帝继位以前，在北京西郊一带，建起了四座大型皇家园林。 乾隆十五年(1750年)，乾隆皇帝为孝敬其母孝圣宪皇后在这里改建为清漪园，形成了从现清华园到香山长达二十公里的皇家园林区。 咸丰十年(1860年)，清漪园被英法联军焚毁。光绪十四年(1888年)重建，改称颐和园，作消夏游乐地。光绪二十六年(1900年)，颐和园又遭“八国联军”的破坏，珍宝被劫掠一空。 清朝灭亡后，颐和园在军阀混战和国民党统治时期，又遭破坏。 1961年3月4日，颐和园被公布为第一批全国重点文物保护单位，与同时公布的承德避暑山庄、拙政园、留园并称为中国四大名园，1998年11月被列入《世界遗产名录》。2007年5月8日，颐和园经国家旅游局正式批准为国家5A级旅游景区。 2009年，颐和园入选中国世界纪录协会中国现存最大的皇家园林。 下图是今早手机拍摄的颐和园，很美 下面3张图片是网友拍摄的，时间、作者不详，我是在微信群里收集到的，如侵，请留言我删除 最喜欢最后这张","path":"posts/20230330233557-b7a81f3c.html","date":"03-30","excerpt":"","tags":[{"name":"颐和园","slug":"颐和园","permalink":"http://kisma77.github.io/tags/%E9%A2%90%E5%92%8C%E5%9B%AD/"}]},{"title":"3.27 和老婆一起逛胡同","text":"今天周一，陪同产检、交易两件事。 1.配产检 上午陪同产检，需要7点扫单子，我先去医院，刷完单子后老婆也到了，就做产检，我只能在检查室外面的大厅里坐等。9点多的时候全部检查完毕就回家。 2.交易（白） 周五我有两张棕榈多单，早上开盘后浮亏1200多，等我们从医院回到家时，价格回落到我只浮亏220元，但很快价格又起来，但我一直没有动。 这两天小区在更换燃气表，上午换表的师傅上门给换好后我才做饭，吃完午饭就13：30，没有出去溜达，等2点看贵州“村BA”总决赛，昨晚看了第三四名的争夺赛——本来今天的总决赛也是昨晚进行的，但昨晚在[铜仁 PK 毕节]的三四名争夺赛时下雨了，总结赛推迟到了今天下午两点。 看球赛我就没盯盘——按照我制定好的止损执行，由于我是看日K周期，所以盘中是没必要盯着的，一般只需要等到下午三点收盘前看一眼有没有触发止损即可。到收盘都没有触及止损，但浮亏已经又上午的-220元增加到了-2300元，但还是没触发止损条件就没动。 3.和老婆一起逛胡同 4点多时我俩出去向南溜达了一圈，发现周边有平房区，里面不少胡同（这里是二环里，胡同蛮多的，以后得多逛逛），我们进去溜达了一圈，还是第一次逛北京的胡同。 逛了回来进小区时买了半径熟牛筋、一个宫保鸡丁回来当晚餐的菜，媳妇早就说想吃宫保鸡丁了。 晚上吃完饭后媳妇跟我妈妈打了个电话，告诉她这边检查的事：宝宝发育很好。妈妈记不得几个月了，媳妇告诉她“8个月了，5月20号左右就生了！”，妈妈很高兴。 2.1 交易（夜） 到了晚上开盘，我在浮亏的情况下开了两张空单棕榈单子，这属于违反操作理念——不可摊平亏损——了。 截止夜盘收盘，亏2780元，不该浮亏加仓（摊平亏损），看明天吧，我不想主观分析，只想按照《百分百红灯策略》的思维来操作。 对了，周末还去逛了一下明城墙公园，里面举办梅花节，不过看样子已经结束了。","path":"posts/20230327230301-16cf6a91.html","date":"03-27","excerpt":"","tags":[{"name":"北京胡同","slug":"北京胡同","permalink":"http://kisma77.github.io/tags/%E5%8C%97%E4%BA%AC%E8%83%A1%E5%90%8C/"}]},{"title":"3.25 聪明人为什么会下笨功夫？","text":"常听说“聪明人下笨功夫”，不妨往深了多思考一下，比如：这些聪明人怎么会做笨功夫？做笨功夫还怎么会是聪明人？ 细思之后，会发现，那些功夫只是看起来很笨，其实去做它们是最聪明的做法。 聪明在哪呢？ 聪明在于除了如此，绝无第二捷径可走。这功夫是绝对绕不过去的苦路。 聪明人相当确信，这种功夫之难，难到了你如果早起步一个月，世界上任何的另一个人哪怕拿着无限的资本做后盾，也绝对没有可能在你不松懈的前提下超到你前面去。 因为这个功夫实在实在是太“笨”了，没有任何办法能投机取巧，没有任何办法能绕道，唯一最快的凿穿这厚厚的玄武岩层的办法，就是靠一个聪明到你这个程度、有同样罕见的机缘、有同样深厚的经验、有同样难得的资源的人、抱着绝不旁顾的决心，抗拒一切其它机会成本的诱惑， 水滴石穿，直线前进。 这个世界上， 与你同样的聪明的人有， 同样聪明、有同样经验的人有， 同样聪明、同样经验、且有同样资源的人有， 同样聪明、同样经验、同样资源、且同样看见这件事了的人有， 但是同样聪明、同样经验、同样资源、且同样看见这件事的、却和你**同样笨、**会选这件吃力不讨好、要抱定必死的觉悟、耗费巨大的心血去把墙磨穿的人， 罕有。 你有的条件，他们全都有了，在这件事上，ta与你唯一的差距，就是他们没你这么笨，肯拿这么好的才智、这么好的资源、这么优势的地位，“干这个”。 所以，你才比较大的希望会赢。 满足上面这全部条件的“绝妙笨功夫”，是需要绝顶聪明、绝佳运气才有机会才有机会触摸得到的。 不是绝顶聪明外加极端努力，你怎么知道这件事确确实实没有其他捷径可走？ 老天真的是爱聪明绝顶、却肯用来做人决不肯做的笨功夫的笨小孩的。 上天给聪明人们安排了这样一种“不做笨事就别想赢”的天然禁制令，真的是对人类一种极大的仁慈。 那些石墙，注定要靠这种极聪明的笨人才有可能凿穿。 那墙背后一片阳光普照，海阔天空。 这就是为什么真正的聪明人，心心念念都在梦想那件真正命定属于自己的笨事。 这种绝妙的笨事，是聪明人可以心安之处。 最平安的归宿，最恰如其分的死所。 没有体会过的人，难以理解“没有与我一样聪明的人会和我一样傻”是一种什么样的幸福。 笨人比聪明，聪明人比笨。 What a poetic irony.","path":"posts/20230325093642-33a3ff6c.html","date":"03-25","excerpt":"","tags":[{"name":"智慧","slug":"智慧","permalink":"http://kisma77.github.io/tags/%E6%99%BA%E6%85%A7/"}]},{"title":"3月第三周（3.24）小结","text":"本周盈利4804元，共交了264元佣金，净利润4540元，算下来收益率是7%。 共交了264元佣金，与利润相比，高了。主要是因为我操作的频率高了！","path":"posts/20230324235206-5cb45f8d.html","date":"03-24","excerpt":"本周盈利4804元，共交了264元佣金，净利润4540元，算下来收益率是7%。 共交了264元佣金，与利润相比，高了。主要是因为我操作的频率高了！","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"3.24 今天去选孕妇照，回来两人下了馆子","text":"今天去选孕妇照，选照片的时候，商家一个劲的推她们的套餐，就是想让我们花钱，我们不想花这个钱，我跟销售说：“我们没钱，我和老婆都没工作两年了，想买套餐也力不从心。”，销售一下就找不到话说了，只好作罢，后来她们的店长又来推销了一次，巴拉巴拉的熟练地说着“…哎呀，我还记得你们上次来照相时，…你们聊这么熟，你（指刚才给我们推销的‘经理’）给他们按照3800元打8折，再送他们一个10张精修底片…”，我看着店长说：“我们没钱，我俩没工作两年了，疫情后我们的收入为0，实在没能力…”，店长也一下懵了，找不到话说，就出去了。 最后，我们只花了800元（16张照片，一个8*8的相册）。 这个照相的项目是上次去做五维时送的，6照片免费的照片，今天一看，有91张，我们挑选了16张，不想多花钱。 回来的路上，媳妇说我刚刚把销售搞懵了，我说一无所有的人，做容易猝不及防了，她们没想到我这么真诚说自己没钱。 媳妇哈哈大笑 今天又路过8年前住过的小区，媳妇走到河边发现上次干枯的河里居然有了水。 上次去时，干枯的","path":"posts/20230324234206-2bfa5e50.html","date":"03-24","excerpt":"","tags":[{"name":"照相","slug":"照相","permalink":"http://kisma77.github.io/tags/%E7%85%A7%E7%9B%B8/"}]},{"title":"思考“拿住不乱抛”","text":"很多人买入后拿不住股票。怎样才能拿的住？你从何时能做到的？从最初交易经历了多久？哪些关键事改变了你？ 如果是你算好了该抛，你自然就抛了。所谓的“拿不住”，一定是指你其实没有任何确切的理由，仅仅只是怀疑自己看得不准。 没有理由，就是不相信了，信不足了。 理由你都查过了，怎么说呢——说一定有威胁吧，谈不上；说一定没威胁吧，也谈不上。 要算出这事到底发生概率有多大，办不到。情报永远不够——话说，什么叫“情报够”？ 就算一个威胁也没发现，那又如何？难道我没发现威胁就是真的没威胁了？要是世上有这等便宜事，市场上的企业不都是我家的了，还交易个空气啊。 看得到的威胁，已经把我推到悬崖边上了。 看不到的威胁在我背后开足了小宇宙天马流星拳。 我想一轮就挨一拳，cnm黄金圣斗士啊你是。 我现在坐在谷底，想这个问题——我怎么能做到怀疑而不害怕？ 如果你的投资的目的是为了避免损失，你是不可能不害怕的。你也是不可能拿得住的。 不要听那些成功的山顶卖出的人吹嘘什么经验。 那都是六合彩的经验。 你记住，只有一种立场可以让你真的“拿得住”——投资不是为了盈利，是为了花得值得。 我之所以“投资”某甲，根本不是因为这可以给我回报，而是因为某甲做的事情是对的，结果是我乐见的，ta需要这些东西的帮助去做这件事。 举个例子，我想要帮助中国拥有芯片，于是我挑了若干家我认为真的想做这事、有理想、有决心、有希望的企业，把钱投给他们。 他亏掉了，我心甘情愿。因为我一开始就是准备捐掉了。 我就是这么傻，所以我才这么幸福。 啥时候我觉得有什么人干的什么事会让这个世界更好一些，比“让中国拥有芯片”还重要了——比如让我这样美好的人治好病多活一段时间，或者让我爱的人开心一小下。我会打开我的小猪扑满看看这家芯片企业用完了没。 剩多少就是多少，没了就没了。 “投资”不是拿来赚钱的，而是拿来花钱的。 **你的聪明，要放在寻找那个“失而无憾的选择”上。**要培养洞察力、发展观察的方法和技巧去察觉对方做事是为什么。不要选那些“一切围绕为股东赚取最多利润”的人，要选那些“想做点事”的人。 我要听的不是“财富故事”，因为我的钱你可以花掉而不还给我。 我要听的是它为什么值得这样花。 你如果确实是净造福于世界，你应该自然会有额外的净剩余存在。这无关乎我是不是要保本得利，而关系到这值不值得。你有有效的方法能通过掌握和分发这份额外的剩余而使我的钱出现增值，那只是额外的添头，是我丢出这笔钱的额外奖励，不是我的第一诉求。 只要值得，那么花掉了我也已经保本。 这种“值得”，救赎了一切“损失的风险”。 是因为已被“救赎”，所以我才拿得住。 所以我根本不在乎什么市场风险国际局势变幻。 我相信世界的规则里已经写定了这样的好意，那些“想做事”而不是“想赚钱”的人，总会有足够的运气和勇气。 ta们拿得住ta们的理想，我就“拿得住”我的“赌注”。 我投资的东西，是我想好了不准备再拥有的东西。我已经放开了，还有什么“拿不拿得住”？ 你投资的东西，是你不能接受失去的东西，我坦白告诉你——你永远也“拿不住”。 你几点想明白，你就可以几点睡。 想不明白你就接着睁着眼睛想——你从此再无睡眠可言，只有晕倒。 如果你不认可这个“投资”的定义，那么我的“投资经验”就是0。 我的答案你不需要参考了。 那，我们该如何树立正确的财富观呢？→《财富观》","path":"posts/20230324110549-5055215f.html","date":"03-24","excerpt":"","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"3.24有赚，开心","text":"今晚赚了450元。 明天（24号）上午估计不会出摊，下午要去五路居选孕妇照，完事后要去金源看看婴儿车。 截止目前孕检、产包必需品花费￥9000左右","path":"posts/20230324014512-4ad5160b.html","date":"03-24","excerpt":"今晚赚了450元。 明天（24号）上午估计不会出摊，下午要去五路居选孕妇照，完事后要去金源看看婴儿车。","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"3.23虽盈利，还是丢了西瓜","text":"今天虽然盈利，但还是拣了芝麻丢了西瓜。 总是喜欢动，这是瘾，是病！ 交易上瘾症：行为心理学家可以很好地解释成瘾这件事：“做了一件事让你感觉很不错，于是情不自禁地还想做，哪怕长期来看，也知道这样做可能对自己不利，但还是很难打住。此外，当你感到不愉快的时候，也会想要通过做那些感觉不错的事情来避免体验不愉快，这样下去，就会成瘾，产生依赖。”","path":"posts/20230323155943-c3bb505b.html","date":"03-23","excerpt":"今天虽然盈利，但还是拣了芝麻丢了西瓜。 总是喜欢动，这是瘾，是病！ 交易上瘾症：行为心理学家可以很好地解释成瘾这件事：“做了一件事让你感觉很不错，于是情不自禁地还想做，哪怕长期来看，也知道这样做可能对自己不利，但还是很难打住。此外，当你感到不愉快的时候，也会想要通过做那些感觉不错的事情来避免体验不愉快，这样下去，就会成瘾，产生依赖。”","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"笛卡尔的四条准则","text":"我们知道，在重建住宅之前，光把旧房拆掉，备上新料，请好建筑师，或者亲自设计，并且仔细绘出图纸，毕竟还是不够的，还应该另外准备一所房子，好在施工期间舒舒服服地住着。所以，当我受到理性的驱使、在判断上持犹疑态度的时候，为了不至于在行动上犹疑不决，为了今后还能十分幸运地活着，我给自己定下了一套临时行为规范，一共只有三四条准则，我愿意把它的内容告诉大家。 第一条准则 服从我国的法律和习俗，笃守我靠神保佑从小就领受的宗教，在其他一切事情上以周围最明智的人为榜样，遵奉他们在实践上一致接受的那些最合乎中道、最不走极端的意见，来约束自己。因为我虽然为了重新审查自己的全部意见，从那时起把它们一律当成一文不值，却深信最好还是遵从最明智的人的看法。尽管波斯和中国也许跟我们这里一样有很明智的人，我觉得还是效法自己周围的人好处最大。而且，要想知道他们真正的看法，一定要看他们的实际行动，不能光听他们说的话，这不仅是由于世风日下，有不少人不肯全说真心话，也是由于有不少人并不知道自己的真心是什么；因为相信一件事并不等于知道自己相信这件事，这是两种思想活动，常常分道扬镳。在那些有同样多的人接受的看法当中，我总是选择最合乎中道的。这样做，一方面是因为这种看法永远最便于实行，既然偏激通常总是坏的，大概这也就是最好的看法；另一方面也是因为可以在犯错误的时候不致离开正道过远：万一我选择了一极端，应当走的却是另一极端，那就糟了。而且我特别认为属于偏激的是各种限制我们某项自由的诺言。这并不是我不赞成法律允许人们赌咒发誓、订立必须信守不渝的契约，以防止不坚定的人反复无常，保证达到某种正当目的，如保证公平交易之类。正好相反。这只是因为我看到，世界上的一切，特别是我这个人，并不是永远保持原状的。拿我来说，就希望把自己的判断弄得越来越完善，并不希望把它弄糟，如果由于曾经赞成过某件事，后来事情变了样我还只好说它对，我认为那就是犯了违背良知的大错，我要变卦，不认为它对。 第二条准则 在行动上尽可能坚定果断，一旦选定某种看法，哪怕它十分可疑，也毫不动摇地坚决遵循，就像它十分可靠一样。这样做是效法森林里迷路的旅客，他们决不能胡乱地东走走西撞撞，也不能停在一个地方不动，必须始终朝着一个方向尽可能笔直地前进，尽管这个方向在开始的时候只是偶然选定的，也不要由于细小的理由改变方向，因为这样做即便不能恰好走到目的地，至少最后可以走到一个地方，总比困在树林里面强。为人处世也是这样，我们的行动常常必须当机立断，刻不容缓。有一条非常可靠的真理，就是在无法分辨哪种看法最正确的时候必须遵从或然性最大的看法，即便看不出哪种看法或然性大些也必须选定一种，然后在实践中不再把它看成可疑的，而把它当作最正确、最可靠的看法，因为我们选定这种看法的理由本来就是如此。我明白了这个道理，从那时起就不犯后悔的毛病，不像意志薄弱的人那样反复无常，一遇风吹草动就改变主意，今天当作好事去办的明天就认为很坏。 第三条准则 永远只求克服自己，不求克服命运，只求改变自己的愿望，不求改变世间的秩序。总之，要始终相信：除了我们自己的思想以外，没有一样事情可以完全由我们作主。所以，我们对自身以外的事情尽了全力之后，凡是没有办到的，对于我们来说，就是绝对办不到的事情。我觉得明白了这一点就可以消除痴心妄想，凡是得不到的东西就不要盼望将来把它弄到手；这样也就安分守己、心满意足了。因为我的意志所能要求的，本来只是我的理智认为大致可以办到的事情，如果我们把身外之物一律看成由不得我们自己作主的东西，那么，在平白无故地被削除封邑的时候，就决不会因为丧失那份应当分封给我这位贵族的采地而懊恼，就像不会因为没有当上中国皇帝或墨西哥国王而懊恼一样；推而广之，生了病也就不会妄想健康，坐了牢也就不会妄想自由，就像不会妄想生成金刚不坏之身、长出高飞远翥的翅膀一样。不过我也承认，一定要经过长期训练，反复思考，才能熟练地从这个角度去看万事万物。我相信，那些古代哲学家所以能够摆脱命运的干扰，漠视痛苦和贫困，安乐赛过神仙，其秘密主要就在于此。因为他们不断地考察自然给他们划定的界限，终于大彻大悟，确信除了自己的思想之外，没有一样东西可以由他们作主，确信只要认清这一点就可以心无挂碍，不为外物所动；他们对自己的思想作出了绝对的支配，因此也就有理由认为自己又富又强，逍遥安乐，胜过所有的别人，别人不懂这种哲学，不管得到自然和命运多大优待，还是不能支配一切、事事如愿以偿的。 最后，为了结束这个行为规范，我曾经想到检视一下人们这一辈子从事的各行各业，以便挑选出最好的一行。对于别人的行业我不打算说什么话，我认为我最好还是继续自己所从事的那一行，也就是把我的一生用来培养我的理性，按照我所规定的那种方法尽全力增进我对真理的认识。自从使用这种方法以来，我尝到了极大的快乐，觉得人生在世所能得到的快乐没有比这更美妙、更纯洁的了。我凭着这种方法每天发现若干真理，觉得都相当重要，都是别人所不知道的，因此满心欢喜，别的事情全都不放在心上。此外，我建立上述三条准则只有一个目的，就是继续教育我自己。因为神既然已经赐给我们每人一份分辨真假的天然灵明，我觉得自己决不应该有片刻工夫满足于别人的看法，只有打定主意在条件成熟的时候用自己的判断去审查别人的看法；我决不能马马虎虎地跟在别人的看法后面转，只希望自己不放过任何机会尽可能地找出更好的看法。最后，我决不能限制自己的要求，也不能安于现状，只能走那样一条路，我认为照着这条路走下去，凡是我能够得到的知识都一定可以到手，凡是我能够得到的真正的好东西也就一定可以到手。因为我们的意志是不是追求一样东西，只是根据我们的理智把它看成好的还是坏的；有了正确的判断，就可以有正确的行动，判断得尽可能正确，行动也就尽可能正确，就是说，可以取得一切美德以及其他一切我们能够取得的好东西；知道自己一定可以这样，当然不能不高兴。 我用这三条准则给自己保了险，把它们并列于信仰上的真理，我心中永远占首位的真理。这样做了之后，我认为可以放手把我的其他看法统统抛弃了。我把自己关在那间暖房里得到了这样一些思想，可是为了顺利完成我的清扫工作，我觉得与其在那里闭门长住下去还不如走出来跟人们交往，所以我不等冬天过完又开始游历了。以后整整九年，我只是在世界上转来转去，遇到热闹戏就看一看，只当观众，不当演员。对每一个问题我都仔细思考一番，特别注意其中可以引起怀疑、可以使我们弄错的地方，这样，就把我过去马马虎虎接受的错误一个一个连根拔掉了。我这并不是模仿怀疑论者，学他们为怀疑而怀疑，摆出永远犹疑不决的架势。因为事实正好相反，我的整个打算只是使自己得到确信的根据，把沙子和浮土挖掉，为的是找出磐石和硬土。这样做我觉得相当成功，因为我对命题进行审查、揭露其错误或不确之处的时候，用的并不是软弱无力的猜测，而是明白确切的推理；我发现任何一个命题，不管如何可疑，总可以从其中推出一点相当可靠的结论来，哪怕那个命题本身是一点都不可靠的。人们拆除旧房的时候，总是把拆下的旧料保存起来，利用它盖新房。我也是这样办的。我断定自己的某种看法根据不足，把它取消不要的时候，总是从各方面观察，取得若干经验，这些经验后来都有助于建立更可靠的看法。此外我还继续练习我所制定的那种方法，因为我不仅从一般的方面着手，按照那些规则仔细地运用我的全部思想，而且还随时留下一点时间，从特殊的方面着手，解决了某些数学上的难题，甚至解决了某些其他科学上的难题；我发现那些问题所依据的本原不够牢靠，使它们脱离了那些本原，就把它们弄得几乎跟数学问题差不多了。大家可以在这本书里见到许多实例，说明我是怎样做的。如此看来，我的生活方式表面上跟某些人没有什么两样：不做什么事情，只是愉快地、正派地过着日子，用心把欢乐和邪恶分开；为了不至于闲得无聊，从事着各种正当的娱乐。可是尽管如此，我仍然在执行我的计划，增进我对真理的认识，成绩也许比埋头读书、只跟读书人往来还要大些。 然而，时间已经过了九年，我还没有对学者们争论不休的难题作出任何评判，还没有开始寻求任何比流行学说可靠的哲学原理。过去有许多高明的人曾经打算这样做，我觉得他们并没有成功。这种失败的先例使我想到这件工作困难很多，要不是听到人们传说纷纷，说我已经完成了这件工作，我大概还不敢这样早就去做它。我说不出那种传说的根据是什么，如果与我的言论有几分联系的话，那一定是由于我比一般有点学问的人老实些，有啥说啥，不知道的就说不知道；也可能是由于我举出种种理由说明我为什么对很多别人认为可靠的看法发生怀疑，而并不是由于我吹嘘某种学说。可是我还有点志气，不愿意有名无实，所以我认为自己无论如何一定要争口气，不负大家对我的器重。整整八年，我决心避开一切可能遇到熟人的场合，在一个地方隐居下来。那里在连年烽火之后已经建立了良好的秩序，驻军的作用看来仅仅在于保障人们享受和平成果，居民人口众多，积极肯干，对自己的事情非常关心，对别人的事情并不注意。我住在那些人当中可享受到各种便利，不亚于通都大邑，而又可以独自一人，就像住在荒无人烟的大沙漠里一样。 —— 选择笛卡尔《谈谈方法》第三部分","path":"posts/20230323141838-f501a894.html","date":"03-23","excerpt":"","tags":[{"name":"做事原则","slug":"做事原则","permalink":"http://kisma77.github.io/tags/%E5%81%9A%E4%BA%8B%E5%8E%9F%E5%88%99/"}]},{"title":"必须建立自己对事物认知的坐标系","text":"本文是央视的记者徐泓为了纪念其同事陈虻而写的《陈虻：我们听你讲》系列博文，其中有很多陈虻关于创作、认知的真知灼见。文章对我的帮助很大，我摘录在这里。 陈虻说：必须建立自己对事物认知的坐标系 陈虻抽烟，多年的习惯，身边总带着烟。后来只抽柔和的&quot;七星&quot;。 他的烟盒，还有另一个用途。在指导新人的时候，或者在给栏目组讲课的时候，他会经常拍出这个烟盒： 这是一盒烟。我把它放在一个医学家面前，我说请你给我写三千字，他说行，你等着吧，他肯定写尼古丁含量，几支烟的焦油就可以毒死一只小老鼠，吸烟的人肺癌的发病率是不吸烟人的多少倍，吸烟如何危害健康。 还是这盒烟，我把他拿给一个搞美术设计的人，我说哥们请你写三千字，那哥们给你写出来：这个设计装潢的色彩、标识的个性创意。 我把这盒烟给褚时建，说您是生产烟草的，您给我写三千字，他也毫不犹豫地说，你等着吧，他告诉你这是烤烟型，它的烟丝产地在哪儿，它的加工工艺是怎么样的，更高一级别的烟丝是怎么过滤的，为什么卖这个价钱，成本是多少。 我给一个经济学家，他告诉你，烟草是国家税收的大户，还有烟草走私对经济的影响。 我现在把烟盒给你，请你写三千字，你就会问写什么呀。 我刚才给那几个行业的人，他们都知道写什么，但是给记者的时候，你会问让我写什么呀，也就是说记者在面对一些事物时没有一个知识背景，没有自己的思考角度。 陈虻把媒体人的知识背景和思考角度称为“坐标系”，他经常挂在口边的一句话： 一个栏目，或者一个记者，必须建立自己对事物认知的坐标系。 陈虻说：在栏目化运作中，我认为应该前面有目标，背后有理念 电视栏目是电视节目的一种载体方式，它把特定的电视传播内容，按照相对统一稳定的标准和规则住址串联在一起，并以相对稳定统一的播出时段，和观众建立起“约会关系”。1985年，中央电视台提出“全部节目实行栏目化播出”的要求，陈虻正是在这一年里走进央视的。 陈虻对栏目化有三点简洁又准确的概括： 第一，要对题材有所限制； 第二，要围绕这样的题材创造一种叙述模式； 第三，这种叙述模式一定有它可识别的影像方式。 他有关“坐标系”的语录，也源自电视“栏目化生存”的大背景。 陈虻强调：一个栏目一定要有自己对于事物认知的一个坐标系，否则就会摇摆不定就会不清晰。也就是说，要有一个统一的认知事物的角度，这个坐标系一定是在每一个编导的心中。在面对每一个不同的事件时，运用相同的方法去研究，你就会找到你这个栏目所特有的气质和品质。 他还说，面对事物的时候，我们坚持在一个认知系统中去分析和判断，这就是理念。当然还要把你的理念还原成具体的技术，坐标系就是理念的具体化、技术化，长期用这样的坐标系判断，它呈现出来的结果就是这个栏目的理念。 问到《生活空间》的坐标系，陈虻的回答非常明确： 第一个就是人性的坐标，不管拍什么，我们都要站在人性的角度上去考察一个人，从尊重的这样一个起点去认知每一个人，并且让每一个人的行为被其他人理解，建立人与人之间的沟通。 第二个坐标，从社会发展、社会变迁的角度，当我们呈现这种人性与人的行为时，寻找他与社会发展、社会变革是什么关系。我们努力用影像或者捕捉到的情节的片段，去揭示个人和社会变革之间的关系，通过这种关系来反映历史进程的发生和发展。 当我确定了这样一个坐标系的时候，任何一个题材，都可以放在里边观察，我都有观察和判断的角度，也有选择和取舍的依据。 陈虻的工作状态也可以用“栏目化生存”来形容。他亲力亲为，每天在审这些栏目的片子，同时穿梭在各栏目的选题会、研讨会上用“坐标系”分析栏目的问题，讨论运作策略。 确定坐标系，就是确定价值标准 陈虻的“坐标系”用在栏目上，说穿了，就是如何确定栏目的价值标准。 他说：栏目运作策略建立的前提，实际上是要知道栏目的目标是什么。往往我们失去的是目标。一个栏目在运作的过程，某一个具体节目受到表扬的时候，大家误以为这样的节目就是我们的方向。某一个节目被枪毙的时候，大家都误以为这样的东西再也不能做。其实在任何媒体当中，你都会受到相应的制约，没有绝对的自由，也没有绝对创作者自身完全自由的选择。 只有你非常清楚地知道你的靶子在哪儿，退到一环，甚至脱靶都没有关系。环境需要你脱靶的时候，你可以脱靶，这就是运作的策略。没有自己的价值标准，栏目将在前进过程中迷失。 主持人是电视栏目可识别、并形成风格与品牌的核心元素之一。 陈虻推崇的主持人，是拥有“坐标系”的：我觉得崔永元永远不用着急，因为目前中国没有一个主持人能超过崔永元。他是对于任何一个事物，有自己的价值观，有自己识别的方法，有自己表达的特性，所以决定了他叫崔永元。白岩松为什么也引人注意呢？因为别人看一件事顶多总结出一点两点，他能总结出八点来。 有的主持人，他们更多的是行为的个性，就是外在的、形态的个性，这样的个性我觉得是短暂的。主持人要有风格，但风格绝对不是从语态上形成的。不是说你这话“吊着腰子”说，好话不好好说，嬉皮笑脸地说，就成为了栏目的风格了。一个栏目的特点，不仅仅是语言上的特点。更本质的东西，是看待事物一贯的态度、立场和方法。 陈虻说：选择了选题，不等于选择了主题 陈虻手里的烟盒，更多的时候，是掏出来拍给编导的。 陈虻去世一周年，柴静写了一篇博文，回忆她刚进央视的时候，陈虻也曾经给她拿出过这个烟盒拷问。柴静说：后来我知道，他经常拍出这盒烟来震慑新人。 陈虻说：一个编导，在拿到一个选题的时候，必须认识到选择了选题，不等于选择了主题，选择了这个新闻事件也不等于选择了主题。一个选题的主题有好多呢，选择什么样的主题，这就叫智慧，一个片子的智慧的含量。 你如果是很清醒地去判断这件事情，和很盲目的去判断这件事情，完全不一样。指哪儿打哪儿，和打哪儿指哪儿是两件事情。我现在看了很多的片子，有些问题的关键所在，就是缺乏对题材的把握，而把握它本身是需要思想的，是需要思想深度的，是需要方法的。最需要解决的问题，就是说当一个新闻事件摆在我们面前的时候，我们说什么，我们说哪些东西。 在这样一个事件里，是有很多种可能性的。也就是说，当你找到一个事件的时候，实际上你就找到了一个圆，这就是这个事件本身。但是在这个事件里边，还要找到你要重点阐述的，表达的方面。就是在这个大圆里要再画一个小圆。你必须在这样一个事件中找到一个更加具体的东西，更加直接的东西。 如果什么都包拢，就等于什么都没有，还是这个事件的本身。我们都关注，就等于都没关注。这就叫我说的：看完你这部片子，我认为可以开拍了。因为你只是把这件事情的方方面面向我介绍了一遍，介绍得都不够深入，都不够集中，也都不够深刻。你没有找到你要表达的东西，没有创作的角度，所以就没有在进行创作。而你真正的创作的开始是，当你选择完一个题材以后，你怎么样选择你关注的方面，选择一个小圆。 陈虻说：在这个大圆里选择哪个小圆，是你必须做的一份工作。 首先，一个题材当中实际上是有不同的小圆，不同的角度，而不同的角度决定了你对生活中同时存在的人，有不同的关注，不同份量的关注，不同层面的关注； 其次我要告诉你，在这个大圆里选择哪个小圆，是你必须的一份工作。这是我的一次动员，而不是可做可不做的，是你必须要完成的一个程序**。** 第三，我想告诉大家，你要在大圆里选择一个小圆，就必须要知道大圆里有多少个小圆，怎么分析一个选题，怎么能找到这个大圆里的N个小圆。然后选择与排除，留一个，再用这一个和那个大圆构成关系，这叫叙述，因为没有大圆，没有那基本事件，你这小圆就不成立。 这就需要建立思维的坐标系。你就可以站在不同的坐标上，去看待同样一件事情，你就会找到这件事情的不同的小圆。 所以选题的选择**，**看上去是谁都会选择的，在我们经历了一段时间的创作以后，我们发现，其实谁都会干的事儿，是最难干的，大家都知道，体育运动中每人都会的是跑步，跑步的提高，就是短跑的提高是最难的，技术性最强，技能型最强。 柴静在博客上发的那篇纪念陈虻的文章，有这样一段： 他最后说的一句话，十年后仍然拷问我：“你有自己认识事物的座标系吗？有几个？” 同样的问题，陈虻提给了每一个媒体人。请回答。 结束语 ★博文摘抄完毕。原文选自徐泓教授2012年03月03日的博文《陈虻：我们听你讲》系列博文之五。徐教授博客. 陈虻的坐标思维对我的帮助很大，我第一次知道“坐标思维”是阅读笛卡尔的《谈谈方法》，里面的“原则二”： 我的第二条准则是：在行动上尽可能坚定果断，一旦选定某种看法，哪怕它十分可疑，也毫不动摇地坚决遵循，就像它十分可靠一样。 这样做是效法森林里迷路的旅客，他们绝不能胡乱地东走走西撞撞，也不能停在一个地方不动，必须始终朝着一个方向尽可能笔直地前进，尽管这个方向在开始的时候只是偶然选定的，也不要由于细小的理由改变方向，因为这样做即便不能恰好走到目的地，至少最后可以走到一个地方，总比困在树林里面强。为人处世也是这样，我们的行动常常必须当机立断，刻不容缓。 有一条非常可靠的真理，就是在无法分辨哪种看法最正确的时候必须遵从概率最大的看法，即便看不出哪种看法概率大些也必须选定一种，然后在实践中不再把它看成可疑的，而把它当作最正确、最可靠的看法，因为我们选定这种看法的理由本来就是如此。我明白了这个道理，从那时起就不犯后悔的毛病，不像意志薄弱的人那样反复无常，一遇风吹草动就改变主意，今天当作好事去办的明天就认为很坏。————笛卡尔 《谈谈正确运用自己的理性在各学问里寻求真理的方法》","path":"posts/20230322210644-bda3aa88.html","date":"03-22","excerpt":"本文是央视的记者徐泓为了纪念其同事陈虻而写的《陈虻：我们听你讲》系列博文，其中有很多陈虻关于创作、认知的真知灼见。文章对我的帮助很大，我摘录在这里。","tags":[{"name":"认知","slug":"认知","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5/"}]},{"title":"3.22 单日最大跌幅里赚点零头","text":"每一个做投机的人都希望自己抓住一波大行情，平日里也是天天如此渴望、幻想，但当机会来了时，却又因为各种自身主观的原因而错过，事后又会后悔不已！ 棕榈最近这200多天一直都是横着走，今天好不容易向下走了，而且还是最近200天的最大跌幅 我却没有把握住，只赚了点零头。 账户昨天上了7万（70111），今天增加了2000多，但我错过了单日最大收益K，尾盘时我买了一张多单，是出于这种单日宽幅K之后，可能会有窄幅震荡（主观）的考虑。","path":"posts/20230322154501-12332498.html","date":"03-22","excerpt":"每一个做投机的人都希望自己抓住一波大行情，平日里也是天天如此渴望、幻想，但当机会来了时，却又因为各种自身主观的原因而错过，事后又会后悔不已！ 棕榈最近这200多天一直都是横着走，今天好不容易向下走了，而且还是最近200天的最大跌幅","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"3.21 不得不承认，无法量化的运气很重要","text":"绝大多数的成功读物都会孜孜不倦地教导人：只要你努力，你就能成功。但无论是科学研究还是社会经验都告诉我们，这并不是一个靠谱的结论。 看到过一篇2018年的文章，是说意大利的一个研究小组的发现那些平凡却幸运的个体，要比有天赋而不幸的个体更加成功。换言之，很多取得巨大成就的人，他们也许并非具有过人的才能，而只是运气特别好。其实在学习概率论中的马尔科夫链时就觉察到了这样的结论——求一定转移矩阵下的收敛情况，如果把人生看作一个一个的阶段，用简化的转移矩阵去模拟，你会发现，初始阶段约优越的条件，越容易得到大收益，也可以理解位成功。因而可以将人生简化为两种：一种是穷n+1代，一种类是n+1代，经过若干次迭代，富n+1代达到的财富值，穷n+1代穷尽一生，甚至是N代都无法企及。学习是我难以用语言来表述。无论是马尔科夫链还是意大利这样的科学研究得出的结果令人悲伤，甚至绝望。 成功需要什么 成功人士都有那些秘诀？从《成功》、《福布斯》、《企业家》等杂志的流行程度来看，人们对成功这一话题从不乏热情。一种深层次的假设认为：**成功是可以习得的。**这一假设基于成功人士身上具备的、促使他们走到今天的那些个性特征，例如天赋、才能、意志力、勤奋、韧性、乐观、成长型思维以及情商。这一假设不仅是这些成功学杂志得以流行的基础，也影响了我们的社会进行资源分配的方式。从工作机会到荣誉，再到政府补助，再到公共政策决策，我们都习惯于假设最成功的人也是最能干的，并将资源分配给那些有成功过往的人，而倾向于忽略那些不成功的人。 但这一假设正确吗？在整个职业生涯中，我一直致力于研究能预测成就和创造力的心理特征。虽然我已经发现，有一些心理特征（例如：激情、毅力、想象力、求知欲和开放性）确实能很好地解释成功之间的差异，但我更感兴趣的是，有多少差异是这些特征无法解释的。 近几年里，有不少研究和书籍都认为，在包括金融交易、商业、体育、艺术、音乐、文学和科学在内的多个领域中，运气和机会可能比我们以为的更重要。他们的观点是：虽然天赋也很重要，但数据表明，在试图找出成功的决定因素时，如果我们只专注于个人特征，那么就会错过成功图景中真正重要的一片拼图。 以下是一些新发现（2018）： 全世界人民的收入差异有一半可以由他们所在的居住国和该国的收入分配差异来解释； 科研成果的影响力是随机分布的，在科研生涯中，仅高生产力这一个因素对高影响力的研究成果产生的影响是有限的； 能否成为CEO会受到你叫什么名字或出生在几月的影响，在六月或七月出生的CEO比其他月份要少得多； 姓氏首字母在字母表中更靠前的人更有可能获得最高部门的职位，有中间名缩写的人更容易在智力和成就方面获得更多的正面评价； 名字更易拼写的人比名字难拼写的人更容易获得肯定； 姓名听起来更阳刚（男性化）的女性，更易在法律职业生涯中获得成功。 运气这一隐藏维度的重要性引出了一个有趣的问题：我们社会中那些成功人士取得了成就，仅仅是因为他们比较幸运吗？这一假设哪怕只是部分正确，都将对我们如何分配有限的资源产生重大影响，也将帮助富人和成功人士更有效地回报社会。 为了试图阐明这一重大问题，意大利物理学家Allesandro Pluchino、Andrea Raspisarda和意大利经济学家Alessio Biondo组成研究小组，第一次尝试量化运气和天赋对成功的影响。在他们开创性的工作中，他们提醒那些“天真的精英”，**人们低估了随机因素的作用，而实际上并没有把荣誉和奖励赋予最有能力的人。**为了进一步解释这一现象，他们提出了“玩具数学模型”，模拟了一群人在40年的工作生涯中（从20岁到60岁）职业的发展变化。 ​ 模拟初始化设定图（N=1000） Pluchino,Biondo, &amp; Rapisarda 2018 意大利研究者们设定了大量“天赋”水平不同的假设个体（“代号1”至“代号1000”），将这些个体置于一个正方形的世界中，让他们在其中经历他们的整个工作生涯。他们将“天赋”定义为让一个人能够抓住机遇的任何一组个性特征。天赋可以包括智力、技能、动机、决心、创造性思维、情商等等。这里的关键在于，更有天赋的人会更倾向于从各种机会中找出最适合他们的那一个。 在模拟开始时，所有的个体拥有相同的成功值（10“成功单位”）。每六个月，这些个体会遇到特定数量的幸运事件（绿色）和特定数量的不幸事件（红色）。当个体遇到不幸事件时，其成功值减半；当个体遇到幸运事件时，其成功值根据其天赋水平按比例增加（以反映真实世界中天赋与机会之间的关系）。 他们的发现是什么？首先，他们重现了著名的“帕雷托原理”，即二八原理。这一原理认为，少数人最终将获得大多数人的成功（Richard Koch又将其引用为“80/20原理”）。在40年模拟的最终结果中，虽然初始设定的天赋呈正态分布，成功却不是。20名最成功的个体合计占有了44%的成功值，而将近半数人的成功值维持在10单位以下（与初始设定值相同）。这一结果和来自真实世界的数据相同，甚至有迹象表明，财富成功在真实世界中的分布要更加不平衡：最富有的8个人拥有的财富等于世界上最贫穷的一半人的财富总和。 ​ 天赋的正态分布 Pluchino,Biondo, &amp; Rapisarda 2018 ​ 高度不平衡的成功值分布 尽管如此不平衡的分布看起来很不公平，如果那些最成功的人也是最有天赋最有能力的人，那么这一结果也可以合理化。那模拟结果是否是这样的呢？一方面，天赋并不是与成功毫不相干。通常情况下，天赋更高的人更有可能抓住运气提供的机遇。并且，模拟中最成功的个体天赋水平大多至少在平均值以上。所以天赋确实重要。 然而，只有天赋是绝对不够的，因为那些最有天赋的个体只有极少数也是最成功的。通常情况下，平凡却幸运的个体要比有天赋而不幸的个体更加成功。那些最成功的个体往往只有稍高于平均值的天赋水平，却在生活中充满了运气。 以下是他们模拟实验中最成功个体和最不成功个体的成功值演变图： ​ 最成功和最不成功个体的成功值演变图 Pluchino,Biondo, &amp; Rapisarda 2018 正如你所见，绿色线条表示的最成功的个体在其生命中遇到了一系列非常幸运的事件，而红色线条表示的最不成功的个体（他们甚至比那些最成功的个体天赋更高）在生命中经历的不幸事件难以想象地多。正如论文作者所说，“在不幸的怒火面前，即使拥有极高的天赋也无济于事。” 怀才不遇无论对个体还是社会而言都是不幸的。因此，我们可以做些什么来让那些最有能力利用机会的人得到他们最需要的发展机会呢？ Stimulating Serendipity（更有效的资助策略） 许多“精英主义”用以分配荣誉、资金或奖励的策略，通常基于某个人过去的成功经历。以这样的方式进行选拔无疑会导致富人更富、穷人更穷，这也被称作“马太效应”。但这是激发潜力的最有效策略吗？如果你是决策人，哪一种投资策略会更为有效呢？向几位以前有成功经历的申请人提供大笔资助，还是将资金分成很多份分给许多不那么成功的普通人？ Jean-Michel Fortin和 David Currie 曾研究过更大规模的资助是否会带来更大的成果。他们发现在研究资金和科研成果影响力之间的确存在一定的正相关，但这种关联非常微弱。更重要的是，那些获得第二笔资助的人并不比那些只获得一笔资助的人更多产，而且对于这些人而言成果通常是资助的递减函数。 论文作者们认为，比起那些以“优秀”作为遴选标准的项目，更关注目标多样性的资助策略可能会对社会产生更大的影响。在一项更新的研究中，研究人员研究了魁北克在15年期间内对12720名研究人员提供的资金。他们得出的结论是，“在论文数量和科学影响方面，研究资金集中在所谓的‘精英’研究人员手中，通常会产生边际收益递减”。 基于这项工作，模拟了运气对成功的影响的意大利研究组进行了进一步模拟。他们从上帝视角探讨了许多不同资助策略的有效性。在模拟个体的40年工作生涯中，他们每隔5年就换用一次不同的资助策略。我们已经发现，在没有任何资助的情况下，最成功的个体是那些拥有平均天赋水平却非常幸运的人。当研究组向模拟中引入多种资助策略后，会有什么结果呢？ ​ 不同资助策略的效率 Pluchino,Biondo, &amp; Rapisarda 2018 这一表格按效率递减的排序列出了40年间最有效的资助策略（例如，需要的资金最少而获得的投资回报最大）。从下至上阅读列表，可以发现那些把一定比例的资金给已经非常成功的人的资助策略是最无效的。将一定比例的资金给那些已经非常成功的个体而将余下的资金平均分配的“混合”策略相比之下要更有效一点，但这些都还不如随机分配资金的策略高效。最后这一项发现非常有趣，因为它与其他一些研究结果一致，这些结果都表明，在复杂的社会和经济环境中，机会很可能发挥了一定的作用，在这一前提下，结合了随机性的策略比基于“精英主义”的策略表现更好。 这表示，最佳资助策略应当是给每个人都分配同等数量的资金。当以每5个月1单位的速度分配资金时，60%的最有天赋个体获得了超过平均水平的成功值，以每6个月5单位的速度分配资金的结果是，100%的最有天赋个体都产生了影响力！这表明，如果一个资助机构或政府有更多的资金可供分配，那么将这些额外的资金均分给每个人，与只给一部分人相比是更明智的选择。 正如研究者总结道： “如果投资目标是奖励最有天赋的人，以使他们最终获得更高的成就，那么向所有人定期等额提供资金，会比将大额资金提供给被选中的小部分人更有效。” Stimulating the Environment（什么样的社会更容易造就成功？） 这个不可思议的意大利研究组并没有就此止步！既然拥有了上帝视角，为什么不钻研到底呢。他们还做了一些改变了个体所处环境的模拟实验。使用之前搭建的框架，他们模拟了一个非常激励人的环境，对每个人而言都充满了机遇（比如像美国那样富裕而高度工业化的国家），也模拟了一个相比之下不那么激励人的环境，只有非常少的机会（比如第二次世界大战中的国家）。以下是他们的发现： ​ 最成功个体在充满机遇的环境（上）和机遇不多的环境（下）中的成功值 Pluchino,Biondo, &amp; Rapisarda 2018 观察比较充满机遇的环境（上）与机遇不多的环境（下）中结果分布的差异。在上半幅图模拟的环境中，一部分天赋水平中上的个体能够获得非常高的成功值，天赋较高的人获得较高成功值的可能性也比较高。相反，在第二幅图模拟的环境中，整个社会的总成功值水平很低，并且只有18个个体获得了比初始值更高的成功。 结论 以上模拟实验的结果与越来越多的基于真实世界数据的研究结果相吻合，所有的结果都强烈表明，**运气和机会在决定个人的最终成功水平方面扮演着重要角色。**正如研究者指出的，奖励和资源通常都被给予那些已经被高度赞扬的人们，而这往往会导致最有天赋的那些人（比如，最有潜力因这些资源真正受益的人）反而得不到机会。在进行这样的资源分配时我们忽视了运气扮演的重要角色，实际上，运气的影响在整个创造性的过程中难以避免。研究者们认为，为了给人们更多成功的机会，以下因素都很关键：一个充满机遇的环境、良好的教育、密集的培训和行之有效的资金与资源分配策略。他们认为，任何能够影响这些因素的政策都将有助于公民的个人实现，也会在宏观层面为全社会带来更大的集体进步和更多创新。 正文来自：Scott Barry Kaufman：The Role of Luck in Life Success Is Far Greater Than We Realized 扩展阅读 我自己曾用R模拟过这个游戏，结果令人“冷静”，把一位网友的方法留在这里，他的方法比我的“科学”。 用 Shiny 写的第一个小程序。这个 Shiny 呢，简单来说是 Rstudio 里面自带的一个网页程序的编辑器。安装并打开 Rstudio，从“新建”里面找到“Shiny Web App”。 给程序取个名字，就可以开始编写了。（最简单的做法是清空窗口，把我下面的代码拷贝进去） 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889909192```## This is a Shiny web application. You can run the application by clicking# the &#x27;Run App&#x27; button above.## Find out more about building applications with Shiny here:## http://shiny.rstudio.com/#library(shiny)library(gridExtra)# Define UI for application that draws a histogramui &lt;- shinyUI(fluidPage( # Application title titlePanel(&quot;Gambler Simulation&quot;), # Sidebar with a slider input for number of bins sidebarLayout( sidebarPanel( sliderInput(&quot;size&quot;, &quot;Number of Gamblers:&quot;, min = 100, max = 1000, value = 20), sliderInput(&quot;winp&quot;, &quot;Winning Probability&quot;, min = 0, max = 1, value = 20), sliderInput(&quot;bid&quot;, &quot;Bid (per Game)&quot;, min = 100, max = 5000, value = 20), sliderInput(&quot;iter&quot;, &quot;Iterations&quot;, min = 100, max = 2000, value = 20), sliderInput(&quot;bins&quot;, &quot;Number of Bins&quot;, min = 1, max = 50, value = 30) ), # Show a plot of the generated distribution mainPanel( plotOutput(&quot;distPlot&quot;), plotOutput(&quot;distLine&quot;) ) )))# Define server logic required to draw a histogramserver &lt;- shinyServer(function(input, output) &#123; output$distPlot &lt;- renderPlot(&#123; gamblers = rep(10000,input$size) for (i in 1:input$iter)&#123; gain = (2*rbinom(input$size, 1, input$winp) -1)*input$bid gamblers[gamblers&gt;=input$bid] &lt;- gamblers[gamblers&gt;=input$bid] + gain[gamblers&gt;=input$bid] gamblers[gamblers&gt;100000] &lt;-100000 &#125; bins &lt;- seq(min(gamblers), max(gamblers), length.out = input$bins + 1) # draw the histogram with the specified number of bins hist(gamblers, breaks = bins, col = &#x27;darkgray&#x27;, border = &#x27;white&#x27;, ylim = c(0,input$size), xlab = &quot;Wealth&quot;) &#125;) output$distLine &lt;- renderPlot(&#123; gamblers = rep(10000,input$size) for (i in 1:input$iter)&#123; gain = (2*rbinom(input$size, 1, input$winp) -1)*input$bid gamblers[gamblers&gt;=input$bid] &lt;- gamblers[gamblers&gt;=input$bid] + gain[gamblers&gt;=input$bid] gamblers[gamblers&gt;100000] &lt;-100000 &#125; bins &lt;- seq(min(gamblers), max(gamblers), length.out = input$bins + 1) # draw the histogram with the specified number of bins plot(sort(gamblers), type = &#x27;l&#x27;, xlab= &quot;Wealth&quot;, ylab = &quot;Number of Gamblers&quot;)+ abline(h = 10000, col = &quot;red&quot;) &#125;)&#125;)# Run the application shinyApp(ui = ui, server = server)``` 之后点击右上角的 Run app，就可以出现属于自己的模拟器。 设定 我们假设有 1000 个玩家，每人手里有 10000 元的筹码，可以用来赌博。 每一局游戏，玩家都可以抵押 500 元的筹码。输了，筹码不退还；赢了，筹码翻倍。 输赢的概率各占 50%。 所有玩家一共进行 100 局游戏。一旦任何玩家筹码为0，必须中途退出游戏。 好，开始了游戏设定，我们按照设定模拟一下，看看会发生什么吧。100次游戏之后，大家的财富分配是怎样的呢？ 右边的两张图分别是 1000 位玩家的财富柱状图和排位图。红线表示初始资金 10000元 的位置。我们看到，这个时候的财富分配还比较平均，有大约 55%的人财富在 10000 以上。 实验 有了这个模拟器，我们可以改变原始游戏的一些参数，看看会发生什么不同的结果。 【实验一：加大赌注】 之前我们说，每场游戏的赌注是500元。如果游戏的赌注增加，会对最后的结果有怎样的影响？ 赌注增大到 1000 元。游戏结束时，有近 300 人余额为 0。余额 10000 以上的人数约为50%。 赌注增大到1500元，游戏结束时有近 600 人余额为 0。余额 10000 以上的人数小于40%。 现在我们增加赌注到 3000 元看看 【讨论】 赌场只需要极小地改变游戏胜率，就可以极大地改变游戏者的结果。把胜率从50%改到45%，游戏者回本的概率就从55%降低到 20%左右。 小胜率 × 多次玩= 倾家荡产 【实验三：增加赌博持续时间】 我们知道，赌博有其心理成瘾性，所以好赌之人往往很难戒掉赌博这个恶习。放在我们的例子中，如果我们让游戏持续 100 局以上，会发生什么呢？ 游戏持续 1000 局，游戏结束时有500多人余额为0。余额 10000 以上的人数约为40%。 游戏持续 2000 局，游戏结束时有600多人余额为 0。余额 10000 以上的人数在25%左右。 【讨论】 在赌场中，没有人是常胜将军。你从人生前 100 局游戏中获得的收入，很可能会在第 500 局之前消失殆尽。 这个实验的局限性在于，我们假设赢钱的人要一直玩下去，玩到游戏结束为止。而输钱的人输到倾家荡产就会退出。这个假设，是不是合理呢？各位又怎么看？ 读到这，有不少读者朋友可能都会好奇这个模拟器的原理。其实，这是我刚才用半个多小时拿 Shiny 自己写的，大家可以通过这个链接，自己改改参数，随手玩一玩 这是赌徒之殇（Gambler’s Ruin Problem ），从某种意义上来讲，赌资大小决定胜率。这招叫以力破巧，俗称用钱砸死你。 长袖善舞，多财善贾——韩非子","path":"posts/20230321233624-22cb1254.html","date":"03-21","excerpt":"","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"3.21 今天开始申请准生证","text":"今天开始申请孩子的准生证。 老婆填的表。","path":"posts/20230321150725-119a607d.html","date":"03-21","excerpt":"","tags":[{"name":"育儿","slug":"育儿","permalink":"http://kisma77.github.io/tags/%E8%82%B2%E5%84%BF/"}]},{"title":"3.21账户到7万了","text":"今天账户站上7万 交易频率还是比较高，频率太高会导致佣金增加，而且亏损次数增加后整体盈利会减少，最主要的，会养成坏习惯，要再降低。","path":"posts/20230321150404-d6f02f35.html","date":"03-21","excerpt":"今天账户站上7万","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"如何锻炼交易中不紧张的能力？","text":"操盘中时常会紧张，担心亏钱，如何锻炼交易中不紧张的能力呢？ 剖析问题： 紧张是担心亏钱；亏钱的原因是做反了方向……一步一步递归下去。 事实上递归下去是表面，深层次的是面对不确定的焦虑，进而，将紧张进行抽象、定义：紧张是对可能会出现坏到你无法承受的后果的焦虑。 注意这里的**“可能会出现坏到无法承受的后果”**，它代表这种结果尚未出现，它可能出现，也可能不出现，是我们一厢情愿的想着这种结果出现带来的伤害。 现实生活中我们走过或见过铁轨，你在这根铺设在路基上的铁轨上能健步如飞，甚至还能负重拎个包——即便你不能如此，但也能毫无紧张地在它上面走。 但将这根铁轨放到十米高空，铁轨还是那么宽、那么长、那个硬度，但你双腿颤抖、寸步难移，这就叫“紧张”。 上面提到造成紧张的根源是对可能会出现的坏到我们无法承受的后果的焦虑，那解决紧张的方法自然也就在这句话里面。 要么，别挑战自己承受不起后果的事。比如别横穿没有斑马线且车流不息的马路；别押上全部身家在带杠杆的市场里满仓操作。 要么，减少“不慎”，增加赢面。比如，利用红灯策略，增加赢的概率。 要么，增加容错率。比如每次下单都是很轻的仓，即便亏100%也不至于破产。 如果你只有8000元的本金，去买一张螺纹钢（2023.3.22，RB2305的价格是4152元，按照期货公司给我的杠杆率来计算，一张螺纹钢需要的保证金大约￥7010），你有[900.00元]的”容错区间“，如果你每次亏损控制在300元内，你只有2次做错的机会，此时由于本金少带来的”稀缺心理“导致你紧张。但如果你的本金不是8000元，而是80000元，买一张RB单子，你紧张吗？你当然不紧张，因为即便出现极端情况——停板[3727,4648]，你也知道自己不会”爆仓“，这是简单的通过算术进行评估的问题。 需要指出的是，容错率是容故障（Fault），而并非容错误（Error） 你拥有足够大的容错区间，这足够厚的安全垫能让你不紧张。正所谓“手里有粮，心里不慌”。 心中不慌就能稳，稳到根本就不会担心，甚至也根本没有“不慎”的心理负担。 一件事情做到了即使“不慎”都不会做坏的程度，你就不会紧张了。 那这够了吗？ 当然不够，紧张的根源，面对、处理不确定事件时，你相不相信你选择相信的东西里也会出现意外。 价格是一个随机过程，它具有很大的不确定性（Uncertainty），这无疑会给我们带来安全感的匮乏，看一个人能力的大小，本质上是看这个人能够承受的不确定性有多大，能在多大范围内构造秩序。我们被不确定性包围着，比如投资中的风险，商业中的市场变化，生活中的时代颠簸等等，世界运行的规律就是不确定性，越有能力的成年人，越能在充满不确定性中的环境中生存，越能获得更高的收益和回报，如果不想承担不确定性，那就要接受自己的人生局限。 世界上最不紧张的人，并不是能力最好、选择余地最大的人，而是相信无论出现什么样的“意外”、“失误”，哪怕一时有各种痛苦和损失，但兜兜转转最终（统计意义下的）结果一定是好的。 我喜欢用《数字信徒》中的话来表述这种信仰： “我们都会在生命中的某个时刻经历一次思想上的飞跃，使我们从犹豫不决迈向勇敢实践的道路。这种飞跃会引领我们登上一个崭新的人生舞台…对于我们来说，这种信仰跟宗教并无二异。虔诚的信徒们都怀揣着信仰，什么也不能阻挡他们对于宗教的执著。我们也是一样，那份对于统计学的信仰未曾改变。” 一个了解意外，相信意外，相信意外最终是站在自己一边的人，是真正对紧张免疫的人。 我们学习概率论、统计学，相信数字，甘心情愿做数字信徒，相信任何的意外，背后是对你的非恶意。 在统计之下，出了意外，哪怕直接的当下失败了，也相信，这失败在最后好过成功，并且最终统计会胜利。 牢牢的相信这一点，这一点就会是事实。 牢记不确定性是世界运行的规律，在不确定性中做出合乎统计之下有利于自己的行为是一种品质。 这种品质，它美极了。","path":"posts/20230321143145-cbc671e5.html","date":"03-21","excerpt":"","tags":[{"name":"交易心理","slug":"交易心理","permalink":"http://kisma77.github.io/tags/%E4%BA%A4%E6%98%93%E5%BF%83%E7%90%86/"}]},{"title":"3.20 记一次成功地从“红灯策略”中获利","text":"今天是周一，上午开始做空棕榈油2305合约，每张单子盈利1980元。但过程并不容易。 早上9点开盘后，价格上涨至0.3%附近，我看涨起来了，去做多，随后快速出现了亏损，于是，做空，但随后又出现了亏损，我胡乱操作了两次，都是亏损. 后来我突然想起百分百红灯策略,转而做空，随后盈利，一直到收盘都没平仓。 白白浪费了460块钱，还有20块钱的佣金。 红灯策略违背直觉，需要多加练习，但今天即使想起执行红灯策略，并立即按照策略执行，挽回了损失。","path":"posts/20230320153028-c9eeb6a.html","date":"03-20","excerpt":"今天是周一，上午开始做空棕榈油2305合约，每张单子盈利1980元。但过程并不容易。 早上9点开盘后，价格上涨至0.3%附近，我看涨起来了，去做多，随后快速出现了亏损，于是，做空，但随后又出现了亏损，我胡乱操作了两次，都是亏损.","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"3.19 从西二旗搬到了崇文门","text":"昨天（3.18.周六）从西二旗搬到了崇文门新世界这边，为了在北京医院生产方便。 我们在西二旗住了将近9年，一开始是住在融泽嘉园，后来去年业主卖房，我们搬到了金域华府。金域住着挺好，但因为采暖不好，冬天太冷，加上平时来北京医院产检以及五月份要生孩子，过来太远，不方便，于是就决定搬过来住。 为了便利，我们要求必须符合： 朝南且阳光要充足——将来宝宝出生后晒黄疸很重要； 有电梯——岳父岳母要过来照顾，他们年龄大了，加上孕妇行动不是很方便，老式的六层板楼虽然采光、户型都没问题，但上下楼不方便。所以必须要有电梯。 至少是两居室，少了住不下。 崇文门这边靠近“中心”了，建设比较早，房子大多是七八十年代建的，老房子小区比较多，户型也不好。最后在一个较新的商品房小区里找到一个两居室，客厅、两个卧室都朝南，这边也有不少回民，还有清真寺，倒是不错！月租金9300元。房子不错，就是不知道当时开发商是不是脑子进水了，电梯只到次顶层，我需要再上一层的楼梯，一共16个台阶。其它房子实在是没满意的——北京的居住体验实在不怎么样，尤其是那些老式塔楼，这是目前能承受的价格范围内的最优选择了。 找的搬家公司，搬家费用780元，但因不能跟车走，我自己打车跟着过来，花了140元。 780+140=920（元） 现在搬家公司是新能源车，车厢没有窗户，因此车厢不能坐人，搬家的人有三个，我就坐不下，不能跟车了，我只好打车，我让中介等搬家公司，到了中介小哥帮我开门先搬着，我到的时候搬的差不多了。我到了30分钟他们就搬上楼去了。 媳妇没有和我一起打车来，她留在原来的房子里等房东做物业交割，加上怀孕后她打车会晕车，选择做地铁来。搬完后我简单把床弄好后，媳妇也到了，我俩就下楼吃东西。 单元门前就是一个小区运动场地 这个场地还挺好，有羽毛球、乒乓球，以后岳父就可以在这里打球了。 随后我俩去国瑞城吃饭，看到路上车水马龙的，有一种农民第一次进城的感觉。 我俩住在西二旗那边那么多年，晚上就没出来逛过——那边实在没有什么可逛的，到了晚上就一个昌发展商业大楼有点人气，四周都不热闹，也就都在家待着了。 今早醒来见到外面的天空和云，很开心 昨天开始到今天都是归置收拾东西，再是半天一天的就收拾好了。累得我全身散了架一样，媳妇也跟着弄点小件零碎，估计也很累。 晚上给媳妇洗了个脚，她也跟着收拾了一些，热水泡泡脚能解乏。我给她洗脚时她偷偷拍照或者录视频，我偷着乐，哈哈。 这两天点点在肚子里活动的力度有点大，一天比一天大了，五月份就要生了，哈哈，一定是胖乎乎的小可爱。 很累了，晚安。","path":"posts/20230319230436-e763f81d.html","date":"03-19","excerpt":"","tags":[{"name":"搬家","slug":"搬家","permalink":"http://kisma77.github.io/tags/%E6%90%AC%E5%AE%B6/"}]},{"title":"态度系统","text":"从来，“态度决定一切”这样的话经常听到，一开始认为是百无一用的“鸡汤”，但当我看了心理学名作《态度系统与社会影响》后，知道了它不是鸡汤，或者说它是营养价值很高的鸡汤。 心理学中“态度”的解释 是个体基于过去经验对其周围的人、事、物持有的比较持久而一致的心理准备状态或人格倾向。 当态度是由于某种经验、学科理论而建立的，而不是道听途说，他们就更具有稳定性，更能引发行为。我们坚定我们所相信的，同样地，我们也会逐步相信我们坚持的东西。即态度能影响行为，反过来，行为也能决定我们的态度。 态度的组成部分 态度包含认知、情感和行为意向三个部分。 认知指个体如何知觉事物，认识其概念内涵，基本上由对事物的知识或信息构成，反应个体对事物的相信与不相信。情感指个体对事物的评价，反映个体对事物的喜欢与不喜欢。行为意向指个体对事物的行为倾向，反映个体对事物的行为意图及准备状态。三部分彼此协调统一。 当认知与情感相矛盾时，行为意向与情感的一致性要大于与认知的一致性。不一致时就会出现认知不协调，从而产生矛盾心理。 态度的特点： （1）有特定的对象； （2）在后天的生活中习得，可以通过他人或媒体等间接经验形成，也可形成于个体的直接经验，主要通过联想、强化、模仿三种过程获得； （3）不外显，是一个心里意向； （4）一旦形成，相对稳定； （5）对个人的内心活动和外显行为具有激发、调整和协调作用。 本质上，态度就是对某种特定目标的评价倾向。它是一个人对某种事物或者人从喜欢到不喜欢，或从赞成到不赞成的一个评价。 态度就是我们喜欢什么，不喜欢什么，我们推崇什么，讨厌什么，以及我们评价自己与环境关系的方式。它是倾向性，就意味着可习得，以某种特定方式思考某个事物、某个人或某个问题的倾向。这些新形成的关于某个科学、某个理论、某个组织的正面态度，就使这个人将来更容易去接收支持这些学科、理论、组织的信息。当然，信念和态度的改变也许不会直接引起行为的改变，但它往往奠定了后来行为变化的基础，使这个人更容易受到后续影响的作用。 要探究态度如何引起行为的变化，我们需要先来看看态度系统。 我们对社会事物的5种反应。 第一种是行为本身，“我在与朋友交谈时坚持18岁是可以饮酒的年龄”，这里的“交谈”就是行为，“我给国会议员写信”也是行为，表达的主张、观点是“反对现在的饮酒年龄限制”。 第二种是行为意向，指在做某事之前的期望和具体的行动计划，这些计划可能从不会实施。“我会给能担责的18岁的人啤酒喝”，这里的“会”只是一种计划、意向，还没有实施行为。 第三种是指引我们行动的观念、信念或者认知，包括关于某个事物和个体“应该”如何对待它的一些信念和知识。“适量饮酒是一种社交行为”这是一种观念、认为、认知。（见行为改变系统、信念价值系统。） 第四种是情感反应、情绪或“本能的感受”，反映了个体处在生理唤醒水平上的态度，如快感，悲伤等。“我喜欢在社交场合喝酒”，这是态度，是情感的反应。 第五种是态度本身，即个体对某种事物的整体评价，也就是基于以上4个方面的综合评估后得出的一个价值判断。 因此，将态度广义定义为：建立在认知、情感反应、行为意向以及过去行为基础上的评价性倾向，这些都可以改变我们的认知、行为、情感反应，以及未来的行为意向和行为本身（Zanna &amp; Rempel,1988). 这一定义意味着态度的各个部分都是高度相关的（参见数学上的相关性）。认知和态度与我们所谓的对某个事物的心理表征密切相关。情感反应和外在行为可以因事物在我们头脑中的出现而产生。反过来，他们又会为我们头脑中关于这一事物的心理表征注入新的信息。因此，关于某个事物和问题的态度、行为、认知和情绪就构成了一个人特有的整体反应系统。因为态度是这个态度的整体反应（比如，我喜欢），所以我们就称这个系统为态度系统。如图1.1 结合交易，有 “树立正确的目标”是一种态度，也是一种价值观，正确的价值观能实现正效价，在有利于达成目标的效价下，会产生合适的动机。当认知不协调时，产生认知失衡，从而导致矛盾心理出现，改变认知过程将自我的不切实际的需要变为客观事实的要求，在这样的态度下就能实现认知和谐。","path":"posts/20230316235207-ecce70be.html","date":"03-16","excerpt":"","tags":[{"name":"认知心理学","slug":"认知心理学","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5%E5%BF%83%E7%90%86%E5%AD%A6/"}]},{"title":"3.16 今天收拾东西，准备搬家","text":"准备搬家了，今天开始收拾东西打包，目前还没收拾完，但已经有50多个箱子了，东西还是蛮多的。 希望早点能有钱买套自己的房子，这样就不用每年都为搬家发愁了。 赚钱，其实蛮难的，尽管学了概率，但赚钱还是不容易，甚至还是很难，我真后悔这三四年挥霍掉的那大百万，现在后悔晚了，以后要好好珍惜。","path":"posts/20230316230115-c10642a6.html","date":"03-16","excerpt":"准备搬家了，今天开始收拾东西打包，目前还没收拾完，但已经有50多个箱子了，东西还是蛮多的。 希望早点能有钱买套自己的房子，这样就不用每年都为搬家发愁了。","tags":[{"name":"投机","slug":"投机","permalink":"http://kisma77.github.io/tags/%E6%8A%95%E6%9C%BA/"}]},{"title":"3.15 曾有个人那么爱我","text":"翻看照片，曾经她是那么的爱我，可惜我不懂或者说我辜负了她的一片真心。 后来 我总算学会了 如何去爱 可惜你 早已远去 消失在人海 后来 终于在眼泪中明白 有些人 一旦错过就不再 多年前的那个仲夏 你吻我的那个夜晚 让我往后的时光 每当有感叹 总想起 当天的星光 那时候的爱情 为什么就能那样简单 而又是为什么 人年少时 一定要让深爱的人受伤 在这相似的深夜里 你是否一样 也在静静追悔感伤 如果当时我们能不那么倔强 现在也 不那么遗憾 你都如何回忆我 带着笑或是很沉默 这些年来 有没有人能让你不寂寞 后来 我总算学会了 如何去爱 可惜你 早已远去 消失在人海 后来 终于在眼泪中明白 有些人 一旦错过就不再 你都如何回忆我 带着笑或是很沉默 这些年来 有没有人能让你不寂寞 后来 我总算学会了 如何去爱 可惜你 早已远去 消失在人海 后来 终于在眼泪中明白 有些人 一旦错过就不再 后来 我总算学会了 如何去爱 可惜你 早已远去 消失在人海 后来 终于在眼泪中明白 有些人 一旦错过就不再 永远不会再重来","path":"posts/20230315233740-c65a8d79.html","date":"03-15","excerpt":"翻看照片，曾经她是那么的爱我，可惜我不懂或者说我辜负了她的一片真心。","tags":[{"name":"情感","slug":"情感","permalink":"http://kisma77.github.io/tags/%E6%83%85%E6%84%9F/"}]},{"title":"3.13 房子定下来了","text":"今天上午去医院产检，完事后顺便去把房子租下来了。 9300元/月，两居室 签完合同后我俩在国瑞城吃了个饭就做地铁回来了，到家15:30","path":"posts/20230313172759-e7a2cd04.html","date":"03-13","excerpt":"今天上午去医院产检，完事后顺便去把房子租下来了。 9300元/月，两居室","tags":[{"name":"租房","slug":"租房","permalink":"http://kisma77.github.io/tags/%E7%A7%9F%E6%88%BF/"}]},{"title":"3.11 今天去崇文门找房子","text":"今天去崇文门那边找房子，属于“城里”，房子大多是老房子，很破，新的高档的商品房小区两居室得13000以上，老房子两居室8000以上。 上午起来后去姐姐家给姐过程日，一大家子吃的火锅。 吃完饭后姐姐带着两个孩子陪我们去找房子，属于“城里”，房子大多是老房子，很破，新的高档的商品房小区两居室得13000以上，老房子两居室8000以上。我们的要求是朝南或者要有阳光，然后是必须要有电梯，两居室。看了一天，就富贵园那边有个“黑8”户还算可以，朝西，但在高层，能晒到太阳。 在另一个商品房小区（忘了名字了）看了一套，很好，价格也合适，但这个小区居然所有的顶层都没电梯——电梯到次顶层，所有的顶层都要走楼梯上去，一共16个台阶，这给以后的婴儿车、岳母上下楼带来困难，不能要。 可惜了，不然户型（全朝南）、价格、采光、客厅大小都很好。 晚上回来后帮媳妇洗了个脚，走了一天她很累，泡个热水脚舒服些，跟着我受苦了。","path":"posts/20230311231017-34e19c8a.html","date":"03-11","excerpt":"","tags":[{"name":"租房","slug":"租房","permalink":"http://kisma77.github.io/tags/%E7%A7%9F%E6%88%BF/"}]},{"title":"3.10 忆一段往事","text":"今天去拍孕妈照，地方在海淀西四环边上五路居那边，刚好就在我十多年前住的小区后面，有些东西可以记录在这里。 早上上了车后我就打盹，醒来时车子正好拐进小区的路口，我一眼就识别出来这个小区，2011年年底我搬离那里，我从车里看到了当年住的那房子的窗户。 更多与这房子有关的人、物，不能在这里记录。时间过的真快，一晃十余年了，有些东西平日里已放下，但触景还是会动情。 小区后面已经干枯的河床 拍照后，看照片时，发现我脸上因过敏起了两颗红痘， 工作人员：“别担心，我们会P一下。” “使用Photoshop吗？”我接话随口一问。 “是的。…呀，先生您还知道Photoshop啊!” “以前我做过平面设计”我回答道。 拍完照后老婆问我以前真做过平面设计？我跟她说了我刚毕业时的一段往事： 大学毕业后一时找不到合适的工作，生活所迫就在紫竹桥附近找了一个电话业务，我倒不会电话业务，我贪图的是“无责任底薪1000块+提成”，1000块一个月，这对当时的我来说简直就是活命钱。两手空空的人，最容易妥协，最容易先顾眼前。 那份工作的业务说起来很简单，老板（公司）以XX部委的名义，给我们写话术，我们就拿着话术打电话给外地做给排水行业相关的企业，拉广告，拉到广告后我们有提成一定的提成（多少%早忘了）。说是公司，其实是皮包公司，当时像这种打着国家XX部招牌拉广告的业务实在太多，还有许多电视购物的小公司也在北京，记得当时出过一本小书叫《恐怖的010》，说的就是北京电话业务和电视购物的事。 看起来很简单，但对于刚毕业的我来说并不容易。刚开始的时候，电话接通后我连“您好”都不敢说，我当时的那种新手窘迫感在其后的数年里招牌员工时一次又一次的见到，我知道他们此时的心情，总会耐心把自己的心得、方法通过轻松的方式传授给他们。从结果看，效果不错。 我在这个皮包公司干了1个月，一单没开，但我模仿学习很快，已经不害怕打电话了，我忘了自己名校毕业，竟然慢慢的融入了那种环境，开始每天为开单努力着。人在特定的环境中确实容易从众，失去自己原有的目标。 过了两三个月，我和公司里的大多数人已经很熟悉了，我当时会抽烟，抽烟的时候认识了一位做设计的，一来二去熟悉后，跟他聊天，知道了他的工资比我们业务的高（他只有设计的工资，没有提成，不过这个业务在当时就已经被坐烂了，出单很难的）。出于真心，也出于交际，我总对他说羡慕他有本事，工资高，开始时他总是笑笑，对我说“你开一单够我干半年！”来安慰我。时间一长，熟悉后，我再羡慕他，他告诉我说那玩意不难，他做的是PS里最简单的，只需要会抠图和拉两下蒙版就行。 说者无心，听者有意。下了班后我就在网上检索“抠图”、“Photoshop”这些关键字。我找到了Photoshop论坛，在论坛上看网友发的抠图教程，当时是Photoshop 7.0版本，搜到后就认真学习了一晚上。第二天我兴冲冲的去跟那位做设计的同事说我想学Photoshop，问他可不可以教我，并把自己头天晚上在论坛上学习的事跟他说了。他有些不愿意，说那是一门技术，不是在网上随便看看就能学会的。我知道关系不到位，但我当时没钱请他吃饭喝酒，只要自己晚上回去在网上学抠图。 我想学抠图，于是就时不时的借机去设计室（公司是在住宅楼里，其实就是另一个房间，和财务一起）偷瞄他的屏幕，目的是看看他在抠什么样的图。然后下班后在网上搜类似的图下来，对照着论坛帖子里的教程一步一步的学着抠图。 当时网络没现在这么好，我是ADSL，网速慢，但我学东西很快。花了一周不到的时间，我就明白了业务方需求的“抠图”大概框架。我了解了图层、蒙版、颜色通道、新建图层等功能，但跟着网上的教学步骤能使用钢笔工具、磁性套索、魔术棒工具等菜单项来抠图。虽然像个学走路的孩子那样歪歪扭扭，时而摔一跤，但当时的感受是“还行，会了点”。 新的一周开始后，我一狠心，打算出点血请那个设计吃拉面喝啤酒！（当时大碗拉面好像是3块钱一碗，具体的忘记了），下班后我请他在紫竹桥摩托罗拉大楼斜对面的一个小餐馆里喝酒。就着啤酒，我跟他说我打不来电话，还是想学抠图，学会了可以做点“轻松”的活，并告诉他我学会了会去别的公司找抠图的工作。几瓶啤酒下肚后，也许是我的真诚，也许是酒精的作用，在听完我的“一周学习经历”后他惊呆了，答应可以找机会教我。 他确实在某些下班的时间里在公司的电脑上教我，但一直只教简单的钢笔工具和魔术棒。但他要求我一定要“熟练”，比如钢笔工具下切换移动工具的快捷键，总之就是每次都告诉我必须要熟练使用快捷键在不同的工具之间快速切换。 我有些怀疑他在敷衍我，还好我自己在家里天天泡在论坛里学各种技能，甚至都学到了“进阶”了。 快到年底的一个周五，下了班后他找我喝酒，我当时兜里没钱，有些措手不及。两手空空的人，最容易猝不及防啊，我不敢答应。他可能看出了我的窘迫，说他请客。喝了两瓶啤酒后他告诉我他要回老家结婚了，可能一时半会儿不回北京了，他说他知道我一直想做他的活儿，看我这人还算讲究，决定帮我一下，他说他走之前会向老板推荐我去替代他。 周一早上上班后老板进来就跟财务（他老婆）发脾气，后来旁边的人议论说还没放假但那个设计回老家结婚去了，工钱都自己PS老板的签名全结了，估计不会回来了，要赶进度却没有设计可用，老板着急。 他问我知不知道为啥他只教我简单的，没教很多。我说不知道。他说这份工作主要的是把那些水泵龙头从客户发来的照片上抠下来放在杂志上，其它的工具用到的时间少，只要能快速用钢笔工具把图抠出来，发给旁边的编辑杂志的同事就可以。 他走后我做了两个月的设计后找到了新工作就辞职了，确实，90%以上的时间都只用到钢笔工具和魔术棒，连套索工具都很少用到。 这位哥们当晚喝酒时说了很多，我印象最深的是他说的一句话，总结下来大概意思是说很多工作不需要什么都会，而且工作大都有一个规律，就是往往由少数高频使用的核心技能，和大量低频使用的边缘技能两个部分组成。 从某种程度上来讲，大学四年里学的一些课都没有这句话给我的帮助大。我时长品味这句话，也不断地用实践证明了可行性，甚至还用到了学习一些新的学科上，确实效率很高，多年后我听到张颢教授上课讲学习理念时提到的“竹竿效应”时，我总会想起这位教我抠图的同事。 我简单跟老婆讲完我当初的这段工作经历，我说：“虽然这哥们只教我简单的钢笔抠图，但我在论坛上学会了许多Photoshop的技能，后来在公司（指后来的正式工作）我们部分设计忙不过来时我还会帮她们做图，我还教我们的编辑们简单的Photoshop，这样她们做内容的时候就自己做海报。” 老婆说：“原来这么回事，我还说你怎么会Photoshop的呢。” “我再没有见过这位教我抠图的哥们。”我说。","path":"posts/20230310215642-b10f8abc.html","date":"03-10","excerpt":"今天去拍孕妈照，地方在海淀西四环边上五路居那边，刚好就在我十多年前住的小区后面，有些东西可以记录在这里。 早上上了车后我就打盹，醒来时车子正好拐进小区的路口，我一眼就识别出来这个小区，2011年年底我搬离那里，我从车里看到了当年住的那房子的窗户。 更多与这房子有关的人、物，不能在这里记录。时间过的真快，一晃十余年了，有些东西平日里已放下，但触景还是会动情。","tags":[{"name":"平面设计","slug":"平面设计","permalink":"http://kisma77.github.io/tags/%E5%B9%B3%E9%9D%A2%E8%AE%BE%E8%AE%A1/"},{"name":"工作经验","slug":"工作经验","permalink":"http://kisma77.github.io/tags/%E5%B7%A5%E4%BD%9C%E7%BB%8F%E9%AA%8C/"}]},{"title":"3.09 着手搬家","text":"为了5月份的分娩，要搬到北京医院附近去住。 但我目前还没有找房子，明天开始找，周末去看房。北京医院那边的房子都比较老，价格也不低，新小区的价格更是高得离谱。 看着中介网站上的房价，两手空空的人，最容易猝不及防了。 点点越来越大了 今天我从书房出去，走到客厅看到老婆在沙发上，发现肚子比昨天更大了，点点越来越大了，老婆给他测心跳，对我说：“点点好活泼啊！” 最近几天天气不错，每天中午吃完饭都陪老婆出去遛弯。今天去盒马时，我说要买束花给她，结果她不让买。 “三八节嘛，买一小把吧” “不买，我买草莓吃吧！嘿嘿”","path":"posts/20230309004727-971ead65.html","date":"03-09","excerpt":"","tags":[{"name":"搬家","slug":"搬家","permalink":"http://kisma77.github.io/tags/%E6%90%AC%E5%AE%B6/"}]},{"title":"不确定性原理的前世今生·数学篇（完）","text":"到二十世纪末，人们对「信号」这个词的理解已经发生了微妙的变化。如果在二十世纪上半叶的时候提到一个信号，人们还倾向于将它理解为一个连续的函数。而到下半叶，信号已经越来越多地对应于一个离散的数组。毫无疑问，这是电子计算机革命的后果。 在这样的情形下，「不确定性原理」也有了新的形式。在连续情形下，我们可以讨论一个信号是否集中在某个区域内。而在离散情形下，重要的问题变成了信号是否集中在某些离散的位置上，而在其余位置上是零。数学家给出了这样有趣的定理： 一个长度为 N 的离散信号中有 a 个非零数值，而它的傅立叶变换中有 b 个非零数值，那么 a+b ≥ 2√N。 也就是说一个信号和它的傅立叶变换中的非零元素不能都太少。毫无疑问，这也是某种新形式的「不确定性原理」。 在上面的定理中，如果已知 N 是素数，那么我们甚至还有强得多的结论（它是 N. Chebotarev 在 1926 年证明的一个定理的自然推论）： 一个长度为素数 N 的离散信号中有 a 个非零数值，而它的傅立叶变换中有 b 个非零数值，那么 a+b &gt; N。 不幸的是这里「素数」的条件是必须的。对于非素数来说，第二条命题很容易找到反例，这时第一条命题已经是能够达到的最好结果了。 这些定理有什么用呢？如果它仅仅是能用来说明某些事情做不到，就像它字面意思所反映出的那样，那它的用处当然相对有限。可是——这无疑是辩证法的一个好例证——这样一系列宣称「不确定」的定理，事实上是能够用来推出某些「确定」的事实的。 设想这样一种情况：假定我们知道一个信号总长度为 N，已知其中有很大一部分值是零，但是不知道是哪一部分（这是很常见的情形，大多数信号都是如此），于此同时，我们测量出了这个信号在频域空间中的 K 个频率值，但是 K&lt;N （也就是我们的测量由于某些原因并不完整，漏掉了一部分频域信息）。有没有可能把这个信号还原出来呢？ 按照传统的信号处理理论，这是不可能的，因为正如前面所说的那样，频域空间和原本的时空域相比，信息量是一样多的，所以要还原出全部信号，必须知道全部的频域信息，就象是要解出多少个未知数就需要多少个方程一样。如果只知道一部分频域信息，就像是只知道 K 个方程，却要解出 N 个未知数来，任何一个学过初等代数的人都知道，既然 K&lt;N，解一定是不唯一的。 但是借助不确定性原理，却正可以做到这一点！原因是我们关于原信号有一个「很多位置是零」的假设。那么，假如有两个不同的信号碰巧具有相同的 K 个频率值，那么这两个信号的差的傅立叶变换在这 K 个频率位置上就是零。另一方面，因为两个不同的信号在原本的时空域都有很多值是零，它们的差必然在时空域也包含很多零。不确定性原理（一个函数不能在频域和时空域都包含很多零）告诉我们，这是不可能的。于是，原信号事实上是唯一确定的！ 这当然是一个非常违反直觉的结论。它说明在特定的情况下，我们可以用较少的方程解出较多的未知数来。这件事情在应用上极为重要。一个简单的例子是医学核磁共振技术（很多家里有重病患者的朋友应该都听说过这种技术）。核磁共振成像本质上就是采集身体图像的频域信息来还原空间信息。由于采集成本很高，所以核磁共振成像很昂贵，也很消耗资源。但是上述推理说明，事实上核磁共振可以只采集一少部分频域信息（这样成本更低速度也更快），就能完好还原出全部身体图像来，这在医学上的价值是不可估量的。 在今天，类似的思想已经被应用到极多不同领域，从医学上的核磁共振和 X 光断层扫描到石油勘测和卫星遥感。简而言之：不确定性可以让测量的成本更低效果更好，虽然这听起来很自相矛盾。 糟糕的是，本篇开头所描述的那个不确定性定理还不够强，所能带来的对频域测量的节省程度还不够大。但是数学上它又是不可改进的。这一僵局在本世纪初被打破了。E. Candès 和陶哲轩等人证明了一系列新的不确定性原理，大大提高了不等式的强度，付出的代价是……随机性。他们的定理可以粗略叙述为： 一个长度为 N 的离散信号中有 a 个非零数值，而它的傅立叶变换中有 b 个非零数值，那么 a+b 以极大概率不小于 N/√(log N) 乘以一个常数。 这里的「极大概率」并不是一个生活用语，而是一个关于具体概率的精确的数学描述。换言之，虽然在最倒霉的情况下不确定性可以比较小，但是这种情况很罕见。一般来说，不确定性总是很大。于是可以带来的测量上的节约也很大。 这当然也是一种「不确定性原理」，而且因为引入了随机性，所以在某种意义上来说比原先的定理更「不确定」。在他们的工作的基础上，一种被称为「压缩感知」的技术在最近的五六年内如火如荼地发展起来，已经成为涵盖信号处理、信息提取、医学成像等等多个工程领域的最重要的新兴工程技术之一。 不过，这些后续的发展估计是远远超出海森堡的本意了。 《不确定性原理的前世今生·数学篇》系列: 不确定性原理的前世今生·数学篇（一） 不确定性原理的前世今生·数学篇（二） 不确定性原理的前世今生 · 数学篇（三） 不确定性原理的前世今生 · 数学篇（四） 四篇雄文完结。 本文转载自不确定性原理的前世今生 · 数学篇（完）, 原作者博客","path":"posts/20230308232204-9dea350e.html","date":"03-08","excerpt":"","tags":[{"name":"数学","slug":"数学","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E5%AD%A6/"}]},{"title":"不确定性原理的前世今生·数学篇（三）","text":"不确定性原理事实上不是一个单独的定理，而是一组定理的统称。基本上，凡是刻划一个信号不能在时空域和频域上同时过于集中的命题都可以称为不确定性原理，由于这里「集中」这一性质可以有不同的数学描述，也就对应着不同的数学定理。但是在所有冠以「不确定性原理」之名的定理中，最著名的当然是海森堡 (W. Heisenberg) 在 1927 年所提出的影响物理学发展至深的那个版本。 它精确的数学描述是： 假定一个信号的总能量为 1，则这个信号和它的傅立叶变换的能量的方差之积不小于$\\frac{1}{16\\pi ^{2} } $ 换言之，两者各自的能量都可能很集中，但是不能同时很集中。如果时空域中能量的方差很小（亦即集中在一起），那么频域上能量的方差就不会太小（亦即必然会弥散开），反之亦然。 对这个定理在量子物理中的意义的详细讨论超出了本文的话题范围，坊间相关的著作已有不少。不过，下面简单胪列了一些相关的历史事实： 海森堡在 1927 年的那篇文章标题为 Ueber den anschaulichen Inhalt der quantentheoretischen Kinematik und Mechanik（《量子理论运动学和力学的直观内容》）。这篇文章很大程度上是对薛定谔 (E. Schrödinger) 在 1926 年所提出的薛定谔波动方程的回应。相较于海森堡的矩阵力学而言，薛定谔的方程很快由于它物理上的直观明晰而吸引了越来越多物理学家的赞赏。海森堡对此极为失落。在 1926 年 6 月 8 日海森堡写给泡利 (W. Pauli) 的信中他说：「我对薛定谔的理论想得越多我就越觉得恶心。」因此，他迫切需要给他自己的理论配上一幅更直观的图象。 海森堡的这篇文章提出了后来被人们所熟悉的关于为什么无法同时测量一个电子的位置和动量的解释，但是并未给出任何严格的数学证明。他把他的结论笼统地表达为 Δx Δp ≥ ħ，其中 x 是位置，p 是动量，ħ 是普朗克常数。但他并没有详细说明 Δx 和 Δp 的严格意思，只针对若干具体情形做了一些直观的讨论。 第一个从数学上证明不确定性原理的物理学家是 E. Kennard。他在 1927 年证明了文章开头所描述的定理，指出 Δx 和 Δp 的数学意义其实是方差。这种解释很快就成了海森堡不确定性原理的标准数学表达，海森堡本人 1930 年在芝加哥所做的演讲中也使用了这种数学推导来佐证他的立论。需要说明的是，海森堡尽管很快接收了这一数学解释，但是后来人们发现在他本人原先的论文里所举的那些例子中，有很多被他用 Δx 和 Δp 笼统概括的含混概念其实是无法被解释成方差的。在他心目中，不确定性原理首先是一个经验事实，其次才是一个数学定理。 海森堡并未将他的发现命名为不确定性「原理」，而只是称之为一种「关系」。爱丁顿 (A. Eddington) 在 1928 年似乎第一个使用了原理一词，将之称为 principle of indeterminacy，后来 uncertainty principle 这种说法才渐渐流行起来。海森堡本人始终称之为 ungenauigkeitsrelationen/unbestimmtheitsrelationen（相当于英语的 inaccuracy/indeterminacy relations），直到五十年代才第一次接受了 principle 这种叫法。 有趣的是，即使很多信号处理或者量子力学领域的专家也不知道自己平时所讨论的不确定性原理和对方的其实是一回事。这两者之间的联系也的确并不太显然，一个关注信号的时空和频域分布，一个关注粒子的运动和能量。它们之间的相关性只有从数学公式上才看起来比较明显。在海森堡的时代当然并不存在「信号处理」这一学科，数学家们也只把不确定性原理当作一条纯数学的结论来对待。他们什么时候最先注意到这一定理并不是很清楚。有记录表明维纳 (N. Wiener) 1925 年在哥廷根的一次讲座中提到了类似的结论，但是那次讲座并没有任何纸面材料流存下来。外尔 (H. Weyl) 在 1928 年名为《群论与量子力学》的论著中从数学上证明了这一定理，但他将之归功于泡利的发现。直到 1946 年 D. Gabor 的一篇名为《通讯理论》的经典论文才真正让这个定理以今天信号处理领域的专家们所熟悉的方式流传开来。 正如前面说过的那样，在数学上不确定性原理不仅仅有海森堡这一个版本，而其实是一组定理的统称。譬如哈代 (G. Hardy) 在 1933 年证明了一个和海森堡原理类似的定理，今天一般称为哈代不确定性原理。海森堡和哈代的定理都只约束了信号在时空域和频域的大致分布，而并没有限制它们同时集中在有限大的区域内。M. Benedicks 第一个证明了信号在时空域和频域中确实不能同时集中在有限大的区域内，而这已经是 1974 年的事情了。 下一篇不确定性原理的前世今生 · 数学篇（四） 本文转载自不确定性原理的前世今生 · 数学篇（三）, 作者博客.","path":"posts/20230308231408-8ec874bb.html","date":"03-08","excerpt":"","tags":[{"name":"数学","slug":"数学","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E5%AD%A6/"}]},{"title":"不确定性原理的前世今生·数学篇（二）","text":"傅立叶变换这种对偶关系的本质，是把一块信息用彻底打乱的方式重新叙述一遍。正如前面所提到的那样，一个信号可能在空域上显得内容丰富，但是当它在频域上被重新表达出来的时候，往往就在大多数区域接近于零。反过来这个关系也是对称的：一个空域上大多数区域接近于零的信号，在频域上通常都会占据绝大多数频率。 有没有一种信号在空域和频域上的分布都很广泛呢？有的，最简单的例子就是噪声信号。一段纯粹的白噪声，其傅立叶变换也仍然是噪声，所以它在空域和频域上的分布都是广泛的。如果用信号处理的语言来说，这就说明「噪声本身是不可压缩的」。这并不违反直觉，因为信号压缩的本质就是通过挖掘信息的结构和规律来对它进行更简洁的描述，而噪声，顾名思义，就是没有结构和规律的信号，自然也就无从得以压缩。 另一方面，有没有一种信号在空域和频域上的分布都很简单呢？换句话说，存不存在一个函数，它在空间上只分布在很少的几个区域内，并且在频域上也只占用了很少的几个频率呢？（零函数当然满足这个条件，所以下面讨论的都是非零函数。） 答案是不存在。这就是所谓的 uncertainty principle（不确定性原理）。 这一事实有极为重要的内涵，但是其重要性并不容易被立刻注意到。它甚至都不是很直观：大自然一定要限制一个信号在空间分布和频率分布上都不能都集中在一起，看起来并没有什么道理啊。 这个原理可以被尽量直观地解释如下：所谓的频率，本质上反应的是一种长期的全局的趋势，所以任何一个单一的频率，一定对应于一个在时空中大范围存在的信号。反过来，任何只在很少一块时空的局部里存在的信号，都存在很多种不同的长期发展的可能性，从而无法精确推断其频率。 让我们仍然用音乐来作例子。声音可以在时间上被限制在一个很小的区间内，譬如一个声音只延续了一刹那。声音也可以只具有极单一的频率，譬如一个音叉发出的声音（如果你拿起手边的固定电话，里面的拨号音就是一个 440Hz 的纯音加上一个 350Hz 的纯音，相当于音乐中的 A-F 和弦）。但是不确定性原理告诉我们，这两件事情不能同时成立，一段声音不可能既只占据极短的时间又具有极纯的音频。当声音区间短促到一定程度的时候，频率就变得不确定了，而频率纯粹的声音，在时间上延续的区间就不能太短。因此，说「某时某刻那一刹那的一个具有某音高的音」是没有意义的。 这看起来像是一个技术性的困难，而它实际上反映出却是大自然的某种本质规律：任何信息的时空分辨率和频率分辨率是不能同时被无限提高的。一种波动在频率上被我们辨认得越精确，在空间中的位置就显得越模糊，反之亦然。 这一规律对于任何熟悉现代多媒体技术的人来说都是熟知的，因为它为信号处理建立了牢不可破的边界，也在某种程度上指明了它发展的方向。既然时空分辨率和频率分辨率不能同时无限小，那人们总可以去研究那些在时空分布和频率分布都尽量集中的信号，它们在某种意义上构成了信号的「原子」，它们本身有不确定性原理所允许的最好的分辨率，而一切其他信号都可以在时空和频率上分解为这些原子的叠加。这一思路在四十年代被 D. Gabor （他后来因为发明全息摄影而获得了 1971 年的诺贝尔物理奖）所提出，成为整个现代数字信号处理的奠基性思想，一直影响到今天。 但是众所周知，不确定性原理本身并不是数学家的发明，而是来自于量子物理学家的洞察力。同样一条数学结论可以在两个截然不相干的学科分支中都产生历史性的影响，这大概是相当罕见的例子了。 下一篇，不确定性原理的前世今生 · 数学篇（三） 本文转载自不确定性原理的前世今生 · 数学篇（二）, 原作者博客","path":"posts/20230308225727-c3d6d7e9.html","date":"03-08","excerpt":"","tags":[{"name":"数学","slug":"数学","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E5%AD%A6/"}]},{"title":"不确定性原理的前世今生·数学篇（一）","text":"在现代数学中有一个很容易被外行误解的词汇：信号 (signal)。当数学家们说起「一个信号」的时候，他们脑海中想到的并不是交通指示灯所发出的闪烁光芒或者手机屏幕顶部的天线图案，而是一段可以具体数字化的信息，可以是声音，可以是图像，也可是遥感测量数据。简单地说，它是一个函数，定义在通常的一维或者多维空间之上。譬如一段声音就是一个定义在一维空间上的函数，自变量是时间，因变量是声音的强度，一幅图像是定义在二维空间上的函数，自变量是横轴和纵轴坐标，因变量是图像像素的色彩和明暗，如此等等。 在数学上，关于一个信号最基本的问题在于如何将它表示和描述出来。按照上面所说的办法，把一个信号理解成一个定义在时间或空间上的函数是一种自然而然的表示方式，但是它对理解这一信号的内容来说常常不够。例如一段声音，如果单纯按照定义在时间上的函数来表示，它画出来是这个样子的： 这通常被称为波形图。毫无疑问，它包含了关于这段声音的全部信息。但是同样毫无疑问的是，这些信息几乎没法从上面这个「函数」中直接看出来，事实上，它只不过是巴赫的小提琴无伴奏 Partita No.3 的序曲开头几个小节。下面是巴赫的手稿，从某种意义上说来，它也构成了对上面那段声音的一个「描述」： 这两种描述之间的关系是怎样的呢？第一种描述刻划的是具体的信号数值，第二种描述刻划的是声音的高低（即声音震动的频率）。人们直到十九世纪才渐渐意识到，在这两种描述之间，事实上存在着一种对偶的关系，而这一点并不显然。 1807 年，法国数学家傅立叶 (J. Fourier) 在一篇向巴黎科学院递交的革命性的论文 Mémoire sur la propagation de la chaleur dans les corps solides （《固体中的热传播》）中，提出了一个崭新的观念：任何一个函数都可以表达为一系列不同频率的简谐振动（即简单的三角函数）的叠加。有趣的是，这结论是他研究热传导问题的一个副产品。这篇论文经拉格朗日 (J. Lagrange)、拉普拉斯 (P-S. Laplace) 和勒让德 (A-M. Legendre) 等人审阅后被拒绝了，原因是他的思想过于粗糙且极不严密。1811 年傅立叶递交了修改后的论文，这一次论文获得了科学院的奖金，但是仍然因为缺乏严密性而被拒绝刊载在科学院的《报告》中。傅立叶对此耿耿于怀，直到 1824 年他本人成为了科学院的秘书，才得以把他 1811 年的论文原封不动地发表在《报告》里。 用今天的语言来描述，傅立叶的发现实际上是在说：任何一个信号都可以用两种方式来表达，一种就是通常意义上的表达，自变量是时间或者空间的坐标，因变量是信号在该处的强度，另一种则是把一个信号「展开」成不同频率的简单三角函数（简谐振动）的叠加，于是这就相当于把它看作是定义在所有频率所组成的空间（称为频域空间）上的另一个函数，自变量是不同的频率，因变量是该频率所对应的简谐振动的幅度。 这两个函数一个定义在时域（或空域）上，一个定义在频域上，看起来的样子通常截然不同，但是它们是在以完全不同的方式殊途同归地描述着同一个信号。它们就象是两种不同的语言，乍一听完全不相干，但是其实可以精确地互相翻译。在数学上，这种翻译的过程被称为「傅立叶变换」。 傅立叶变换是一个数学上极为精美的对象： 它是完全可逆的，任何能量有限的时域或空域信号都存在唯一的频域表达，反之亦然。 它完全不损伤信号的内在结构：任何两个信号之间有多少相关程度（即内积），它们的频域表达之间也一定有同样多的相关程度。 它不改变信号之间的关联性：一组信号收敛到一个特定的极限，它们的频域表达也一定收敛到那个极限函数的频域表达。 傅立叶变换就象是把信号彻底打乱之后以最面目全非的方式复述出来，而一切信息都还原封不动的存在着。要是科幻小说作家了解这一点，他们本来可以多出多少有趣的素材啊。 在傅立叶变换的所有这些数学性质中，最不寻常的是这样一种特性：一个在时域或空域上看起来很复杂的信号（譬如一段声音或者一幅图像）通常在频域上的表达会很简单。这里「简单」的意思是说作为频域上的函数，它只集中在很小一块区域内，而很大一部分数值都接近于零。例如下图是一张人脸和它对应的傅立叶变换，可以看出，所有的频域信号差不多都分布在中心周围，而大部分周边区域都是黑色的（即零）。 这是一个意味深长的事实，它说明一个在空域中看起来占满全空间的信号，从频域中看起来很可能只不过占用了极小一块区域，而大部分频率是被浪费了的。这就导出了一个极为有用的结论：一个看起来信息量很大的信号，其实可以只用少得多的数据来加以描述。只要对它先做傅立叶变换，然后只记录那些不接近零的频域信息就可以了，这样数据量就可以大大减少。 基本上，这正是今天大多数数据压缩方法的基础思想。在互联网时代，大量的多媒体信息需要在尽量节省带宽和时间的前提下被传输，所以数据压缩从来都是最核心的问题之一。而今天几乎所有流行的数据压缩格式，无论是声音的 mp3 格式还是图像的 jpg 格式，都是利用傅立叶变换才得以发明的。从这个意义上说来，几乎全部现代信息社会都建立在傅立叶的理论的基础之上。 这当然是傅立叶本人也始料未及的。 下一篇不确定性原理的前世今生·数学篇（二） 本文转载自不确定性原理的前世今生 · 数学篇（一）, 原作者博客","path":"posts/20230308224703-f3c03b31.html","date":"03-08","excerpt":"","tags":[{"name":"数学","slug":"数学","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E5%AD%A6/"}]},{"title":"商品期货投机获利的秘诀","text":"There are two primacy says we make money trading, catching a big price move with a small position or having a large position and catching a small move. 交易获利基本上有两种方法：用小的头寸捕捉到一次大的价格波动；或者用大的头寸捕捉一次小的价格波动。 期货交易的诀窍是：别做短线。你交易的时间周期越短，赚的钱越少。 这听起来很让人失望，但却是真的。想想你以前的交易，有哪天获得过超额利润呢？如果你够走运，这种事情又能重复多少次呢？ 获利的普遍规则和投机的普遍规则是一样的： 获利需要靠时间来积累 这是个基础的算数题：一个短线交易者只有几个小时来捕捉一个大的价格波动来获利。 绝大多数来市场的散户都喜欢短线交易，时间从一开始就对他不利。他入场与离场的时间必须精确，根本就没有犯错的余地。 短线交易者要想大幅获利的唯一出路就是持有一个很大的仓位，因为他没办法捕捉到大的价格波动过程。 这有个简单的例子：我能在铁矿石期货上建立5手头寸，并持有到下个月获利3万元。但是持有5手铁矿石头寸想在明天就获利3万元是绝没有可能的。想在明天就在铁矿石期货上获利3万元，只能去持有一个很重的仓位。 这些数字是关联的，是简单的函数关系：短线交易者从市场里拿走大幅利润的唯一办法就是持有大额头寸。 因而也就有了问题。如果你持有大额头寸，你也就有可能遭遇大额亏损。在我的5手铁矿石头寸上，我可以像个傻瓜那样持有仓位直到出现3万元的亏损，我也可能被提前止损出局遭受5000块的亏损。 对短线交易者而言，风险/回报率是个灾难。平均盈利与他们的平均亏损几乎相当。 想赢得多就得赌得大。但是赌得大在特定时间可以确定的就是会输得多……在这样一个游戏里，一笔亏损就能搞垮你。 你需要知道：趋势是一切获利的根本。没有趋势就没有获利。趋势是时间&amp;空间的函数，因此，你在一笔交易里能停留的时间越久，那么你能捕捉到的趋势波幅就越大。 日内交易者将他们自己置于明显的不利地位。时间是他们的敌人，他们必须在日末退出市场，他们也限制了自己能够捕捉的价格波幅。而头寸交易者懂得时间是他们的盟友，也因此获益良多。 这条规则会一直有效，直到永远。 成功的交易者知道市场在1分钟内变化不了多少，5分钟内变化会大一些，60分钟内变化比5分钟还大，1天、1周内的变动会更大。失败的交易者只想在很短的时间段内进行交易，自然限制了获利的潜力。 按照上面的定义，这些人限制了自己获利的潜力，却导致了无限的亏损，所以就会有那么多人在短线交易方面表现差劲。他们在经纪商或者交易系统推销员的鼓动下，被不断低买高卖获利的假想所蒙蔽，最终却陷入了亏损的困境。 因为有杠杆，人们又喜欢短线交易（有许许多多的人是做日内交易），这导致一个残酷的事实：绝大部分小资金者，最后的结局一定是出局的。 还记得吗？长袖善舞，多钱善贾。","path":"posts/20230306235727-158f51b8.html","date":"03-06","excerpt":"","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"人生就是一个泊松过程","text":"在《概率论核心》一文中我们知道``概率还有一个别称叫分布.也知道了分布的理解、分类。 本文是记录张颢教授说的 人生就是一个泊松过程 泊松分布：小概率事件。 如果是密集出现的事件，我们处理起来用的是大数定理，如果是稀有事件，我们处理起来用的是小数定理。泊松分布就是小数定理的一种体现。稀有的，因此我们需要有统计模型来帮助我们考察这一类事件。 描述一段时间内，事件发生多少次的概率分布。 泊松过程是一个等待的过程，如图 人生就是一个泊松过程 泊松过程最典型的特征是[跳] Jump ，除了跳之外，它唯一干的事是等待（Waiting)。 拓展：张颢教授在讲课时分享的人生哲学：人生就是一个泊松过程","path":"posts/20230305234944-ba16b6bd.html","date":"03-05","excerpt":"","tags":[{"name":"数理统计","slug":"数理统计","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E7%90%86%E7%BB%9F%E8%AE%A1/"}]},{"title":"概率核心（文）","text":"概率论最基本的概念是统计实验，结果是没法事先知道的，它具有不确定性。统计实验之后，就会有样本空间。所有可能出现的结果，我们把它放在一个集合里，这个集合就称作样本空间（Ω）。样本空间之后就有了“事件”，所谓事件，就是样本空间的子集，统统称它为事件。有了事件，就可以定义概率了。 概率的概念： 概率是一个定义在集合上的函数，它的自变量是样本空间里的子集，它以样本空间里的子集为自变量，值域是[0,1]区间。所以它是从样本空间的子集，映射到[0,1]区间的这么一种集合。 有了概率，有了概率的定义域，有了样本空间，就形成了——概率论里最重要的概念：概率三元组（Ω、B，P），也有人叫概率空间或者模型。 它是三个要素：样本空间、样本空间的子集所构成的概率的定义域，以及我们定义在样本空间子集上的函数叫概率。 概率描绘的是样本空间里的元素，在统计实验当中出现的可能性的大小。 我们知道样本空间里的元素都是统计实验的结果，那统计实验的结果有不确定性，它有可能出现，有可能不出现，我们对于这种可能性的大小是有一个认知的，这种认知就反应在概率里。 这里有个非常重要的概念，这个概率它是先验的。也就是在我们研究概率问题的时候，这件事就已经知道了，它是怎么知道的呢？——统计得来的。 概率在干什么事情？ 概率是先有模型的，“概率三元组”就是我们的模型，我们通过模型来对统计实验进行抽象。任何一个统计实验，任何一个实际当中所发生的具有不确定性的事情，我们都可以用概率三元组进行抽象，其中把所有可能的实验结果先放在一堆，然后在这一堆所形成的样本空间当中寻找合适的概率的定义域，包括它的各种各样有意义的可以计算概率的子集，然后在这个基础上我们把概率是要定义出来。 这里的概率怎么定义的呢？ 它包含的就是我们长时间进行统计实验所积累下来的什么样的结果出现的可能性大，什么样的结果出现的可能性小的经验和感觉。比如掷硬币，如果是均匀的，我们经过长时间的实践，我们发现正反两遍的概率应该是相等的，那么这样的一种相等是我们经验的总结，它在我研究概率论之前就已经定下来了。我们掷骰子也一样（只要那个骰子不是专门用来抽老千的“专用骰子），它自然应当六个面是等概的，这也是我们的经验积累，我们的经验积累要全部浓缩融汇到这个模型里面来。然后，概率论研究的问题，模型是前提，它是由模型到决策，这个过程是概率论。 就是说有了基本模型之后，我们能从中得到什么样的结果，我们利用基本模型，研究我们不太清楚的和不确定性有关的问题的答案。 这个答案并不是百分百的，因为我们算出来的也是一个概率，但是概率和概率之间我们是可以比较的，我们最终选择概率最大的方案。 概率它是由模型到决策，模型是先验的。现在的问题在于，模型是怎么来的呢？ 模型都是从数据当中来的。 从数据当中去总结、提炼模型这是统计的作用，是统计干的事。 概率小结： 概念一定要清楚，概率的核心是概率三元组，它就是我们说的模型。里面包括了样本空间、概率的定义域、概率函数本身。概率函数本身是先验的给出的，反应的是人们长期生产生活实践的积累，人们对不确定性的一种刻画与描述。 从概率三元组的构成我们可以看出，样本空间是概率论里重要的元素，事实上这是概率论中最最重要的元素，恐怕没有之一。样本空间如果事先没有进行准确的界定，我们的概率问题就没有办法很好的进行解决。任何概率问题，只要样本空间一变，一切都变了。样本空间在整个概率论的大厦里是处于基石地位，如果样本空间不一样了，整个概率论都改写了。 所有的教材上都用贝特朗悖论（Bertrand’s Paradox）来说明样本空间的重要性。 贝特朗悖论 在一给定圆内所有的弦中任选一条弦，求该弦的长度长于圆的内接正三角形边长的概率. 至少有三种方法可以在一个圆上随机选择一条弦，如下： 解法一：如左图，由于对称性，可预先固定弦的一端。仅当弦与过此端点的切线的交角在60°～120°之间，其长才合乎要求。所有方向是等可能的，则所求概率为1/3。此时假定端点在圆周上均匀分布。 解法二：如中图，由于对称性，可预先指定弦的方向。作垂直于此方向的直径，只有交直径于1/4点与3/4点间的弦，其长才大于内接正三角形边长。所有交点是等可能的，则所求概率为1/2。此时假定弦的中心在直径上均匀分布。 解法三：如右图，弦被其中点位置唯一确定。只有当弦的中点落在半径缩小了一半的同心圆内，其长才合乎要求。中点位置都是等可能的，则所求概率为1/4。此时假定弦长被其中心唯一确定。 这导致同一事件有不同概率，因此为悖论。 同一问题有三种不同答案，究其原因在于圆内“取弦”时规定尚不够具体，不同的“等可能性假定”导致了不同的样本空间，具体如下，其中“均匀分布”应理解为“等可能取点”： 解法一中假定弦的另一端在圆周上均匀分布，圆周上的点组成样本空间Ω1； 解法二中假定弦的中点在直径上均匀分布，直径上的点组成样本空间Ω2； 解法三中假定弦的中点在大圆内均匀分布，大圆内的点组成样本空间Ω3。 可见，上述三个答案是针对三个不同样本空间引起的，它们都是正确的，贝特朗悖论引起人们注意，在定义概率时要事先明确指出样本空间是什么，样本空间不一样，采集过来使用的数据就会不一样，导致模型不一样，模型不一样，决策也就不一样。 事实上“答案”远不止这三个，但所有结果都是对的，因为我们选点的基础是不一样的。圆周、圆盘、半径，选点的基础是什么，这个就是样本空间。 &#123;样本空间&#125;在概率论中是十分重要的东西，事实上可以把不同的样本空间看做不同的“世界”，这很像世界观，不同的世界观下，我们所看到、知道的世界是不一样的。 概率的别称——分布 我们假定有一组数据，X1,X2,...XnX_1,X_2,...X_nX1​,X2​,...Xn​，它们是随机变量，统计是研究随机对象的，这和概率相同。既然这里我们研究的对象是随机变量，自然地我们就要考虑它们服从什么分布，通常我们假设这些数据是独立同分布的——如果不独立的话，处理起来问题比较多，因此我们假设它们独立同分布。它们可以叫数据，也可以叫样本，叫什么不重要，我们要知道它们是一些随机变量，并且独立同分布。本文仅是概括性地提一下，涉及到的每一种分布都会有单独的文章来说——如果对我的工作有益的话。 分布的理解 事实上，我们往往会写这么一件事：P(X=x)，这个东西它是一个概率，这里在计算概率时，尽管我们往往不直接说，但我们心里得明确这个概率它的含义是：概率只能定义在样本空间上，只能定义样本空间的样本点上，因此，我们默认的是这么一件事：P（{w∈Ω|X（w）=x}）,只不过我们为了简便，写成P(X=x)，心里要知道随机变量只是一个马甲，真正的不确定性是完全存在于样本点上的，是完全存在于这些样本点在统计实验当中所出现的可能性的大小与变化上。从样本点往后，没有任何不确定性。我们P(X=x)这里看上去貌似的不确定性实际上是P（{w∈Ω|X(w)=x}）样本点不确定性的表达而已。我们不去处理样本空间，因为样本空间不好处理，它不是数学对象，我们处理数据，因此我们才把随机变量拖到前台来，它自身没有任何不确定性。此其一。 其二，P(X=x)这个概率是作为我们模型的一部分，先验的给出来的。我们再强调一下，概率它是先验的。怎么得来的，那是统计的任务，那不是概率的任务。概率是从模型到决策，从数据到模型这是统计的任务。因此，对于随机变量，我们就能够有概率了，这个概率还有另外一个名儿，到了这儿就叫：分布。 尽管我们是有着很多的说法，在我们学概率论的时候，也是有很多的名词儿的，这也是学习概率论时会感到一点困难和疑惑的地方，但一定要相信，背后的东西其实都是很简单基本且朴素的—— 分布是概率的别称，是马甲，它是我们模型的一部分。分布对应的是随机变量，概率对应的是样本点，仅此而已，随机变量是样本点的马甲，那么分布就可以认为是概率的马甲。 我们可以给这个随机变量取每一个值，都赋予一个分布。这样的一种分布，表达了实际上就是我们样本点的在统计实验当中出现的可能性的大小。我们会遇到如下说法：XX分布，XX随机变量，这两个说法同义词。为什么是同义词，因为它表达的都是同一个统计模型，样本点已经给了，由样本点到实数轴的映射关系也已经确定了，样本点的可能性大小已经赋上了，这些可能性大小已经在实数轴上作为分布表现出来了，所以，它们说的是一回事。 不同的随机变量，不同的分布，就代表了是不同的统计实验以及这种不同的可能性的大小。 分布的分类：离散&amp;连续 在这里我们需区分两个概念，在概率论里也学过，就是离散和连续。 如果是离散的，意味着样本空间是可数的。也就是说它的样本空间是一个一个能列出来的{W1,W2,W3…}; 如果是连续的，那样本空间就是实数轴。可加（Additivity）是概率的立身之本。（它为啥有可加性啊？我说不清。说不清的事，就当公理好了。PS：主观概率就没有可加性。） 如果不可数，概率计算应该是一个积分，积分就是求和，一点一点的求和。积分的函数称作概率密度。概率密度与可数的概率相比较，差异在于：连续的随机变量，概率密度的具体取值与随机变量在这个点的概率二者不是一回事，只是近似。 不管是密度也好，概率也好，都是模型的一部分，都是先验的存在。 把密度的原函数，成为分布函数。 离散分布 伯努利分布，也叫两点分布。简单的成功失败的分布。 二项分布。典型的射击模型。（我这块用不上） 泊松分布。小概率事件。 如果是密集出现的事件，我们处理起来用的是大数定理，如果是稀有事件，我们处理起来用的是小数定理。泊松分布就是小数定理的一种体现。稀有的，因此我们需要有统计模型来帮助我们考察这一类事件。 描述一段时间内，事件发生多少次的概率分布。 泊松过程是一个等待的过程，如图 泊松过程最典型的特征是[跳] Jump ，除了跳之外，它唯一干的事是等待（Waiting)。 连续分布 1.均匀分布 在概率论和统计学中，均匀分布也叫矩形分布，它是对称概率分布，在相同长度间隔的分布概率是等可能的。 均匀分布由两个参数a和b定义，它们是数轴上的最小值和最大值，通常缩写为U（a，b）。 概率论中均匀分布一个很常例是掷骰子。 均值是重心 均匀分布U(a,b)的数学期望: (a+b)/2，因此，均值和期望在某种意义上可以指同一个东西。而物理上均值是重心，即质量在空间的分布的均值。 从而，得出：均值是重心。 *均值是重心这个提法给我的启发很大，也对我帮助很大，要感谢张颢教授。 2.指数分布 指数分布刻画的是一种等待过程，等待某个时间的出现，等待某个时刻的来临，等待某个人的出现。指数分布的特性是无记忆性（Memoryless）。 指数分布里有个澡盆模型,描述通常情况下部件故障率与时间的关系. 在澡盆中间是不容易坏的，刚开始和最后面是容易出故障的。这个模型思想可用来解释灯泡使用寿命：一个灯泡使用完100小时后，再使用两小时的概率，等同于一个新灯泡使用两小时的概率。 包括七天无理由退换也是澡盆模型的思想，比如电脑什么的刚买来时别舍不得用，要使劲用，要出问题一开始的时候会出现，而当电脑使用了一些年头，开始出现故障时，就可以卖掉。张颢教授在说到这里的时候幽默地说：“用自己的电脑，让别人去修吧” 在离散里，几何分布和这里的指数分布非常契合的对应，几何分布是连续分布中指数分布的离散版本。 指数分布是在正半轴上分布。 3.高斯分布 高斯是在整条实数轴上分布的。高斯的密度是典型的钟型。μ代表中心位置，未必是0点，可以左右移动，σ代表胖瘦。我们对于概率论的认识，一大半都来自高斯分布，是特别重要的分布。 高斯分布的重要性还表现在，如概率论里有一个中心极限定理，该定理是说X1,X2,...XnX_1,X_2,...X_nX1​,X2​,...Xn​,他们是独立同分布的，并且他们都做了归一化（均值为0，方差为1），那么把它们加在一起，用根号n一除，在n趋向无穷大的情况下，左边这个若干个随机变量的和，它们就会体现出一种整体的规律的分布上的响应，这个响应就是高斯分布。这意味这高斯的普遍存在是有事实依据的，因为大量的微小的随机因素叠加在一起，所呈现出来的整体效应和这些随机因素原有的分布就没太大关系了，它们的整体的效应就是高斯的样子。 我们为什么喜欢用高斯去描绘噪声（Noise），其原因就在于此。 扩展阅读：噪声的来源 你是一下子说不清的，影响它的因素也不能一个一个数出来，因此，在这里我们所涉及到的这么一种场景，有很多很多的影响因素，这些影响因素数量非常巨大，且每一个因素的影响都十分微小，大量的微小的随机因素叠加在一起，它们的整体效应就是高斯。 类似的想法，在科研中，屡见不鲜。 比方说，统计物理学里研究分子运动。分子运动有自身的规律，你可以每一个分子都列出一个运动方程，而它们在自由空间的运动，你是可以完全把握的，可是当它们大量的分子在一起时，它们会发生相互碰撞，这会涉及到方程式的复杂性，一旦碰撞，你就很难说清楚了，而且它数量还很庞大，成千上万，你说你能用什么宏观的视角来看待分子运动呢？（这里涉及到一个概念，叫初值敏感） 你就用温度就能一言一概之——温度就是宏观上反应分子运动剧烈程度的一种表征。这就这么来看高斯，高斯就相当于那个温度。你原有的运动不管多复杂，你在宏观上总有一个总体表象，你原有这些随机因素不管如何变化，你叠加在一起之后，就呈现出的是高斯的样子。可见高斯的普适性有多好！因此它作为概率论的中心话题，绝对不是偶然。","path":"posts/20230305231934-cbfed0a9.html","date":"03-05","excerpt":"","tags":[{"name":"数理统计","slug":"数理统计","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E7%90%86%E7%BB%9F%E8%AE%A1/"}]},{"title":"要聚焦，过多选择会降低幸福感","text":"“过多的自由”反而会导致人们生活满意度下降和临床抑郁症的增多。过多的选择可能会带来信息超载，会导致人们无所适从，带来更多后悔的机会。 过多选择的代价 像自由和自我决定这样的好东西人们会嫌多吗?心理学家施瓦茨认为，个人主义的现代文化存在“过度的自由”，反而导致人们生活满意度下降和临床抑郁症的增多。过多的选择可能会导致人们无所适从，或像施瓦茨所说的“自由的专制”。从30种果酱或巧克力中做出选择的人们表示出的选择满意度，比那些从6种中做出选择的人们的反而低。更多的选择可能会带来信息超载，也带来更多后悔的机会。和那些仅仅依循课程学习的人相比，自己选择下学期学习课程的学生，更少为重要的考试而努力，且更容易被游戏和杂志所吸引。另一项研究发现，可以在一系列消费清单中进行选择的学生更少购买口味寻常却健康的饮料。所以，在从星巴克1900款产品组合或超级市场4000项产品中进行选择时，你将对自己的选择更不满意，反而更倾向回家吃冰箱里的冰淇淋。 心理学家阐释了选择是如何强化后悔的。如果让员工们免费去巴黎或者去夏威夷旅行，他们会非常高兴；但是，如果让他们在两者之间进行选择，他们可能就不那么高兴了。选择巴黎的人会后悔他们无法得到阳光的温暖和海水的滋润，选择夏威夷的人会后悔他们将欣赏不到那些壮观的博物馆。最近的另一项研究也发现了同样的问题：来自11所大学的毕业生花了很多时间去寻找和评价各种各样的工作机会，但却以高薪和低满足感而告终。 在其他实验中，人们对无法反悔的选择（比如“最后大甩卖”中的选择决定）的满意度比对可以反悔的选择（当允许退款和更换时）的满意度要高。可笑的是，人们似乎喜欢和愿意为推翻这种选择的自由而付出代价。尽管这种自由可能会让你产生不满意。 该原则可以解释一种奇怪的社会现象：美国国家调查数据显示，过去人们对无法反悔的婚姻(“一次性成交”) 表示了更高的满意度。现在，尽管有了更多的婚姻自由，人们却对他们拥有的婚姻表现出较低的满意度。 自我控制的研究让我们相信坚持不懈和希望等这样一些传统美德。但是，班杜拉认为[[自我效能感]] 由诸如“你拥有通往成功的一切”这样的社会说服和“我认为我能，我认为我能”这样的自我说服来支持榜样——也就是看到其他类似的努力获得成功的例子——也可以提高自我效能感。但自我效能的主要来源是对成功的体验。“成功构筑了有力的效能信念”。如果你在减肥、戒烟或提高学习成绩方面通过努力获得了成功，你的自我效能感就会增强。 一个由鲍迈斯特领导的研究小组主张“仅仅为他们是他们自己而称赞孩子，简直是在使赞扬贬值‘。最好通过“认可好的表现来表达赞扬和增强自尊······当个体行为表现更好时，自尊会得增强，而其结果又会强化好的行为和进步。那些结果同时也有益于个体的幸福和社会的进步。 1.为人们提供较小的选择范围可能比为他们提供较大的选择范围更能给他们带来满足感。 2.心理学家认为，之所以不能达到最佳的决策水平，在很大程度上是由于认知超载（cognitive overload），即当可以利用的信息淹没了可以利用的认知加工过程时所发生的情景。[1] 扩展阅读哈佛丹尼尔·吉尔布特（Daniel Gilbert)论：不可撤销之承诺的益处我以前认为做出决断之后还能改变主意是有好处的，在2002年，我改变了这一想法。我和简·艾伯特(JaneEbert)发现人们不能撤销他们的决定时通常会更快乐。实验中参与者能撤销他们的决定时，他们就会思考自己决定的利弊。而不能撤销决定时.他们就会将注意力集中于这个决定有利的一面，而忽视不利的一面。同样，决定不可撤销比可以更改会令他们更满足。讽刺的是，参与者并未意识到这一点，他们都强烈倾向于希望可以改变决定。现在，直至这一刻我依然相信婚姻源自于爱。但是这些实验启示我，原来婚姻也可能引起爱。如果你认真地看待这些研究资料，你就要去实践它。所以我知道这个结果的时候，我就向女友求婚了。她答应了我。事实证明我做的决定是正确的当她变成我的老婆之后，我更爱她了。 “过多的选择会降低幸福感”这一现象也可以用在学习上。 学习任何一门学科，最好选择并且只选择一套体系化的教材，聚焦完成这套教材的学习。可能一开始的时候我们会对教材的语言风格不习惯，坚持学它一段时间后大脑就开始习惯了。我的经验是如果每天学习1、2个小时，一个来月就习惯了，如果每天的时间充裕一些，一周就可以。如果是看教学视频，先不着急一上来就拿个小本本跟着学，先听几P，不要在意听得懂听不懂，先让授课老师的声音在我们的脑子里跑马，很快就能习惯老师的说话风格。而且这种先听的方式，就像是看书时先看目录一样，听1、2遍后我们对课程的框架就有点眉目了，这时候再认真学就容易多了。当然这是我的经验之谈，不见得每个人都适用。 学习时，教材、老师，切勿贪多。今天北大老师、明天清华教授、后天国科大教授、然后又到B站MIT、哈佛……网盘爆满、收藏夹爆满、资料太多，精力分散，最终没有一样能学成的。 学习时间要保证1小时以上，务必连续且有利于集中注意力的环境，再且要每天坚持，学习赢者通吃，输者一无所有。必须坚持学习，必须累积直至从量变到质变。如果没有到达质变这一步，量变这一环节投入的再多再大，时间一过，会全部忘记，你根本记不住。 参考： 《社会心理学（第11版）》作者 戴维·迈尔斯，人民邮电出版社。P59-60 ↩︎","path":"posts/20230301110843-dc02ff82.html","date":"03-01","excerpt":"","tags":[{"name":"认知心理学","slug":"认知心理学","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5%E5%BF%83%E7%90%86%E5%AD%A6/"}]},{"title":"长袖善舞,多钱善贾","text":"长衣袖合于舞蹈，本钱多便于做生意。比喻有所凭藉，事业容易成功。出自《韩非子·五蠹》 原文： 鄙谚曰：“长袖善舞，多钱善贾。”此言多资之易为工也。故治强易为谋，弱乱难为计。故用于秦者，十变而谋希失；用于燕者，一变而计希得。非用于秦者必智，用于燕者必愚也，盖治乱之资异也。故周去秦为从，期年而举；卫离魏为衡，半岁而亡。是周灭于从，卫亡于衡也。使周、卫缓其从衡之计，而严其境内之治，明其法禁，必其赏罚，尽其地力以多其积，致其民死以坚其城守，天下得其地则其利少，攻其国则其伤大，万乘之国莫敢自顿于坚城之下，而使强敌裁其弊也，此必不亡之术也。舍必不亡之术而道必灭之事，治国者之过也。智困于内而政乱于外，则亡不可振也。《韩非子·五蠹》 译文: 乡间谚语说：“长袖善舞，多钱善贾。”这就是说，物质条件越好，做生意就越容易取得成功。所以国家安定强盛，谋事就容易成功；国家衰弱混乱，计策就难以实现。所以用于秦国的计谋，即使改变十次也很少失败；用于燕国的计谋，即使改变一次也很难成功。这并不是被秦国任用的人智慧必高，被燕国任用的人脑子必笨，而是因为这两个国家的治乱条件大不相同。所以西周背弃秦国参予合纵，只一年工夫就被吞灾了；卫国背离魏国参与连横，仅半年工夫就被消灭了。这就是说合纵灭了西周，连横亡了卫国。假使西周和卫国不急于听从合纵连横的计谋，而将国内政治严加整顿，明定法律禁令，信守赏罚制度，努力开发土地来增加积累，使民众拼死去坚守城池；那么．别的国家夺得他们的土地吧，好处不多，而进攻这个国家吧，伤亡很大，拥有万乘兵车的大国不敢自我拖累在坚城之下，从而促使强敌自己去衡量其中的害处，这才是保证本国必然不会灭亡的办法。丢掉这种必然不会亡国的办法，却去搞势必会招致亡国的事情，这是治理国家的人的过错。外交努力陷于困境，内政建设陷于混乱，那么国家的灭亡就无法挽救了。 《史记》中也记录了韩非子这一“记录”，《史记·范睢蔡泽列传》：“韩子称‘长袖善舞，多钱善贾’，信哉是言也！” 以一个简单的剪刀石头布的游戏为例。 这个游戏中，设你的资产是一元钱，你的对手的资产是一万元。 你们两个玩石头剪刀布的游戏，赌相同的金额，胜者通吃。也就是第一局里，你出一元他出一元，然后你们俩比，谁赢了，这两元钱就归谁。 假如第一局你赢了，那么第二局他提出加码，每人出两元，胜者拿走四元。 第三局则是每人出四元。以此类推，总共比十局。 那么纵然启动资金是一元的你，十局皆胜，将1023元钱收入囊中。你的对手仍然能拿着剩下的8977元钱愉快地去与下一个人赌博。 而十局中只要有一局你落败，你的资产将完全归零，你就没有进行下一局的筹码了。哪怕前九局全胜，仅有最后一局落败，结果也是一样倾家荡产。 那么你想一想，十局全胜的概率有多低。而你在现实中的商战中每一次击败比你有钱的对手的概率，恐怕还要远低于石头剪子布每局获胜的概率。","path":"posts/20230227110132-cb0418b7.html","date":"02-27","excerpt":"","tags":[{"name":"概率思维","slug":"概率思维","permalink":"http://kisma77.github.io/tags/%E6%A6%82%E7%8E%87%E6%80%9D%E7%BB%B4/"}]},{"title":"百分百红灯策略","text":"投资要面对不确定的市场，在波动的金钱面前我们都是难以克服人性的弱点（完全的程序化交易可去除人性）。心理学对我的投资有极大的帮助，这里记录一个对我帮助比较大的认知心理学实验，它帮我处理了一次又一次的人性决策的弱点。 在试图解释世界上发生的所有事，同时又拒绝承认偶然因素的作用，实际上会降低我们对现实世界的预测能力。在某个领域中，承认偶然因素的作用意味着研究者必须接受这样一个事实，即我们的预测不可能百分之百准确，预测中总是会犯一些错误。但有趣的是，承认我们的预测达不到百分之百的准确度，实际上反而有助于我们提高整体预测的精确性。 这听起来好像有点儿矛盾，但是事实确是如此：为了减少错误，就必须接受错误（Einhorn, 1986）。 在认知心理学领域，有一个被重复研究了数十年的实验，一次次说明“我们必须接受错误以减少错误”这一信念。 实验非常简单： 让被试坐在(一红一绿)两盏灯前，实验者要求被试预测每次测试时哪一盏灯会亮，按准确率给予一定的报酬（奖励）。 被试要参与很多轮这样的测试。 被试们不知道所有的测试中，红绿灯亮起的次数占70%，剩下的30%的次数会亮绿灯，并且这两种灯以随机顺序出现。 实验中，被试很快就意识到两种等被点亮的频率不一样，他们发现红灯亮的次数比较多，他们也根据自己察觉到的情况在更多的测试中预测红灯会亮。经过记录分析，被试们在大约70%的测试中预测红灯会亮，30%的时候预测绿灯会亮。于是乎，为了自己能预测对更多（可以拿到更多的报酬）甚至希望自己的预测百发百中，他们在红灯与绿灯之间换来换去，但仍然会有意识地保持70%的次数预测红灯会亮，30%预测绿灯会亮。 最终，平均下来，他们的准确率为58%. 上面这个实验中，被试极少意识到，尽管绿灯亮的概率为30%，如果他们停止主观猜测企图押对更多而在红、绿灯之间来回切换，他们的预测会更好一些。 这里的逻辑在于：以70∶30的比例随机点亮红灯或绿灯的情况下，如果被试在70%的测试中预测红灯会亮，30%的测试中预测绿灯会亮，他的准确率会是多少呢？我们将用实验中间部分的100个测试来计算——因为那时被试已经注意到红灯亮的次数比绿灯多，从而开始在70%的测试中给出红灯会亮的预测。在100次测试中有70次红灯亮了，所以被试在这70次中有70%的正确率（因为被试在70%的测试中预测红灯会亮），那被试预测正确的次数在 70×0.7=49(次). 100次测试中有30次绿灯亮了，被试在这30次中有30%的正确率（因为被试在30%的测试中预测绿灯会亮），被试预测对绿灯的次数为 30×0.3=9(次) 然而，在100次测试中，被试的正确预测是58次。这个成绩不算好！ 如果被试在注意到哪一盏灯亮得比较多后，总是预测那盏灯会亮——在本实验中，就是注意到红灯亮的次数比较多，因此就总是预测红灯会亮（姑且称之为“百分百红灯策略”），那么，他们在100次测试中会有70次正确的预测，虽然在绿灯亮的30次测试里被试将没有一次正确的预测，但是总准确率仍然高达70%，这比他们在红灯与绿灯之间来回变换以追求更高准确率的58%的准确率成绩要高12个百分点。 在思考上面的“事后最优策略”时也感慨颇多，那就是如果我是被试，在意识到红灯点亮的次数明显多于绿灯时，我采取了每次都预测红灯的策略，这意味着每次绿灯亮起我都错。要是连着4、5次都是绿灯亮，我的意志力能否扛得住？对于连续亮起的绿灯，一再猜错会让我怀疑自己的策略。按我们的“常识”来说，那么多次红绿灯实验，一次绿灯不押似乎也不对，但这却是正确的概率思维所需要的，它要求接受在绿灯上所犯的错误，接受放弃少的一方（这个实验中的绿灯）所带来的机会，以换得数量较多的一方（这个实验中的红灯）每次都押它之后整体命中率的提高。 这个实验，表明在使用某一准则（这里是概率思维）以一定的可能性或精度预测人类的行为时，有必要接受适当的错误以减少整体的错误，虽然我们都希望幸运女神站在自己的一边，但我们必须接受不可能在每一件具体事情上都对。 四十多年来，心理学领域里关于临床预测和统计预测的研究就证明了上述观点或策略。统计预测是指依据统计资料中得出的群体趋势所作的预测。 道理上说起来很容易，在现实中却很难，懂心理学、统计、概率的人不多，加上这种策略直击人性的弱点。拿上面的红绿灯实验来说，我们会怀疑自己的感受到的红灯、绿灯被点亮的占比到底对不对，尤其是在绿灯连续多次亮起后，这种怀疑更甚。别忘了，预测的结果和报酬挂钩，每当我们报出“红灯”而亮起的时绿灯时，仿佛有个声音在耳边说“傻瓜，100元没了！…200没了…500没了…”，会摧毁我们当时的信心。 我们不仅需要学习概率、统计知识和培养概率思维，心理上的训练也必不可少。 每天全球都有成千上万的人在股市亏钱，散户绝大多数是“技术分析”交易，人们带着极大的主观性在分析、交易，就像实验中猜红绿灯的人一样押注。混迹市场的老手在这方面比较严重，他们以为自己有足够多的“临床经验”，天天在市场厮杀，然而在试图对每一个不同寻常的随机事件作出独特解释时（就我们目前的知识情况来说，独特的解释也许根本不可能），我们常常丧失了对更多平常事件的预测能力。 诚然，“百分百红灯策略”会对出现概率较小或很少出现的不寻常事件（实验中的绿灯亮起）作出了错误的预测，但如果我们把注意力放在出现概率较大的事件上，采用“70%红灯、30%绿灯策略”，结果会怎样呢？我们会在30个不寻常事件中正确预测9次（30×0.3），其代价是丧失了对21个常见事件作出正确预测的机会，没有对红灯作出70次的正确预测，只获得49次的正确预测（70×0.70）。临床领域中的行为预测也遵循相同的逻辑，为每一个案编造复杂的解释，确实可能抓住一小部分不寻常事件——但这是以损失了对大多数事件的正确预测为代价的，而在此方面，简单的统计预测则更有效。 如何培养这种“接受错误以减少错误”的百分百红灯策略思维习惯呢？ 首先，也是最重要的是要明白统计预测的优越性远超主观的“临床经验”。 统计预测的优越性并不局限于心理学，它业已扩展到了许多其他临床科学中——例如，医学（Groopman, 2007）、金融服务（Bogel, 2010;Kahneman, 2011）以及体育训练（Moskowitz &amp; Wertheim, 2011）等领域中都适用。 对于研究显示统计预测相对于临床预测的优势，社会科学中，没有任何一个争议能如此这般从这么大量的、性质上如此多样的研究中得到如此一致的结论（Meehl,1986，p. 373—374）。 一种普遍的反统计论调或误区在于，认为群体统计不适用单个人或事。这种观点是对概率基本原则的误用……要保持逻辑上的一致，反统计论的鼓吹者就必须相信并承认，如果一个人被迫玩一次俄罗斯轮盘赌，允许他选择膛内装有1发或5发子弹。事件的单一性使得选哪把枪都无所谓（Dawes et al., 1989，p. 1672）。 未完待续 参考 1.Accepting Error in Order to Reduce Error: Clinical Versus Actuarial Prediction 2.Accepting Error to Make Less Error.Hillel J. Einhorn，1986 3.Paul Meehl ：Clinical Versus Statistical Prediction …","path":"posts/20230223222915-f73d33d.html","date":"02-23","excerpt":"","tags":[{"name":"认知心理学","slug":"认知心理学","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5%E5%BF%83%E7%90%86%E5%AD%A6/"}]},{"title":"打雪仗思维","text":"这是理解成功的交易者在交易中的思维方式，如果你想成为一个成功的交易者，本章的内容是至关重要的。因此，我决定在很多不同的场合通过不同的比喻来反复进行阐述，但是你必须一次就领会它，理解这些因素能够带给你令人难以置信的收益。 在我看来，一个成功的交易系统，有六个关键可变因素必须要理解。 下面一起来探究这六个可变因素以及它们如何影响每一位投资者的利润或亏损。 （1）可靠度。或者百分之多少的时间你是赚钱的。比如，你的投资是否有60%是赚钱的，而有40%是赔钱的呢？可以参考《百分百红灯策略》。 （2）利润与损失的相对占比(盈亏比）。进行交易时，相对于损失而言，利润水平的相对规模。例如，假如交易失败每股赔1元，而交易成功每股赚1元，那么利润水平的相对规模是一样的。然而，如果交易成功，每股赚到了10元，而交易失败，每股只赔1元，那么相对规模的盈亏比就非常不同。 （3）账户耗损。只要进行交易，账户就必然会有耗损，它是滑点等执行成本和佣金支出。这些成本会随着交易量的增加越积越多，且永远不会消失。即假设单次交易量为α，滑点为β，佣金支出为x，耗损y=2·α·β·x，β,x&gt;0。 （4）获得机会的频率。现在假设以上三个可变因素保持不变，其综合效应就取决于交易的频率。每天做10次交易和每年做10次交易的结果将大相径庭，别忘了耗损与交易频率成正比。 （5）头寸规模确定采用的时间周期和模型，它们反过来指导每次交易多少个单位头寸。显然，每股的盈利或亏损金额就要乘上交易的股票数量。 （6）账户总的资金规模。前面四个可变因素对账户的影响很大程度上取决于你的账户规模。例如，交易成本对一个1000元账户的影响要远远大于对一个100万元账户的影响。如果每笔交易的成本为20元，那么1000元的账户在每笔交易扣除2%的费用后才能获利，因此，为了抵消交易成本，你每笔交易的平均利润必须达到2%以上。然而，如果你的账户是100万元，那么同样是20元的成本对你的影响就微不足道了，它只占到账户的0.002%。类似地，500元的损失对1000元的账户而言是致命的打击，但是对100万元的账户就几乎没有影响（它只占到账户的0.05%）。 这六个可变因素中，每一个都是非常重要的，但大多数股民在他们日复一日的交易中经常只关注其中一个可变因素，他们往往集中注意力于第一个可变因素，即可靠度、所谓的准确率。 下面通过一个打雪仗的比喻提供一个视角来看待这6个可变因素的重要性 想象一下你正躲在一面巨大的雪墙后面，有人正在向你的雪墙上扔雪球，而你的目标是保持墙面尽可能的大，以便获得最大程度的保护。 因此，这个比喻马上告诉你，墙的大小是一个非常重要的可变因素。 [IF]墙太小，你难免会被击中; [IF]墙很大，你可能就不会被击中。 这墙就是你的账户资金规模，上面的第六个可变因素，即将账户资本视为一面保护你的财富之墙。假定其他因素保持不变，你拥有的钱越多，墙面越大，能得到的保护也就越多。 现在想象向你扔雪球的人有两种不同的雪球——白雪球和黑雪球。 白雪球类似盈利的交易，它们会黏到你的雪墙上增加它的面积和厚度。现在设想一下一大堆白雪球向你扔过来的结果，它们会增加雪墙的体积，随着白雪球的增加，雪墙会越变越大、越变越厚，你就会得到更多的保护。 黑雪球含有融雪剂，它会使这面墙上的雪融化并在雪墙上弄出一个和它们一样大小的洞出来。因此，黑雪球类似亏损的交易，它会侵蚀你的安全防护墙。就如亏损的交易侵蚀你的资本一样，如果有一大堆黑雪球扔向你的雪墙，你的雪墙就会很快受损，会有一大堆黑洞在上边，甚至你的雪墙最终会消失。 现在来看[可靠度]这个可变因素。 这就有点像关注白雪球的百分比。我们自然希望所有扔过来的雪球都是白的，从而增加我们前面雪墙的体积，但现实不会全是白雪球，总会伴随不同比例的黑雪球被抛过来，也即是黑雪球永远都存在，这时我们必须要考虑一下两种雪球的相对大小、占比问题了。 黑白雪球相对于彼此有多大呢？ 比如，假设白雪球有乒乓球一般大小，而黑雪球像直径1.83米的巨石。如果是这样的话，可能只需一个黑雪球就可以把我们前面的雪墙完全摧毁——即使白雪球一整天都在被扔过来，但它太小了，几十个不如一个黑雪球大。反过来，如果白雪球有直径1.83米的巨石那么大，黑雪球像乒乓球那么大，那么每天一个白雪球就可能把墙的面积增至足够大，来保护你免受乒乓球大小的黑雪球的连续轰击。 两种雪球的大小比就等于模型中的[利润与损失的相对占比]。 下面说可变因素中的[账户耗损]，也就是交易成本。每个雪球，不管它是白的还是黑的，都对雪墙有轻微的破坏作用。很明显，这种总的破坏力量会对打雪仗的结果有一个总体的影响。 在模型中，可以以墙的状况来度量雪仗的结果。如果墙的整体面积在增大，就表明扔到墙上的白雪球的总量大于黑雪球的总量。不断增大的墙就是在增加的利润，随着它的增大，我们能得到更大的安全感。如果墙在缩小，就意味着更多破坏效果的黑雪球在扔向墙，最终，前面的雪墙将失去其保护功能，导致我们也没法再玩下去。 现在，我们把前面提到的这三个可变因素放在一起考虑，就可以测算出扔到墙上的每一个雪球的平均效果。 在100个雪球扔到墙上以后，想得到扔到墙上的黑白雪球的总量，不仅要从白雪球的正面影响中减掉黑雪球造成的负面影响，还要减掉黑白雪球造成的总的破坏作用。 设：A为白雪球为雪墙带来的增效，B为白雪球对雪墙的破坏作用，C为黑雪球带来的增效，D为黑雪球对墙造成的破坏。 有：总效果Y=A+B+C+D, B、C、D&lt;0，→ Y=A+（-B）+（-C）+（-D） 一旦确定了100个雪球的总效果，用其除以100，你就会得到每个雪球的效果。如果这一结果是正的（也就是白雪球相对更多），那么雪墙会增大；如果这一结果为负（也就是黑雪球相对更多），那么雪墙将会缩小。 用数学表达来说，是这样的例子： 假如有60个白雪球扔到墙上，雪墙就增加6.792立方米； 假如有40个黑雪球扔到墙上，雪墙就缩小3.396立方米； 假如100个雪球总的破坏效果是0.283立方米，100个雪球总的效果是（6.792-3.396-0.283）=3.113（立方米）。 所以，最终的效果为增加3.113立方米； 用100个雪球去除3.113立方米，那最终的影响就是每一个雪球将雪墙增大0.031立方米。 在投资的真实世界里，这个期望值告诉你经过大量的一个单位的交易，你可以期望每一风险元能获得的净的利润或损失。 如果每一笔交易的最终结果为正，你就可以期望你的账户金额增加。 如果最终的结果为负，你就会预测到你的账户将消失。 要注意的是，在这个模型中，你可能会有99次交易亏损，每次亏损一元，结果，你会减少99元。然而，如果你有一次交易赚了500元，那么你的净收入就是500元减99元=401元。——尽管你只有一次交易是赚钱的，而99%的交易都是赔钱的。 假设每次交易的成本是1元，100次交易后必须要支出的耗损是100元，那你的净利润就是301元，你的期望值（每次交易的平均影响）就是每冒1元的风险用来交易，你的结果就增加3.01元。 通过以上，你理解由前三个可变因素共同组成的期望了吗？ 现在把打雪仗的比喻深入一点。 对于[获得机会的频率]这个可变因素，从本质上讲就是雪球扔过来的频率，也即是有多少次交易的机会——在可量化条件下，这样的机会是客观的，非主观的。 假如每个雪球的平均影响就是给雪墙增加0.031立方米的雪，如果每分钟扔一个雪球，扔了1个小时，那总的效果就是给雪墙增加了： 60x0.031=1.868立方米的雪。 同理，如果每小时扔过来2个雪球，那雪墙每小时将只会增加0.062立方米的雪，显然，第一种情形的影响是第二种的30倍。 同理，可以对每天墙面增加多少力方面的雪有个数，这样一来就会少了不切实际的痴心妄想。 很显然，如雪球扔过来的速度对雪墙大小的影响一样，交易的频率对资本的变化速度有着非常显著的影响。 这涉及到我们的对自身能力的评估、动机、欲望、价值观等因素，换言之，如果在100次交易后，期望的净收入是500元，那我们决定用多少时间、什么样的方式方法做这100笔以增加账户规模的交易取决于我们的价值观等因素。可以用一天时间来做这100笔交易，也可以用一年的时间做这100笔交易，这是价值取向。 如果每天做100次交易，那么账户将每月增加10000元（每月有20个交易日）或者说每年增加120000元。 想用哪种方法进行交易：每年获利500元的方法，还是每年获利120000元的方法？ 这两种玩法方法可能是非常相似的，区别是交易的频率。（再次重复）而频率的后面是我们对自身能力的评估、动机、欲望、价值观等因素的考量，普世价值观里是没有“快速”的，需要时间。 根据对打雪仗这个比喻的讨论，现在你认为前四个可变因素中哪几个最为重要？为什么？你的根据是什么？ 希望你现在能明白每一个可变因素的重要性。这些构成了期望值的基础，它们决定了我们交易系统的有效性。 最后看&quot;头寸规模&quot;及&quot;决定因素&quot;这两个可变因素。它们在你的总体利润水平中是最为重要的因素。 你应该已经理解了在打雪仗的游戏里，墙的大小，也就是账户的资金规模，是多么的重要。 如果墙太小，几个黑雪球就能把它摧毁。为了保护你，它必须足够大。 让我们来看头寸规模这个可变因素，它告诉你“多少”的概念。到目前为止，我们都假定一次只有一个雪球扔向墙，但是想象一下同时有很多雪球扔向墙的结果。设想一下一个乒乓球大小的黑雪球扔到墙上的效果，它将在墙上砸出一个乒乓球大小的洞。现在，想象一下10000个黑雪球同时扔到墙上的情形。它完全改变了你能想到的效果， 10000个雪球的比喻简单地解释了头寸规模确定的重要性——现在你明白“多少”的概念了吗？ 我们直到现在都在讨论一个单位的规模——一个雪球或一股股票。10000个乒乓球大小的黑雪球的攻击完全可以摧毁你的雪墙，除非你的墙非常大。 类似地，你可能有一个交易方法，在其亏损时，每股股票只损失1元。然而，如果你买进10000个单位，那么损失突然之间就会变得非常巨大，现在它就是10000元。 现在再来看看决定头寸规模的重要性。如果你的资本是100万元，那么10000元的损失只相当于1%，但是如果你的资本是20000元，那么10000元的损失就是50%。 至此，希望你对一个系统（或是打雪仗）的成功所包含的所有关键因素都有了深刻的认识。 ——摘自《通向财务自由之路》，作者：[美]范 K.撒普 著 董梅 译 ，笔者进行了整理。","path":"posts/20230223222154-730aad8e.html","date":"02-23","excerpt":"","tags":[{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"}]},{"title":"2.21 我有“家传”留给孩子吗？","text":"这几天一直处于既兴奋又有点焦虑之中。兴奋的是我有宝宝了，通过五维我看到了他的样子，那小嘴一张一合的，小手在那里一抓一抓的，我的心都要融化了；焦虑的是我完全没有经验，不懂得将来如何照顾、教育这个孩子。 我知道，爸妈的言传身教对于一个孩子来说是很重要的，但我因此担心起来。 因为我的父母在这方面并没有给我什么实质性的帮助。可以说“家传”值为0. 前些时候，我看到有本书上说，他父亲一直告诉他想钓鱼就要去鱼塘里钓，那里不仅鱼儿多，还都是大鱼胖鱼。我当时就想，这句话，我要结合概率论教给我的孩子。我小时候去抓鱼时父母告诉我的是“再去抓鱼就打断我的腿！”… 对于眼前这个孩子（我们给他起的小名是“点点”），我能传给他些什么？","path":"posts/20230221160759-c7d3d543.html","date":"02-21","excerpt":"这几天一直处于既兴奋又有点焦虑之中。兴奋的是我有宝宝了，通过五维我看到了他的样子，那小嘴一张一合的，小手在那里一抓一抓的，我的心都要融化了；焦虑的是我完全没有经验，不懂得将来如何照顾、教育这个孩子。","tags":[{"name":"孩子","slug":"孩子","permalink":"http://kisma77.github.io/tags/%E5%AD%A9%E5%AD%90/"}]},{"title":"规划谬误","text":"我低估了完成搭建博客这项任务所需要的时间——心理学上将这种现象称其为规划谬误(planning fallacy)。 如对让一些正在写毕业论文的本科生预测他们多久能写完的研究表明，一般大学生会比他们预计的“最现实的”时间晚三周，而会比他们预计的“最糟糕的情况”晚一周（Buehler ,2002)；微软的经理们会下意识地在软件开发者给出的预计完成时间上增加30%的时间，而如果项目中涉及新的操作系统，可能要增加50%的时间（Dunning,2006)。 有人认为，人们之所以会低估完成某件事的时间，是因为他们错误地记忆了之前完成任务实际所用的时间（Roy，2005）.然我认为这不是单纯的记忆出错的问题，一项任务往往不是单一的因素构成，而是由多个影响因子相互作用构成某个较大一些的模块，再由不同的模块组成这个项目所需的整体结构，我们往往高估了自己驾驭任何因子、模块的能力，这种盲目乐观使得我们不得不面对工期一再拖延。 任何一个项目，其中都有多个变量，总会有意想不到的“坑”在前进的路上等着我们，这也是我们容易犯规划谬误的原因。 两个规划谬误的例子： 1.学习数理统计 基于某些原因，我三年前决定学习数理统计知识，这是我的人生中最不可思议的决定，这也在后续学习过程中体现的淋漓尽致。 学习刚起步就发现因基础不好，无法进行正常的学习，甚至连基本的阅读都无法顺利进行。当时选了陈希孺所编著的《概率论与数理统计》作为自学教材，我把书买来，打开教材，在第1页就看到 A={今天下午6时前不会下雨} 这样的一个表达式，能看懂，但很快在第4页看到“掷一个骰子，若出现素数点，则你奖中奖。”这句话时，我蒙圈了，每个字都认识读音，但“素”和“数”这两个都认识的字连起来组成词组“素数”后我就完全不知道它是什么意思了。我只能去搜索这个词的含义： 指在大于1的自然数中，除了1和它本身外，不能被其它自然数整除的数。素数也叫质数。 再往后，由于我对拉丁字母并不熟悉，只知道简单的Ω、α、β，其它的像Σ、θ、ξ、λ…这些我就不认识，我只能去补这个知识点的坑。补这个坑所需要的时间、精力是事先我根本没有考虑进来的。我花费了一些时间记住了拉丁字母，但接下来一些简单的中学数学知识拦住了我，由于毕业太久，加之我上中学的时候学习就不好，当时根本不喜欢数学（我只是初一的时候非常喜欢几何），对于像CnrC^r _nCnr​ 这样的符号组一出现我就蒙圈了，根本不知道运算法则是什么，我又只能回去补。因此，学习概率与数理分析的过程变成了补拉丁字母、集合及运算、函数、微积分等基础知识的过程。理科的东西，真的是落下一个知识点就会给未来的学习留下一个要前进就必须回补的大坑。如果我跳过这些知识，那我是没法进一步学习的，而这是我事先并不知晓，并未考虑进来的学习所需时间、精力的评估。 2.搭建这个博客 我一直想法很多，也有意将这些想法记录下来，在中学时候就喜欢在QQ空间上写东西，后来喜欢去论坛发帖子，再后来用新浪博客、网易博客，再后来写微博、知乎，通过几年的积累，也积攒了几十万微博粉丝。我认为自己是一个喜欢热闹的人，也喜欢与人交流，但逐渐的我发现我在网络上所有的分享都是为了“付出”——这个观点现在我已经修正，以后再说——，我越来越烦这些平台上的“反馈”{点赞、喜欢、评论、转发…}，我真正想要的是价值交换，即我分享了自己的某个想法、观点，我希望得到懂行的人的专业性点评，这样我能学到东西。 可惜一直没有得到，我得到的都是一些看上去很友善，实则毫无价值的反馈。 我想要一个安安静静记录自己大脑里的声音。于是想到了搭建这个博客。 心理学上，正反馈能提升自我效能，也就是说做某件事要想长久，这件事带来的正反馈是必不可少的。就拿个人博客来说，如果一个人写博客一直没有观众，以及即便有观众，却没有任何留言的反馈，这样博主是很难坚持下去的，缺少正反馈。但我还是选择了无留言的模式，因为我的目的不是和众多的网友交流，我有我的目的。 用github搭建这个博客，理论上不难，但与我而言却不简单。 我不懂英语，不懂代码，不懂所谓的“梯子”为何物以及如何用。在去年6月份时我就试图搭建这个博客，但终因不会使用github，加上当时主要任务是学数理统计，就“因能力、精力双双不及”而中断。 今年数理统计学完了，有了一些时间，我就学着使用github，学着使用它来搭建hexo博客。过程还是不那么顺利，试了很多次才能碰对一次进行“下一步”，此时又会遇到问题，又需要阅读帮助文档、网上搜别人写的教程看，搞定后再进行下一步。 我一开始以为搭建个人博客是一件“傻瓜相机式”的操作，事实证明不是。 （未完，要陪媳妇出去遛弯了）","path":"posts/20230219115605-afa62016.html","date":"02-19","excerpt":"","tags":[{"name":"认知心理学","slug":"认知心理学","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5%E5%BF%83%E7%90%86%E5%AD%A6/"}]},{"title":"2.18 见到宝宝的样子了！","text":"宝宝27周了，第一次“见到”了模样！~ 今天又摸着老婆的肚子，感受宝宝的跳动，实在太可爱了，马上27周了，是个男孩 身体开始出问题了 今天有些心悸，就是那种突然间闷闷的疼痛感，我赶紧使劲拍胸口并大口呼吸。 跟爱人说了这事，她说要不要去医院，担心我心血管疾病，我说再观察几天，她说可不能生病，她和未出生的孩子还指望我。 我听着听难受的。 最近总是上不来气，走路喘、累，我和她都没“阳”过，但我怀疑自己阳过。 我以后要早点休息，我的睡眠实在是很糟糕，现在不像年轻的时候了，今年41岁的人了，进入中年后，由于我不爱运动，可能会进入诸如高血糖、高血脂、心血管方面的等各种各样的疾病多发期。 人容易走出去回不来 最近几天都在弄这个博客，截止到现在基本算弄完了，但图片显示还是有些问题，我不打算继续在这件事上浪费时间了。 多年来我发现自己以及观察到的人有个奇怪的现象，拿这个博客来说，本来可以写字、记录就可以，非要陷入“优化陷阱”，不停地各种折腾，最后“日记”没写几篇，时间都浪费在折腾上了。 人容易走出去，但往往越走越远，最终回不来，只能在新的地方（远方）安家。 这个博客就这么素素的写吧，不再浪费时间在“图片显示”上了，如果真必须要使用图片，到时候再看怎么。 `","path":"posts/20230218234305-aea9dc95.html","date":"02-18","excerpt":"宝宝27周了，第一次“见到”了模样！~ 今天又摸着老婆的肚子，感受宝宝的跳动，实在太可爱了，马上27周了，是个男孩","tags":[{"name":"孩子","slug":"孩子","permalink":"http://kisma77.github.io/tags/%E5%AD%A9%E5%AD%90/"}]},{"title":"wiki主题新建多级分类目录的方法","text":"wikitten主题（简称wiki主题，后同）开设多级分类目录的方法。 方法很简单，在模板之中都已经设计好多级分类的使用方法，在写博客的时候只需要在文件头设置即可。 例如，本篇博文是属于hexo博客建设分类下的，那就 123categories: - hexo博客建设 - wikitten主题 出来后效果就是 注意，最多支持四级。","path":"posts/20230218101108-a1cefd1d.html","date":"02-18","excerpt":"","tags":[{"name":"hexo博客","slug":"hexo博客","permalink":"http://kisma77.github.io/tags/hexo%E5%8D%9A%E5%AE%A2/"}]},{"title":"wiki主题添加分享到微博","text":"在hexo中使用wiki主题时添加百度分享的方法。 网上查找在hexo中添加链接分享的方法是，查到的都是用next主题的， 用wiki主题时，如何添加分享并没有介绍。 自己翻了一下代码，发现wikitten主题的结构非常清楚。 第一步 在_config.xml中的share选项中的几个分享的选项 12# Shareshare: bdshare # options: jiathis, bdshare, addtoany, default 第二步 在\\themes\\Wiki\\layout\\share文件夹中都有对应的文件。 第三步 打开bdshare.ejs 可以把现在已经不存在的开心网，腾讯微博的链接去掉，只保留qq空间，新浪微博和微信。 123456&lt;div class=&quot;bdsharebuttonbox&quot;&gt; &lt;a href=&quot;#&quot; class=&quot;bds_more&quot; data-cmd=&quot;more&quot;&gt; 分享到：&lt;/a&gt; &lt;a href=&quot;#&quot; class=&quot;bds_qzone&quot; data-cmd=&quot;qzone&quot; title=&quot;分享到QQ空间&quot;&gt;QQ空间&lt;/a&gt; &lt;a href=&quot;#&quot; class=&quot;bds_tsina&quot; data-cmd=&quot;tsina&quot; title=&quot;分享到新浪微博&quot;&gt;新浪微博&lt;/a&gt; &lt;a href=&quot;#&quot; class=&quot;bds_weixin&quot; data-cmd=&quot;weixin&quot; title=&quot;分享到微信&quot;&gt;微信&lt;/a&gt;&lt;/div&gt; 之后把保存的bdshare.ejs文件复制并放到主题目录下的\\themes\\Wiki\\layout\\common下 第四步 修改common目录下的article.ejs（article.ejs就是决定着hexo生成的静态文件的布局）。 把分享链接放到文章的标题栏的日期的位置 1234567891011121314151617181920212223&lt;div class=&quot;article-meta&quot;&gt; &lt;%- partial(&#x27;post/category&#x27;) %&gt; &lt;%- partial(&#x27;post/tag&#x27;) %&gt; &lt;%- partial(&#x27;post/date&#x27;, &#123; class_name: &#x27;article-date&#x27;, date_format: null &#125;) %&gt; &lt;%- partial(&#x27;share/bdshare&#x27;) %&gt; &lt;% if (theme.plugins.busuanzi_count) &#123; %&gt; &lt;i class=&quot;fa fa-bar-chart&quot;&gt;&lt;/i&gt; &lt;span id=&quot;busuanzi_container_site_pv&quot;&gt;&lt;span id=&quot;busuanzi_value_page_pv&quot;&gt;&lt;/span&gt;&lt;/span&gt; &lt;% &#125; %&gt; &lt;% if (theme.history_control.enable) &#123; let repertory_address = `$&#123;theme.history_control.server_link&#125;/$&#123;theme.history_control.user&#125;/$&#123;theme.history_control.repertory&#125;`; let file_path = `$&#123;theme.history_control.branch&#125;/source/$&#123;post.source&#125;`;%&gt; &lt;div class=&quot;article-meta-button&quot;&gt; &lt;a href=&#x27;&lt;%= `$&#123;repertory_address&#125;/raw/$&#123;file_path&#125;` %&gt;&#x27;&gt; Source &lt;/a&gt; &lt;/div&gt; &lt;div class=&quot;article-meta-button&quot;&gt; &lt;a href=&#x27;&lt;%= `$&#123;repertory_address&#125;/edit/$&#123;file_path&#125;` %&gt;&#x27;&gt; Edit &lt;/a&gt; &lt;/div&gt; &lt;div class=&quot;article-meta-button&quot;&gt; &lt;a href=&#x27;&lt;%= `$&#123;repertory_address&#125;/commits/$&#123;file_path&#125;` %&gt;&#x27;&gt; History &lt;/a&gt; &lt;/div&gt; &lt;% &#125; %&gt;&lt;/div&gt; 找到&lt;%- partial('post/date', &#123; class_name: 'article-date', date_format: null &#125;) %&gt;,然后把&lt;%- partial('share/bdshare') %&gt;放到它后面，并保存。 完成。","path":"posts/20230218095110-5a6474cc.html","date":"02-18","excerpt":"","tags":[{"name":"hexo博客","slug":"hexo博客","permalink":"http://kisma77.github.io/tags/hexo%E5%8D%9A%E5%AE%A2/"}]},{"title":"Hello World And 博客配置记录","text":"记录本博客的配置 1.配置“永久连接” 1.1 安装abbrlink插件 在博客根目录（执行hexo命令的地方）安装插件： 1npm install hexo-abbrlink --save 1.2 编辑站点配置文件 打开博客根目录下的站点配置文件_config.yml，修改如下配置： 123456#permalink: :year/:month/:day/:title/#permalink_defaults:permalink: posts/:abbrlink/abbrlink: alg: crc32 #support crc16(default) and crc32 rep: dec #support dec(default) and hex 1.3 重新生成部署 使用hexo clean &amp;&amp; hexo g重新生成博客，在博客源文件可以看到自动生成的abbrlink编号,接下来使用hexo d部署，使用浏览器查看： 这样优化后的优点是： 纯英文和数字链接非常有利于SEO； 只要abbrlink编号不变，该文章的url就不变，可以随意修改文件名，文章标题。 2.数学公式 以默认的 landscape主题为例， 2.1 安装公式渲染插件 先卸载掉自带的 hexo-renderer-marked ，替换为 hexo-renderer-markdown-it-plus 12$ npm un hexo-renderer-marked --save$ npm i hexo-renderer-markdown-it-plus --save 2.2 修改文章模板 修改/scaffolds/post.md 文件，在 — 前添加一行 math: false 。故如果某篇文章想启用数学公式支持，需将 false 改为 true 。 2.3 修改主题布局模板 有以下两种选择： 2.3.1 阅读全文后启用支持 编辑 &lt;hexo dir&gt;/themes/landscape/layout/_partial/article.ejs ，在 &lt;/article&gt; 前加入一行代码，添加后效果如下： 12345678/themes/landscape/layout/_partial/head.ejs &lt;% if (!index &amp;&amp; post.math)&#123; %&gt; &lt;script&gt; var assetsString = &#x27;&lt;link href=&quot;https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.10.0/katex.min.css&quot; rel=&quot;stylesheet&quot; type=&quot;text/css&quot;&gt;&#x27; var pHead = document.getElementsByTagName(&#x27;head&#x27;)[0]; pHead.innerHTML = pHead.innerHTML + assetsString; &lt;/script&gt; &lt;% &#125; %&gt;&lt;/article&gt; 故需将 &lt;!--more--&gt; 放在公式之前。 2.3.2 直接全部启用支持 编辑 &lt;hexo dir&gt;/themes/landscape/layout/_partial/head.ejs ，在 &lt;/head&gt; 前加入一行代码，添加后效果如下： 12/themes/landscape/layout/_partial/head.ejs &lt;link href=&quot;https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.10.0/katex.min.css&quot; rel=&quot;stylesheet&quot; type=&quot;text/css&quot;&gt;&lt;/head&gt; 编辑配置文件 在站点配置文件 _config.yml 中加入如下配置： 12345678910/_config.ymlmarkdown_it_plus: highlight: true html: true xhtmlOut: true breaks: true langPrefix: linkify: true typographer: quotes: “”‘’ pre_class: highlight 用法 整行： 1$$sin^2\\theta + cos^2\\theta = 1$$ 效果：$$sin^2\\theta + cos^2\\theta = 1$$ 行内，开头和结尾用一个$就行： 1$sin^2\\theta + cos^2\\theta = 1$ 行内效果：sin2θ+cos2θ=1sin^2\\theta + cos^2\\theta = 1sin2θ+cos2θ=1 测试用例： 12345678910111213141516$$\\begin&#123;aligned&#125;f_Y(y) &amp; = f_X[h(y)]|h&#x27;(y)| \\\\[2ex]&amp; = f_X[h(y)]h&#x27;(y) \\\\[2ex]&amp; = \\frac&#123;1&#125;&#123;\\theta&#125;e^&#123;-\\frac&#123;x&#125;&#123;\\theta&#125;&#125;[\\frac&#123;dx&#125;&#123;dy&#125;(-\\frac&#123;\\theta&#125;&#123;ln(1-y)&#125;)] \\\\[2ex]&amp; = \\frac&#123;1&#125;&#123;\\theta&#125;e^&#123;-\\frac&#123;-\\frac&#123;\\theta&#125;&#123;ln(1-y)&#125;&#125;&#123;\\theta&#125;&#125;\\frac&#123;\\theta&#125;&#123;1-y&#125; \\\\[2ex]&amp; = \\frac&#123;1&#125;&#123;\\theta&#125;e^&#123;ln(1-y)&#125;\\frac&#123;\\theta&#125;&#123;1-y&#125; \\\\[2ex]&amp; = \\frac&#123;1-y&#125;&#123;\\theta&#125;\\frac&#123;\\theta&#125;&#123;1-y&#125; \\\\[2ex]&amp; = 1\\end&#123;aligned&#125;\\tag&#123;1&#125;$$$$\\frac&#123;1&#125;&#123;\\sigma&#125; \\tag&#123;this is a test&#125;$$ 测试效果： fY(y)=fX[h(y)]∣h′(y)∣=fX[h(y)]h′(y)=1θe−xθ[dxdy(−θln(1−y))]=1θe−−θln(1−y)θθ1−y=1θeln(1−y)θ1−y=1−yθθ1−y=1(1)\\begin{aligned} f_Y(y) &amp; = f_X[h(y)]|h&#x27;(y)| \\\\[2ex] &amp; = f_X[h(y)]h&#x27;(y) \\\\[2ex] &amp; = \\frac{1}{\\theta}e^{-\\frac{x}{\\theta}}[\\frac{dx}{dy}(-\\frac{\\theta}{ln(1-y)})] \\\\[2ex] &amp; = \\frac{1}{\\theta}e^{-\\frac{-\\frac{\\theta}{ln(1-y)}}{\\theta}}\\frac{\\theta}{1-y} \\\\[2ex] &amp; = \\frac{1}{\\theta}e^{ln(1-y)}\\frac{\\theta}{1-y} \\\\[2ex] &amp; = \\frac{1-y}{\\theta}\\frac{\\theta}{1-y} \\\\[2ex] &amp; = 1 \\end{aligned} \\tag{1} fY​(y)​=fX​[h(y)]∣h′(y)∣=fX​[h(y)]h′(y)=θ1​e−θx​[dydx​(−ln(1−y)θ​)]=θ1​e−θ−ln(1−y)θ​​1−yθ​=θ1​eln(1−y)1−yθ​=θ1−y​1−yθ​=1​(1) 和 y=axy=a_x y=ax​ 公式这块我还没搞懂，弄出来的公式显示不正常，是“双影”，如下图所示，还不知道该怎么弄 由于公式使用不多，问题暂时先挂起。 3.显示本地图片 3.1 安装插件 1npm install hexo-asset-image -- save 3.2 配置_config.yml 把_config.yml中的post_asset_folder设为true，这个配置的意思是每次new post一个博客，会增加一个和博客同名的文件夹，之后新建了一篇文章，就会同时在hexo/source/_post文件夹下生成一个.md文件和一个同名文件夹，文件夹存放文章中的图片。 3.3 使用规则 把图片放到.md文件的同名文件夹&quot;first-page&quot;里，最后在.md文件中引用图片 1![图片描述]（./文章同标题文件夹/编号.jpg） 我不喜欢每篇文章都有一个同名文件夹，这样时间长了后比较麻烦，我采用的是图床，这样可以直接截图粘贴进文章就可以 或者将需要的图片直接“拉”进文章也可以 4.去掉页面的“阅读更多” hexo 博客如果不自己在文章添加一个&lt;!--more--&gt; 标记，上传后整篇不管多长都直接给你放在主页，想看下面的几篇博文就要滑滑滑，滑半天才能看到后面几篇博文，既不符合设计原则，也不美观不方便。 4.1 传统方式 在文章中使用&lt; !--more--&gt; 手动进行截断. 这种方法可以根据文章的内容，自己在合适的位置添加 &lt; !--more--&gt; 标签，使用灵活，也是Hexo推荐的方法。 可以在\\scaffolds\\post.md模板里设置，不用每篇文章都手动添加。 自动形成摘要，在主题配置文件中添加 默认截取的长度为 150 字符，可以根据需要自行设定 123auto_excerpt: enable: true length: 150 官方建议使用 &lt; !-- more --&gt;方式，除了可以精确控制需要显示的摘录内容以外， 这种方式也可以让 Hexo 中的插件更好的识别。 我觉得很不好，——实现方式粗暴直接，主页上有很多“ read more”，不美观。 那就自己改一下。 按照逻辑来说，我们所关注的就是写文章，而摘要应该是根据文章内容通过 tf-idf 等一系列摘要算法生成的，再不济也应该是直接截取文章开头一段文字作为摘要嘛，总之是应该自动生成的，而且不应该修改 MD 源文件。 思路：改主题代码。 就我个人而言，以行的方式截取比以字数的方式截取的结果，对摘要完整性要友好的多。 整理下我的需求，最后我得到几点初步的要求： 能在主题配置文件中配置是否开启自动摘要 摘要以行为单位自动从开头截取 能配置固定截取的行数 根据这几项需求，自己动手一步步实现。 首先是找到要修改的代码的位置，因为这里主要是对文章显示时的修改，相关代码肯定是在有关文章内容显示的文件内，对 hexo 来说，通常是 article.ejs post.ejs 等类似名字的文件，它们的特点就是都会在主页显示文章和单独访问博文时用到。 我用的是landscape主题，这里就是\\node_modules\\hexo-theme-landscape\\layout\\_partial\\article.ejs这个文件 打开 article.ejs，找到与摘要相关的代码： 12345678910111213141516&lt;div class=&quot;article-entry&quot; itemprop=&quot;articleBody&quot;&gt;&lt;% if (index &amp;&amp; post.excerpt) &#123; %&gt; &lt;p&gt;&lt;%- post.excerpt %&gt;&lt;/p&gt; &lt;p class=&quot;article-more-link&quot;&gt; &lt;a href=&quot;&lt;%- url_for(post.path) %&gt;#more&quot;&gt;&lt;%= __(&#x27;article.more&#x27;) %&gt;&lt;/a&gt; &lt;/p&gt;&lt;% &#125; else &#123; %&gt; &lt;% if (!index &amp;&amp; post.toc) &#123; %&gt; &lt;div id=&quot;toc&quot; class=&quot;toc-article&quot;&gt; &lt;strong class=&quot;toc-title&quot;&gt;&lt;%= __(&#x27;article.catalogue&#x27;) %&gt;&lt;/strong&gt; &lt;%- toc(post.content) %&gt; &lt;/div&gt; &lt;% &#125; %&gt; &lt;%- post.content %&gt;&lt;% &#125; %&gt;&lt;/div&gt; 这里简单讲一下各变量含义，这各文件是在每篇文章生成时被调用的， index 是指现在是否在首页的标志 post 指这篇文章 post.excerpt 指文章原始摘要内容，既 &lt;!--more--&gt;之前的内容。 url_for() 返回一个 root 路径的 url，不带域名 post.path 指文章的网址，不含 root 目录 post.toc 指文章目录显示是否开了 toc() 解析文本，生成目录，既 h1-h6 的列表。 post.content 指文章全部内容 现在再看，article.ejs 里代码的逻辑就很清楚了，在遍历文章的时候 先判断当前页面是否在首页，如果在首页并且这篇文档有摘要，那就只显示摘要并显示一个 ReadMore；否则 就显示全文（其中有一个“判断不在首页并且文章配置了开启目录就显示目录”与我们现在讨论的 readmore 无关所以暂且不管）。 按照我们的思路，应该就是在上面“否则”后面加上自动截取前 n 行作为摘要并显示 ReadMore。 一步步来， 首先，我们需要一个可以配置的开关，用来配置是否启用自动截取生成摘要的功能，还需要一个可以配置的变量，用来配置固定截取几行。 文章显示是主题干的事，这两个配置也是主题相关的，因此我们打开 主题配置文件，添加几个键值对并保存： 123456# Excerpt ## Auto creat excerpt with not &lt;!--more--&gt;## Enable will truncate auto_excerpt.lines rows in post head to replace excerpt.auto_excerpt: enable: true lines: 5 然后回到 article.ejs 里，梳理一下我们的思路，整理一下一共有哪些显示摘要，哪些不显示的情况： 不显示 ReadMore 的情况 不在首页 在首页，无摘要，关闭自动截取 在首页，无摘要，使能自动截取，文章没有足够的长度 显示 ReadMore 的情况 在首页，有摘要 在首页，无摘要，使能自动截取，文章足够长 将以上情况整理成判断逻辑，再把目录显示加上，列出一个“中式代码”： 1234567891011121314151617是否显示全文 = trueif 在首页: if 有摘要: 是否显示全文 = false 显示摘要 else if 主题.自动截取.使能: 截取前 n 行作为摘要 if 文章长度足够: 是否显示全文 = false 显示截取的结果else: if 文章配置显示目录: 显示目录if 是否显示全文: 显示全文else: 显示 ReadMore 这样来看逻辑很清晰了。 然后就是具体实现过程中我遇到的两个问题： ReadMore 总是可能被当成文章文字的一部分而被改变样式 原因是 icarus 原本就是把 ReadMore 用 p 标签放在文章中间的，如果 ReadMore 刚好实在一个列表间或者一块代码间，那显示就会很奇怪了。我改成了把整个摘要或者说文章放在一个 div 中，再把 Readmore 放在后面的另一块 div 中，这样 ReadMore 就与内容无关了。 如何读取行数 前面提到的两个自动截取摘要的文章，一篇 NexT 是自动截取字数，另一篇是固定截取两行， 而我想的办法是通过多次调用 string.indexOf(str, start_position) 方法，每次改变起始位置来获取下一次的位置，有一次获取不到位置就说明文章还没有那么多行的长度。 然后再用 string.substring(start, end) 方法，截取到获取的位置。 12345678&lt;% var br_position = 0 %&gt;&lt;% for (var br_count = 0; br_count &lt; theme.auto_excerpt.lines; br_count++) &#123; %&gt; &lt;% br_position = post.content.indexOf(&#x27;\\n&#x27;,br_position + 1) %&gt; &lt;% if(br_position &lt; 0) &#123; break &#125; %&gt;&lt;% &#125; %&gt;&lt;% if(br_position &gt; 0) &#123; %&gt; &lt;p&gt;&lt;%- post.content.substring(0, br_position + 1) %&gt;&lt;p&gt;&lt;% &#125; %&gt; 现在开始按照伪代码的逻辑编写 ejs 了，最后的工作就是把原来 article.ejs 的摘要相关代码（本节开头提到的）全部替换成我们写的自动截取摘要的代码： 12345678910111213141516171819202122232425262728293031323334&lt;div class=&quot;article-entry&quot; itemprop=&quot;articleBody&quot;&gt;&lt;% var show_all_content = true %&gt;&lt;% if (index) &#123; %&gt; &lt;% if (post.excerpt) &#123; %&gt; &lt;% show_all_content = false %&gt; &lt;p&gt;&lt;%- post.excerpt %&gt;&lt;/p&gt; &lt;% &#125; else if (theme.auto_excerpt.enable) &#123; %&gt; &lt;% var br_position = 0 %&gt; &lt;% for (var br_count = 0; br_count &lt; theme.auto_excerpt.lines; br_count++) &#123; %&gt; &lt;% br_position = post.content.indexOf(&#x27;\\n&#x27;,br_position + 1) %&gt; &lt;% if(br_position &lt; 0) &#123; break &#125; %&gt; &lt;% &#125; %&gt; &lt;% if(br_position &gt; 0) &#123; %&gt; &lt;% show_all_content = false %&gt; &lt;p&gt;&lt;%- post.content.substring(0, br_position + 1) %&gt;&lt;p&gt; &lt;% &#125; %&gt; &lt;% &#125; %&gt;&lt;% &#125; else &#123; %&gt; &lt;% if (post.toc) &#123; %&gt; &lt;div id=&quot;toc&quot; class=&quot;toc-article&quot;&gt; &lt;strong class=&quot;toc-title&quot;&gt;&lt;%= __(&#x27;article.catalogue&#x27;) %&gt;&lt;/strong&gt; &lt;%- toc(post.content) %&gt; &lt;/div&gt; &lt;% &#125; %&gt;&lt;% &#125; %&gt;&lt;% if (show_all_content) &#123; %&gt; &lt;%- post.content %&gt; &lt;/div&gt;&lt;% &#125; else &#123; %&gt; &lt;/div&gt; &lt;div class=&quot;article-more-link&quot;&gt; &lt;a href=&quot;&lt;%- url_for(post.path) %&gt;#more&quot;&gt;&lt;%= __(&#x27;article.more&#x27;) %&gt;&lt;/a&gt; &lt;/div&gt;&lt;% &#125; %&gt; 此时， 123hexo cleanhexo ghexo s 预览发现显示“article.more” 删除代码&lt;a href=&quot;&lt;%- url_for(post.path) %&gt;#more&quot;&gt;&lt;%= __('article.more') %&gt;&lt;/a&gt;中的article.more 搞定，现在你可以把原来文章中的 &lt;!--more--&gt; 删了，以后也不用再写了。","path":"posts/20230217204235-77f46582.html","date":"02-17","excerpt":"","tags":[{"name":"hexo博客","slug":"hexo博客","permalink":"http://kisma77.github.io/tags/hexo%E5%8D%9A%E5%AE%A2/"}]},{"title":"关于机会","text":"首先要定义出什么是机会，我选择在数学上定义它。 当【机会】没出现时，我总是时刻幻想着它一旦来了我要如何如何做，并急不可待地希望它早点到来，夜里想到一个“好点子”马上爬起来打开电脑去“验证”，可当它真的出现在我眼前时，我却又开始对它产生了怀疑，怀疑它是陷阱伪装出来戴着机会的面具，信念动摇，怀疑、担心、贪婪、恐惧…吞噬着我，它们令我不敢行动或做出不利的行为，可事后我又会陷入无边的后悔中。” 一定要珍惜机会，当[[机遇]]出现时，要有统计学的思维和[[信念]]，牢牢把握住。一旦缺乏[[信心]]错过窗口期，不仅会后悔，再去追机会容易受伤。","path":"posts/20230217142829-6034efb5.html","date":"02-17","excerpt":"","tags":[{"name":"概率","slug":"概率","permalink":"http://kisma77.github.io/tags/%E6%A6%82%E7%8E%87/"},{"name":"统计","slug":"统计","permalink":"http://kisma77.github.io/tags/%E7%BB%9F%E8%AE%A1/"},{"name":"数理思维","slug":"数理思维","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E7%90%86%E6%80%9D%E7%BB%B4/"}]}],"categories":[],"tags":[{"name":"交易","slug":"交易","permalink":"http://kisma77.github.io/tags/%E4%BA%A4%E6%98%93/"},{"name":"投资","slug":"投资","permalink":"http://kisma77.github.io/tags/%E6%8A%95%E8%B5%84/"},{"name":"认知","slug":"认知","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5/"},{"name":"心理学","slug":"心理学","permalink":"http://kisma77.github.io/tags/%E5%BF%83%E7%90%86%E5%AD%A6/"},{"name":"改变","slug":"改变","permalink":"http://kisma77.github.io/tags/%E6%94%B9%E5%8F%98/"},{"name":"知识","slug":"知识","permalink":"http://kisma77.github.io/tags/%E7%9F%A5%E8%AF%86/"},{"name":"人生选择","slug":"人生选择","permalink":"http://kisma77.github.io/tags/%E4%BA%BA%E7%94%9F%E9%80%89%E6%8B%A9/"},{"name":"人生规划","slug":"人生规划","permalink":"http://kisma77.github.io/tags/%E4%BA%BA%E7%94%9F%E8%A7%84%E5%88%92/"},{"name":"生活日记","slug":"生活日记","permalink":"http://kisma77.github.io/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E8%AE%B0/"},{"name":"博客插入视频","slug":"博客插入视频","permalink":"http://kisma77.github.io/tags/%E5%8D%9A%E5%AE%A2%E6%8F%92%E5%85%A5%E8%A7%86%E9%A2%91/"},{"name":"hexo博客","slug":"hexo博客","permalink":"http://kisma77.github.io/tags/hexo%E5%8D%9A%E5%AE%A2/"},{"name":"成功","slug":"成功","permalink":"http://kisma77.github.io/tags/%E6%88%90%E5%8A%9F/"},{"name":"投机","slug":"投机","permalink":"http://kisma77.github.io/tags/%E6%8A%95%E6%9C%BA/"},{"name":"博客","slug":"博客","permalink":"http://kisma77.github.io/tags/%E5%8D%9A%E5%AE%A2/"},{"name":"颐和园","slug":"颐和园","permalink":"http://kisma77.github.io/tags/%E9%A2%90%E5%92%8C%E5%9B%AD/"},{"name":"北京胡同","slug":"北京胡同","permalink":"http://kisma77.github.io/tags/%E5%8C%97%E4%BA%AC%E8%83%A1%E5%90%8C/"},{"name":"智慧","slug":"智慧","permalink":"http://kisma77.github.io/tags/%E6%99%BA%E6%85%A7/"},{"name":"商品期货","slug":"商品期货","permalink":"http://kisma77.github.io/tags/%E5%95%86%E5%93%81%E6%9C%9F%E8%B4%A7/"},{"name":"照相","slug":"照相","permalink":"http://kisma77.github.io/tags/%E7%85%A7%E7%9B%B8/"},{"name":"做事原则","slug":"做事原则","permalink":"http://kisma77.github.io/tags/%E5%81%9A%E4%BA%8B%E5%8E%9F%E5%88%99/"},{"name":"育儿","slug":"育儿","permalink":"http://kisma77.github.io/tags/%E8%82%B2%E5%84%BF/"},{"name":"交易心理","slug":"交易心理","permalink":"http://kisma77.github.io/tags/%E4%BA%A4%E6%98%93%E5%BF%83%E7%90%86/"},{"name":"搬家","slug":"搬家","permalink":"http://kisma77.github.io/tags/%E6%90%AC%E5%AE%B6/"},{"name":"认知心理学","slug":"认知心理学","permalink":"http://kisma77.github.io/tags/%E8%AE%A4%E7%9F%A5%E5%BF%83%E7%90%86%E5%AD%A6/"},{"name":"情感","slug":"情感","permalink":"http://kisma77.github.io/tags/%E6%83%85%E6%84%9F/"},{"name":"租房","slug":"租房","permalink":"http://kisma77.github.io/tags/%E7%A7%9F%E6%88%BF/"},{"name":"平面设计","slug":"平面设计","permalink":"http://kisma77.github.io/tags/%E5%B9%B3%E9%9D%A2%E8%AE%BE%E8%AE%A1/"},{"name":"工作经验","slug":"工作经验","permalink":"http://kisma77.github.io/tags/%E5%B7%A5%E4%BD%9C%E7%BB%8F%E9%AA%8C/"},{"name":"数学","slug":"数学","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E5%AD%A6/"},{"name":"数理统计","slug":"数理统计","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E7%90%86%E7%BB%9F%E8%AE%A1/"},{"name":"概率思维","slug":"概率思维","permalink":"http://kisma77.github.io/tags/%E6%A6%82%E7%8E%87%E6%80%9D%E7%BB%B4/"},{"name":"孩子","slug":"孩子","permalink":"http://kisma77.github.io/tags/%E5%AD%A9%E5%AD%90/"},{"name":"概率","slug":"概率","permalink":"http://kisma77.github.io/tags/%E6%A6%82%E7%8E%87/"},{"name":"统计","slug":"统计","permalink":"http://kisma77.github.io/tags/%E7%BB%9F%E8%AE%A1/"},{"name":"数理思维","slug":"数理思维","permalink":"http://kisma77.github.io/tags/%E6%95%B0%E7%90%86%E6%80%9D%E7%BB%B4/"}]}